{
  "search_info": {
    "keywords": "SEO",
    "location": "Paris",
    "limit_requested": 5,
    "jobs_found": 5,
    "search_timestamp": "2025-08-26T14:56:54.011010"
  },
  "jobs": [
    {
      "id": "4270186509",
      "title": "Consultant(e) SEO Senior (F/H) - CDI",
      "company": "WPP Media",
      "location": "Paris, Île-de-France, France",
      "description": "Description\n\nDans un souci de clarté et d’accessibilité, nous avons choisi de ne pas utiliser l’écriture inclusive dans nos communications. WPP Media est fermement engagé en faveur de la diversité : nous valorisons l'inclusion et l'égalité, en considérant tous les candidats sans distinction d'identité de genre, d'origine ethnique ou de religion. Tous nos postes sont également ouverts aux personnes en situation de handicap.\n\nA propos de WPP Media :\n\nWPP is the creative transformation company. Nous utilisons le pouvoir de la créativité pour construire un avenir meilleur pour nos collaborateurs, notre planète, nos clients et nos communautés. Pour plus d'informations, visitez wpp.com. WPP Media est le collectif média global de WPP. Dans un monde où les médias sont omniprésents nous regroupons la meilleure plateforme, les meilleurs talents et les meilleurs partenaires pour développer les solutions les plus innovantes, offrant une croissance inégalée à nos clients. Pour plus d'informations, visitez wppmedia.com.\n\nChez WPP Media, nous croyons en la puissance de notre culture et de nos collaborateurs. C'est grâce à cette synergie que nous parvenons à créer des expériences véritablement exceptionnelles, tant pour nos clients que pour nos équipes internes. Pour réussir dans ce poste, il est fondamental d'incarner les valeurs essentielles qui unissent WPP et WPP Media :\n\nÊtre Extraordinaire en favorisant un leadership collectif qui inspire une créativité véritablement transformationnelle.Créer un environnement Ouvert en trouvant l'équilibre parfait entre l'épanouissement de nos collaborateurs et la satisfaction de nos clients, le tout fondé sur une confiance mutuelle.Diriger avec Optimisme en stimulant activement la croissance et le développement pour mobiliser l'ensemble de notre organisation.\n\nContexte Le pôle SEO de GroupM accélère sa transformation technique et produit. Nous cherchons un Consultant SEO Technique Senior capable de prendre la main sur nos comptes les plus complexes tout en structurant nos assets internes\n\nMissions :\n\nEn tant que Consultant SEO Technique Senior, vous jouerez un rôle clé dans l'accélération de la transformation technique et produit de notre pôle SEO. Vos responsabilités s'articuleront autour des axes suivants :\n\nExpertise SEO Technique Avancée :Réaliser des audits techniques approfondis sur des environnements complexes (JavaScript, internationalisation, e-commerce).Mener des analyses pointues de logs, de rendu JavaScript et de performance technique.Concevoir, piloter et automatiser des plans de redirection complexes.Prioriser les optimisations en croisant les données issues du crawl, des logs, de Google Search Console et des outils d'analytics.Ingénierie et Analyse de Données SEO :Concevoir et implémenter des workflows SEO robustes (via BigQuery, Python, etc.) pour alimenter nos outils internes et nos analyses.Automatiser les tâches répétitives pour optimiser l'efficacité opérationnelle.Produire des insights clairs, actionnables et à forte valeur ajoutée.Développer des dashboards interactifs (Looker Studio, dataviz avancée) pour la visualisation des performances.Développement et Maintenance d'Outils Internes :Contribuer activement à la roadmap de nos outils SEO internes (scoring, extracteurs, systèmes d'alerte, etc.).Assurer l'évolution des outils du pôle en étroite collaboration avec l'équipe SEA.Maintenir des systèmes de scraping fiables et performants (produits, marketplaces, SERP).Intégrer de nouveaux frameworks et APIs, et challenger les outils du marché pour garantir notre avance technologique.Innovation et Intégration de l'IA :Intégrer des briques LLM/IA dans nos outils et méthodologies SEO pour optimiser nos stratégies.Participer activement à la formalisation et au développement de notre offre cross-search (SEO, LLM, SEA, social).Appuyer la montée en compétence de l'équipe sur les sujets liés à l'intelligence artificielle et à la recherche sémantique.Conseil Stratégique et Transversalité :Agir en tant que référent technique sur des comptes clés, en co-pilotant les stratégies SEO.Présenter les recommandations techniques avec clarté, pédagogie et conviction.Travailler en synergie avec les équipes Paid, Data, Analytics, Développement et Produit pour des stratégies intégrées.Représenter et défendre la vision technique du SEO lors des échanges stratégiques avec les clients et les équipes internes.\n\nProfil recherché\n\nNous recherchons un Consultant SEO Technique Senior passionné par l'innovation et la data, doté d'une solide expertise technique et d'un excellent sens du relationnel.\n\nCompétences Techniques Essentielles :Maîtrise avancée et avérée du SEO technique (analyse de logs, crawl, rendu JavaScript, architecture de site, etc.).Expérience significative en scraping, automatisation et data engineering appliquée au SEO.Excellente connaissance et pratique des outils SEO de référence (Screaming Frog, Oncrawl, YourTextGuru, Semrush, Ahrefs, etc.).Maîtrise de langages de programmation et de requêtes tels que Python, SQL, BigQuery, ainsi que l'intégration via APIs.Forte culture \"produit\" et une approche orientée optimisation continue.Qualités Humaines et Relationnelles (Savoir-être) :Rigueur, autonomie et un esprit analytique aiguisé.Capacité démontrée à vulgariser des sujets techniques complexes pour un public non-expert.Goût prononcé pour l'expérimentation, la résolution de problèmes et la construction de solutions innovantes.Aisance à évoluer dans un environnement transverse et collaboratif.Maîtrise de l'anglais, à l'oral comme à l'écrit, dans un contexte professionnel.Les Atouts qui Feront la Différence :Une expérience significative sur des dispositifs SEO complexes, que ce soit en agence ou chez l'annonceur.Des side projects personnels ou des contributions à des projets open-source démontrant votre passion et vos compétences.La capacité à dépasser les limites des outils standards en développant des solutions customisées.\n\nLa vie chez WPP Media et ses avantages Notre engagement à façonner l'avenir des médias se manifeste par un soutien actif au développement professionnel de nos talents, les aidant à atteindre leur plein potentiel. Cette démarche s'accompagne d'une vision responsable dans nos stratégies d'investissement médiatique, reflétant ainsi notre double priorité : valoriser nos collaborateurs tout en adoptant des pratiques durables dans notre secteur. Les collaborateurs de WPP Media ont un accès privilégié aux réseaux internationaux de WPP Media et WPP, leur permettant de développer leurs passions, d'étendre leur réseau professionnel et de rester à la pointe des innovations en marketing et publicité. Nous disposons de ressources vastes et variées au service de nos collaborateurs, notre entreprise cultive activement l'inclusion des talents de tous horizons. Les réussites et expertises des équipes sont régulièrement mises en lumière lors d'événements fédérateurs qui ponctuent également les moments clés de l'année, renforçant ainsi notre culture d'entreprise collaborative et diversifiée.\n\nNos avantages comprennent :\n\nTélétravail : jusqu'à 2 jours par semaine et 2 semaines complètes à prendre en deux fois dans l’annéeDeux jours de repos supplémentaires offerts, dont le lundi de PentecôteJours de congé additionnels par pallier de 5 ans d’ancienneté5 jours de télétravail additionnels par mois pour les collaborateurs souffrant d’endométriosePolitique handicap : 3 jours d'absence autorisés payés par an, accès à des Chèques Emploi Service Universel, et accompagnements spécifiques pour les collaborateurs ayant une RQTHMissions solidaires possibles via le programme We care and we act\n\n🤝Process de recrutement\n\n🥇Entretien avec l’équipe recrutement : Un premier entretien téléphonique ou par vidéoconférence avec un membre de notre équipe recrutement. Cela nous permettra de mieux connaître vos compétences et votre expérience, et vous donnera l'occasion de poser des questions sur le poste et l'entreprise. 🥈Entretien opérationnel : Pour évaluer l'adéquation de vos compétences et de votre profil par rapport aux exigences du poste. 🥉Étude de cas : Une étude de cas vous sera proposée afin d’évaluer vos compétences techniques liées au poste. Une restitution vous sera proposée. Nous nous engageons à rendre ce process aussi rapide et efficace que possible, et à maintenir une communication ouverte et transparente tout au long du process.\n\nWPP Media garantit l'égalité des chances et considère tous les candidats sans discrimination ni considération de caractéristiques particulières. Nous nous engageons à cultiver un environnement de respect où chacun se sent à sa place et bénéficie des mêmes opportunités d'évolution professionnelle. Consultez notre politique de confidentialité pour tout savoir sur la protection de vos données politique de confidentialité. Bien que nous étudiions toutes les candidatures reçues, nous ne contactons que les personnes sélectionnées pour un entretien.\n\nrequisitionid:20964",
      "seniority_level": "",
      "employment_type": "",
      "industry": "",
      "skills": [],
      "benefits": [],
      "requirements": {},
      "posting_date": 1756137235000,
      "application_url": "",
      "application_type": "",
      "salary_insights": {},
      "raw_data_keys": [
        "dashEntityUrn",
        "companyDetails",
        "jobState",
        "description",
        "title",
        "entityUrn",
        "workRemoteAllowed",
        "applyMethod",
        "talentHubJob",
        "formattedLocation",
        "workplaceTypes",
        "listedAt",
        "jobPostingId",
        "$recipeType"
      ]
    },
    {
      "id": "4130575977",
      "title": "Candidatures spontanées Kraken Technologies",
      "company": "Kraken",
      "location": "Paris, Île-de-France, France",
      "description": "Help us use technology to make a big green dent in the universe!\n\nKraken powers some of the most innovative global developments in energy.\n\nWe’re a technology company focused on creating a smart, sustainable energy system. From optimising renewable generation, creating a more intelligent grid and enabling utilities to provide excellent customer experiences, our operating system for energy is transforming the industry around the world in a way that benefits everyone.\n\nIt’s a really exciting time in energy. Help us make a real impact on shaping a better, more sustainable future.\n\nOur mission is to provide cheaper, greener energy to the French marke t.\n\nWe want to do better for the planet, through real, long-term investment in renewable energy production and a low-CO2 future that's better for our customers' wallets. We want to revolutionize the energy business through our people, our platform and our use of data.\n\nOur focus is on customer satisfaction, and receiving positive reviews is important to us - we have the best score among French energy suppliers on Google Reviews and Trust Pilot.\n\nKraken technologies\n\nKraken Technologies is a company within Octopus Energy Group who are licensing the Kraken platform and operating model to clients across the world. Current clients are both the Octopus Energy retails businesses around the world as well as external clients such as Good Energy, Origin, EDF, E.ON & Queensland Energy - with many more expected to join over the next few years!\n\nOur team\n\nAll technology is written and maintained by a multi-discipline engineering team of around 450 people globally. This includes server-side, client-side and mobile engineers working closely with UX experts, copywriters and designers.\n\nWe follow a Kanban-like approach, using Google docs and Asana to specify and manage work; Github, CircleCI and Terraform Enterprise as part of an immutable-infrastructure, continuous delivery pipeline; and Loggly, Sentry and Cloudwatch to measure performance and monitor production.\n\nSome of our coding conventions are open-source.\n\nOctopus is a great place to learn, work with some talented engineers and level-up your skills.\n\nOur technology\n\nOn the server-side, we mainly use Python. Most of our websites are powered by Django, Django-REST-framework and GraphQL (Graphene).\n\nWe use AWS heavily, employing most of the \"Hashistack\" (eg Packer, Consul, Terraform) as part of a continuous deployment pipeline. See, for example, Django, ELB health checks and continuous delivery.\n\nClient-side, we use React, Redux and SASS; our mobile apps are built using native code or React Native.\n\nWe are always looking for new talents to complete our teams, if you do not find an opportunity that seems to match your profile or your interests, do not hesitate to send us a spontaneous application, it will of course be studied with attention !\n\nIf this sounds like you then we'd love to hear from  you.\n\nAre you ready for a career with us? We want to ensure you have all the tools and environment you need to unleash your potential. Need any specific accommodations? Whether you require specific accommodations or have a unique preference, let us know, and we'll do what we can to customise your interview process for comfort and maximum magic!\n\nStudies have shown that some groups of people, like women, are less likely to apply to a role unless they meet 100% of the job requirements. Whoever you are, if you like one of our jobs, we encourage you to apply as you might just be the candidate we hire. Across Octopus, we're looking for genuinely decent people who are honest and empathetic. Our people are our strongest asset and the unique skills and perspectives people bring to the team are the driving force of our success. As an equal opportunity employer, we do not discriminate on the basis of any protected attribute. Our commitment is to provide equal opportunities, an inclusive work environment, and fairness for everyone.",
      "seniority_level": "",
      "employment_type": "",
      "industry": "",
      "skills": [],
      "benefits": [],
      "requirements": {},
      "posting_date": 1756204928000,
      "application_url": "",
      "application_type": "",
      "salary_insights": {},
      "raw_data_keys": [
        "dashEntityUrn",
        "companyDetails",
        "jobState",
        "description",
        "title",
        "entityUrn",
        "workRemoteAllowed",
        "applyMethod",
        "talentHubJob",
        "formattedLocation",
        "workplaceTypes",
        "listedAt",
        "jobPostingId",
        "$recipeType",
        "workplaceTypesResolutionResults"
      ]
    },
    {
      "id": "4291058946",
      "title": "Consultant.e SMA & SEA - CDI",
      "company": "KLH",
      "location": "Paris, Île-de-France, France",
      "description": "Descriptif du poste\nActuellement en forte croissance, nous cherchons à renforcer nos équipes ! Nous cherchons un.e consultant.e SMA & SEA avec une prédominance SMA.\nEn partenariat avec notre head of Paid Performance, vous aurez la charge d’un portefeuille clients sur la gestion et la mise en place de campagnes SEA et SMA (Meta, TikTok, LinkedIn, X...). Les missions seront les suivantes :Gestion de clientèle : vous êtes le garant de la bonne relation client et du respect de la qualité. Gestion et organisation de points réguliers avec les clientsGestion de projet : s’assurer du bon déroulement du projet en créant une synergie entre les partenaires de l’agence et les besoins du client. Envoie des dashboards Looker Studio prévus pour le client.Stratégie & Créa : définitions de stratégie SMA et SEA au service d’idées innovantes (stratégie enchères, scripts, flux automatisés, formats creatifs les plus adaptés...) et des principaux piliers : data analyse, automatisation, Audience, Automation, crea / éditorial et structure. Production de créas publicitaires via l'IA.Production : Déploiement de la stratégie SMA et SEA : choix des leviers, ciblage sociaux demo, réalisation de matrices éditoriales, étude de mots clés, création de campagnes / Adset, gestion opérationnelle , mise en place des dernières nouveautés Google Ads et Social Ads, benchmark creatif, création des dashboard, audit de campagnes…Data Analyse / IA: analyse des performances des campagnes SMA / SEA et recommandations pour accélérer la performance. Automation des tâches via des solutions LLM10% de votre temps : missions en dehors de votre scope habituel. Tant que le sujet est en rapport avec l’agence, la seule limite est votre imagination. Vous pourrez notamment participer au développement des outils et R&D SMA.\nProfil recherché\nAutodidacte ou diplômé.e : pas de sacralisation du diplôme, nous cherchons des talentsUne expérience de 1 an minimum est requise (chez l’annonceur ou en agence)Une appétence pour le SMA, la creation publicitaire et l’analyse des chiffresDes compétences Analytics seront fortement appréciéesMaîtrise des plateformes SMA / SEA : Meta Ads, X Ads, LinkedIn Ads, TikTok Ads, Google Ads...Un esprit d’entrepreneur(se) et d’initiativeUn esprit d’équipe et une aisance relationnelle\n",
      "seniority_level": "",
      "employment_type": "",
      "industry": "",
      "skills": [],
      "benefits": [],
      "requirements": {},
      "posting_date": 1756198097000,
      "application_url": "",
      "application_type": "",
      "salary_insights": {},
      "raw_data_keys": [
        "dashEntityUrn",
        "companyDetails",
        "jobState",
        "description",
        "title",
        "entityUrn",
        "workRemoteAllowed",
        "applyMethod",
        "talentHubJob",
        "formattedLocation",
        "workplaceTypes",
        "listedAt",
        "jobPostingId",
        "$recipeType",
        "workplaceTypesResolutionResults"
      ]
    },
    {
      "id": "4291074898",
      "title": "Freelance SEO Expert",
      "company": "Twine",
      "location": "European Economic Area",
      "description": "An SEO specialist is required to optimize a new website for a health and wellness provider in Austin, Texas. The website, currently in development and set to launch within the next month, needs to be search-engine ready from the outset. The focus will be on building a strong SEO foundation during the development phase, followed by ongoing optimization and strategy to grow online visibility and attract new clients. This is a remote position suited for a professional who can deliver both technical SEO setup and long-term performance improvements.\nDeliverablesConduct keyword research tailored to manual lymphatic drainage services and the Austin, Texas market.Provide SEO guidance during the site’s development to ensure proper on-page and technical setup.Optimize meta tags, headings, alt text, and site architecture for maximum search performance.Implement local SEO strategies to enhance visibility within Austin and surrounding areas.Support setup of Google Analytics, Google Search Console, and other tracking tools.Deliver an SEO roadmap and best practices guide for launch readiness.Provide ongoing SEO support post-launch, including monitoring, reporting, and continuous optimization.\nRequirementsDemonstrated experience in SEO, particularly for service-based local businesses.Strong understanding of on-page, technical, and off-page SEO strategies.Proven ability to optimize websites during the build phase to avoid post-launch issues.Familiarity with local SEO practices, including Google Business Profile optimization.Proficiency with SEO tools such as SEMrush, Ahrefs, Moz, or Screaming Frog.Experience with WordPress or other CMS platforms is highly desirable.Strong communication skills to provide clear recommendations and updates.Availability to collaborate remotely and provide continued support after site launch.\nAbout TwineTwine is a leading freelance marketplace connecting top freelancers, consultants, and contractors with companies needing creative and tech expertise. Trusted by Fortune 500 companies and innovative startups alike, Twine enables companies to scale their teams globally.\nOur MissionTwine's mission is to empower creators and businesses to thrive in an AI-driven, freelance-first world.",
      "seniority_level": "",
      "employment_type": "",
      "industry": "",
      "skills": [],
      "benefits": [],
      "requirements": {},
      "posting_date": 1756204559000,
      "application_url": "",
      "application_type": "",
      "salary_insights": {},
      "raw_data_keys": [
        "dashEntityUrn",
        "companyDetails",
        "jobState",
        "description",
        "title",
        "entityUrn",
        "workRemoteAllowed",
        "applyMethod",
        "talentHubJob",
        "formattedLocation",
        "workplaceTypes",
        "listedAt",
        "jobPostingId",
        "$recipeType",
        "workplaceTypesResolutionResults"
      ]
    },
    {
      "id": "4288886117",
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US ",
      "company": "Call For Referral",
      "location": "European Union",
      "description": "Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects in collaboration with a leading AI lab. The role involves contributing to data campaigns across Creative Writing, Companionship, and Presentation domains. Successful candidates will apply judgment, critical thinking, and domain expertise to evaluate which responses are most effective, natural, and compelling.Ideal ProfilesCreative WritingBackground in fiction, poetry, screenwriting, or narrative development.Experience producing original content such as speeches, dialogues, or literary critiques.Ability to assess creativity, originality, and narrative flow.CompanionshipAbility to recognize responses that demonstrate empathy, emotional intelligence, and helpfulness.Awareness of tone, conciseness, and natural conversational flow.Understanding of what makes interactions feel authentic and supportive.PresentationAbility to evaluate responses for clarity, structure, and polish.Strong understanding of how to articulate and communicate ideas effectively.Familiarity with persuasive, professional, or educational communication styles is a plus.General RequirementsBroad knowledge base and ability to apply skills across multiple areas.High proficiency in English (written and spoken).Strong communication skills and reliability in a remote, independent work environment.Attention to detail with consistent, objective judgment.Ability to manage deadlines effectively.Role DetailsHours: 20–40 per week (flexible and ongoing).Location: Fully remote, asynchronous — manage your own schedule.Compensation: $45–$50 per hour.\n",
      "seniority_level": "",
      "employment_type": "",
      "industry": "",
      "skills": [],
      "benefits": [],
      "requirements": {},
      "posting_date": 1756197980000,
      "application_url": "",
      "application_type": "",
      "salary_insights": {},
      "raw_data_keys": [
        "dashEntityUrn",
        "companyDetails",
        "jobState",
        "description",
        "title",
        "entityUrn",
        "workRemoteAllowed",
        "applyMethod",
        "talentHubJob",
        "formattedLocation",
        "workplaceTypes",
        "listedAt",
        "jobPostingId",
        "$recipeType",
        "workplaceTypesResolutionResults"
      ]
    }
  ]
}