{
  "search_info": {
    "keywords": "SEO",
    "location": "Paris",
    "limit_requested": 20,
    "jobs_found": 20,
    "search_timestamp": "2025-08-26T14:51:26.081995"
  },
  "jobs": [
    {
      "title": "Consultant(e) SEO Senior (F/H) - CDI",
      "company": "WPP Media",
      "location": "Paris, Île-de-France, France: Description",
      "description": "Dans un souci de clarté et d’accessibilité, nous avons choisi de ne pas utiliser l’écriture inclusive dans nos communications. WPP Media est fermement engagé en faveur de la diversité : nous valorisons l'inclusion et l'égalité, en considérant tous les candidats sans distinction d'identité de genre, d'origine ethnique ou de religion. Tous nos postes sont également ouverts aux personnes en situation de handicap. A propos de WPP Media : WPP is the creative transformation company. Nous utilisons le pouvoir de la créativité pour construire un avenir meilleur pour nos collaborateurs, notre planète, nos clients et nos communautés. Pour plus d'informations, visitez wpp.com. WPP Media est le collectif média global de WPP. Dans un monde où les médias sont omniprésents nous regroupons la meilleure plateforme, les meilleurs talents et les meilleurs partenaires pour développer les solutions les plus innovantes, offrant une croissance inégalée à nos clients. Pour plus d'informations, visitez wppmedia.com. Chez WPP Media, nous croyons en la puissance de notre culture et de nos collaborateurs. C'est grâce à cette synergie que nous parvenons à créer des expériences véritablement exceptionnelles, tant pour nos clients que pour nos équipes internes. Pour réussir dans ce poste, il est fondamental d'incarner les valeurs essentielles qui unissent WPP et WPP Media : Être Extraordinaire en favorisant un leadership collectif qui inspire une créativité véritablement transformationnelle.Créer un environnement Ouvert en trouvant l'équilibre parfait entre l'épanouissement de nos collaborateurs et la satisfaction de nos clients, le tout fondé sur une confiance mutuelle.Diriger avec Optimisme en stimulant activement la croissance et le développement pour mobiliser l'ensemble de notre organisation. Contexte Le pôle SEO de GroupM accélère sa transformation technique et produit. Nous cherchons un Consultant SEO Technique Senior capable de prendre la main sur nos comptes les plus complexes tout en structurant nos assets internes Missions : En tant que Consultant SEO Technique Senior, vous jouerez un rôle clé dans l'accélération de la transformation technique et produit de notre pôle SEO. Vos responsabilités s'articuleront autour des axes suivants : Expertise SEO Technique Avancée :Réaliser des audits techniques approfondis sur des environnements complexes (JavaScript, internationalisation, e-commerce).Mener des analyses pointues de logs, de rendu JavaScript et de performance technique.Concevoir, piloter et automatiser des plans de redirection complexes.Prioriser les optimisations en croisant les données issues du crawl, des logs, de Google Search Console et des outils d'analytics.Ingénierie et Analyse de Données SEO :Concevoir et implémenter des workflows SEO robustes (via BigQuery, Python, etc.) pour alimenter nos outils internes et nos analyses.Automatiser les tâches répétitives pour optimiser l'efficacité opérationnelle.Produire des insights clairs, actionnables et à forte valeur ajoutée.Développer des dashboards interactifs (Looker Studio, dataviz avancée) pour la visualisation des performances.Développement et Maintenance d'Outils Internes :Contribuer activement à la roadmap de nos outils SEO internes (scoring, extracteurs, systèmes d'alerte, etc.).Assurer l'évolution des outils du pôle en étroite collaboration avec l'équipe SEA.Maintenir des systèmes de scraping fiables et performants (produits, marketplaces, SERP).Intégrer de nouveaux frameworks et APIs, et challenger les outils du marché pour garantir notre avance technologique.Innovation et Intégration de l'IA :Intégrer des briques LLM/IA dans nos outils et méthodologies SEO pour optimiser nos stratégies.Participer activement à la formalisation et au développement de notre offre cross-search (SEO, LLM, SEA, social).Appuyer la montée en compétence de l'équipe sur les sujets liés à l'intelligence artificielle et à la recherche sémantique.Conseil Stratégique et Transversalité :Agir en tant que référent technique sur des comptes clés, en co-pilotant les stratégies SEO.Présenter les recommandations techniques avec clarté, pédagogie et conviction.Travailler en synergie avec les équipes Paid, Data, Analytics, Développement et Produit pour des stratégies intégrées.Représenter et défendre la vision technique du SEO lors des échanges stratégiques avec les clients et les équipes internes. Profil recherché Nous recherchons un Consultant SEO Technique Senior passionné par l'innovation et la data, doté d'une solide expertise technique et d'un excellent sens du relationnel. Compétences Techniques Essentielles :Maîtrise avancée et avérée du SEO technique (analyse de logs, crawl, rendu JavaScript, architecture de site, etc.).Expérience significative en scraping, automatisation et data engineering appliquée au SEO.Excellente connaissance et pratique des outils SEO de référence (Screaming Frog, Oncrawl, YourTextGuru, Semrush, Ahrefs, etc.).Maîtrise de langages de programmation et de requêtes tels que Python, SQL, BigQuery, ainsi que l'intégration via APIs.Forte culture \"produit\" et une approche orientée optimisation continue.Qualités Humaines et Relationnelles (Savoir-être) :Rigueur, autonomie et un esprit analytique aiguisé.Capacité démontrée à vulgariser des sujets techniques complexes pour un public non-expert.Goût prononcé pour l'expérimentation, la résolution de problèmes et la construction de solutions innovantes.Aisance à évoluer dans un environnement transverse et collaboratif.Maîtrise de l'anglais, à l'oral comme à l'écrit, dans un contexte professionnel.Les Atouts qui Feront la Différence :Une expérience significative sur des dispositifs SEO complexes, que ce soit en agence ou chez l'annonceur.Des side projects personnels ou des contributions à des projets open-source démontrant votre passion et vos compétences.La capacité à dépasser les limites des outils standards en développant des solutions customisées. La vie chez WPP Media et ses avantages Notre engagement à façonner l'avenir des médias se manifeste par un soutien actif au développement professionnel de nos talents, les aidant à atteindre leur plein potentiel. Cette démarche s'accompagne d'une vision responsable dans nos stratégies d'investissement médiatique, reflétant ainsi notre double priorité : valoriser nos collaborateurs tout en adoptant des pratiques durables dans notre secteur. Les collaborateurs de WPP Media ont un accès privilégié aux réseaux internationaux de WPP Media et WPP, leur permettant de développer leurs passions, d'étendre leur réseau professionnel et de rester à la pointe des innovations en marketing et publicité. Nous disposons de ressources vastes et variées au service de nos collaborateurs, notre entreprise cultive activement l'inclusion des talents de tous horizons. Les réussites et expertises des équipes sont régulièrement mises en lumière lors d'événements fédérateurs qui ponctuent également les moments clés de l'année, renforçant ainsi notre culture d'entreprise collaborative et diversifiée. Nos avantages comprennent : Télétravail : jusqu'à 2 jours par semaine et 2 semaines complètes à prendre en deux fois dans l’annéeDeux jours de repos supplémentaires offerts, dont le lundi de PentecôteJours de congé additionnels par pallier de 5 ans d’ancienneté5 jours de télétravail additionnels par mois pour les collaborateurs souffrant d’endométriosePolitique handicap : 3 jours d'absence autorisés payés par an, accès à des Chèques Emploi Service Universel, et accompagnements spécifiques pour les collaborateurs ayant une RQTHMissions solidaires possibles via le programme We care and we act 🤝Process de recrutement 🥇Entretien avec l’équipe recrutement : Un premier entretien téléphonique ou par vidéoconférence avec un membre de notre équipe recrutement. Cela nous permettra de mieux connaître vos compétences et votre expérience, et vous donnera l'occasion de poser des questions sur le poste et l'entreprise. 🥈Entretien opérationnel : Pour évaluer l'adéquation de vos compétences et de votre profil par rapport aux exigences du poste. 🥉Étude de cas : Une étude de cas vous sera proposée afin d’évaluer vos compétences techniques liées au poste. Une restitution vous sera proposée. Nous nous engageons à rendre ce process aussi rapide et efficace que possible, et à maintenir une communication ouverte et transparente tout au long du process. WPP Media garantit l'égalité des chances et considère tous les candidats sans discrimination ni considération de caractéristiques particulières. Nous nous engageons à cultiver un environnement de respect où chacun se sent à sa place et bénéficie des mêmes opportunités d'évolution professionnelle. Consultez notre politique de confidentialité pour tout savoir sur la protection de vos données politique de confidentialité. Bien que nous étudiions toutes les candidatures reçues, nous ne contactons que les personnes sélectionnées pour un entretien. requisitionid:20964"
    },
    {
      "title": "Web Tracking Specialist (GTM / GA4)",
      "company": "Mouratoglou Academy",
      "location": "Biot, Provence-Alpes-Côte d'Azur, France: Bienvenue dans l’équipe digitale d’un groupe de plusieurs sociétés et réseaux de franchises dans le domaine du sport, du loisir et de l’hôtellerie de luxe.",
      "description": "Située au cœur de la Mouratoglou Academy, un resort exceptionnel de plus de 12 hectares qui regroupe une Académie de tennis de renommée internationale, un hôtel 4 étoiles et un Country club premium, l'Équipe Digitale Mouratoglou offre un cadre de travail unique au monde et vous permettra d’évoluer au sein d’une équipe jeune, sportive et dynamique. En tant que “Web tracking Specialist”, vous participerez activement à la gestion et l’analyse des bases de données des sociétés du groupe. Vous travaillerez en étroite collaboration avec le DATA Analyst, le CRM Manager, Responsable Digital, Responsable Acquisition. 📢 RESPONSABILITES PRINCIPALES Elaboration de plans de taggage en fonction des besoins businessParamétrage et implémentation des outils de tracking (client-side, server-side…)Monitoring et contrôle du bon fonctionnement du tracking (baisse, perte, bug technique)Elaboration des dashboards de web analyseProposition d’innovations sur le data management, le cross tracking et l’attribution.Veille concurrentielle en matière de technologie de tracking et web analyse dans un environnement cookieless 📢 COMPETENCES TECHNIQUES Maîtrise de Google Tag Manager : capacité à poser des évènements dans des environnements complexes et de plus en plus cookielessMaîtrise d’au moins un outil de web analyse: Google Analytics 4 ou autresConnaissance des Outils d'Automatisation : Expérience avec Make.com, Zapier.com ou autres outils similaires.Analyse de Données : Fortes compétences en analyse et en interprétation de données. Connaissance de Google Looker Studio. Usage d’outils BI est un plusConnaissance de la RGPD des évolutions du marché de la data 📢 VOTRE PROFIL BAC + 4/5Vous avez entre 5/6 ans d'expériences dans un poste similaire.Vous êtes bilingue (FR / EN)Vous êtes habitué(e) à gérer des projets complexes ;Vous faites preuve de rigueur au quotidien ;Dynamique et proacti(ve), vous avez un tempérament accrocheur et persévérant ;Vous êtes motivé(e) par la construction d’un projet innovant et ambitieux dans le domaine du sport ;Vous appréciez travailler en équipe et évoluer dans un environnement effervescent ;Vous êtes sensible à votre hygiène de vie et vous aimez le sport. 📢 CE QUE NOUS VOUS OFFRONS Faire partie d’une équipe talentueuse, composée d'une centaine de passionnés de sport ;Évoluer dans un environnement agile, sans bureaucratie, sans limites, au sein duquel tout votre potentiel pourra s’exprimer et se libérer ;Profiter de la croissance de la société pour évoluer rapidement en compétences et en responsabilités ;Travailler dans un cadre exceptionnel, au sein d'un resort sportif avec des avantages nombreux."
    },
    {
      "title": "Candidatures spontanées Kraken Technologies",
      "company": "Kraken",
      "location": "Paris, Île-de-France, France: Help us use technology to make a big green dent",
      "description": "Kraken powers some of the most innovative global developments in energy. We’re a technology company focused on creating a smart, sustainable energy system. From optimising renewable generation, creating a more intelligent grid and enabling utilities to provide excellent customer experiences, our operating system for energy is transforming the industry around the world in a way that benefits everyone. It’s a really exciting time in energy. Help us make a real impact on shaping a better, more sustainable future. Our mission is to provide cheaper, greener energy to the French marke t. We want to do better for the planet, through real, long-term investment in renewable energy production and a low-CO2 future that's better for our customers' wallets. We want to revolutionize the energy business through our people, our platform and our use of data. Our focus is on customer satisfaction, and receiving positive reviews is important to us - we have the best score among French energy suppliers on Google Reviews and Trust Pilot. Kraken technologies Kraken Technologies is a company within Octopus Energy Group who are licensing the Kraken platform and operating model to clients across the world. Current clients are both the Octopus Energy retails businesses around the world as well as external clients such as Good Energy, Origin, EDF, E.ON & Queensland Energy - with many more expected to join over the next few years! Our team All technology is written and maintained by a multi-discipline engineering team of around 450 people globally. This includes server-side, client-side and mobile engineers working closely with UX experts, copywriters and designers. We follow a Kanban-like approach, using Google docs and Asana to specify and manage work; Github, CircleCI and Terraform Enterprise as part of an immutable-infrastructure, continuous delivery pipeline; and Loggly, Sentry and Cloudwatch to measure performance and monitor production. Some of our coding conventions are open-source. Octopus is a great place to learn, work with some talented engineers and level-up your skills. Our technology On the server-side, we mainly use Python. Most of our websites are powered by Django, Django-REST-framework and GraphQL (Graphene). We use AWS heavily, employing most of the \"Hashistack\" (eg Packer, Consul, Terraform) as part of a continuous deployment pipeline. See, for example, Django, ELB health checks and continuous delivery. Client-side, we use React, Redux and SASS; our mobile apps are built using native code or React Native. We are always looking for new talents to complete our teams, if you do not find an opportunity that seems to match your profile or your interests, do not hesitate to send us a spontaneous application, it will of course be studied with attention ! If this sounds like you then we'd love to hear from  you. Are you ready for a career with us? We want to ensure you have all the tools and environment you need to unleash your potential. Need any specific accommodations? Whether you require specific accommodations or have a unique preference, let us know, and we'll do what we can to customise your interview process for comfort and maximum magic! Studies have shown that some groups of people, like women, are less likely to apply to a role unless they meet 100% of the job requirements. Whoever you are, if you like one of our jobs, we encourage you to apply as you might just be the candidate we hire. Across Octopus, we're looking for genuinely decent people who are honest and empathetic. Our people are our strongest asset and the unique skills and perspectives people bring to the team are the driving force of our success. As an equal opportunity employer, we do not discriminate on the basis of any protected attribute. Our commitment is to provide equal opportunities, an inclusive work environment, and fairness for everyone."
    },
    {
      "title": "Marketing Director",
      "company": "GraphAware",
      "location": "European Union: Job Location: Open to candidates from anywhere",
      "description": "Why apply?Marketing at GraphAware is about more than promoting an innovative software product. It is an opportunity to help reshape how intelligence analysts accomplish their mission in an increasingly connected world. Our goal is to lead a shift in thinking across the intelligence community towards graph-centric analysis as a foundation for better decisions. As Marketing Director, you will play a central role in advancing this vision. You will lead global marketing with a primary focus on \"Five Eyes\", EU, and NATO countries. Your work will help government agencies understand the value of our technology, as well as the importance of adopting a new approach to analysis based on relationships, context, and connected data. You’ll be joining a focused, driven team where ideas move quickly and impact is visible. There’s real room to shape the work, take ownership, and grow in a way that’s meaningful to you. Your MissionAs Marketing Director, you will shape the core marketing strategy of GraphAware and GraphAware Hume, our connected data analytics platform. Key ResponsibilitiesMarketing strategy: Understand the company’s strategy. Design the marketing strategy and plan. Execute it effectively, and translate it into clear team focus and priorities.Brand building and awareness: Build a brand that aligns with our long-term goals through strong strategy, planning, and execution. Act as a guardian of consistent messaging and representation of who we are across all channels. Maintain a strong public profile that reassures the market we are the right partner.Content and thought leadership: Develop clear, high-quality content that speaks directly to our audience and reflects a deep understanding of their challenges. Position the company as a credible voice in our field - insightful, practical, and worth listening to.Lead Generation: Set up the funnel and the overall measurement and evaluation system, including key metrics. Drive inbound lead generation by creating and promoting high-quality content. Assess the role outbound should play in our go-to-market approach.Sales support and partner management: Support the sales team by developing high-quality assets that communicate our value and align with our branding. Define and implement a practical approach to equip partners with the right messaging, tools, and materials to help them sell effectively.Events and webinars: Own and maintain a strong, up-to-date events and webinars calendar that supports our goals. Ensure every event is well-organized, high-quality, and delivers clear value to our audience.Team leadership: Provide clear focus and priorities for the team, grow its capabilities, and establish marketing as a strong, strategic function within the company. Profile We Have in MindYou combine strong communication, structured thinking and a hands-on mindset, with the ability to align strategic vision and day-to-day execution.10–15 years of marketing experience, with at least 5–8 years leading full marketing efforts in a B2B software or SaaS companyA stable track record, including at least one or two roles held for 4+ yearsExperience in fast-growing software businesses with international reachExperience with complex, high-value solutions sold to enterprise or public sector clientsSkilled at building and leading a small marketing team with global focusProven brand builder with strong content strategy and thought leadership focus, including developing strategic, high-quality assets to support sales and partner teamsStrong grasp of lead generation, marketing funnels and performance metricsFluent English, spoken and written, at a near-native levelBonus: experience in intelligence technology or public sector software and long sales cycles What We OfferUnique opportunity: Join us on our journey to fundamentally change the way intelligence analysis is conducted and to empower democratic government agenciesDriven and motivating environment: Striving for excellence is who we are but we’ve always got each other’s back. Work in an environment that motivates and supports youSelf-realisation and autonomy: Thrive in an environment where autonomy is balanced with accountability. If something isn’t working, we take actionCompetitive compensation: Enjoy a competitive compensation package with a variable component and regular reviewsEquity participation: Share in the company's success through our share scheme program GraphAware’s core valuesSense of OwnershipStrive for ExcellenceDriven by Customer SuccessBelief in the Value of GraphsI Got Your Back! Ready to make an impact? Join GraphAware and be part of something truly transformative. Apply now and help shape the future of graph analytics!"
    },
    {
      "title": "Responsable Collecte des Données Digitales H/F",
      "company": "Intermarché",
      "location": "Châtillon, Île-de-France, France: Nous recherchons pour notre Direction Produits Informatiques, Processus & Qualité de la donnée, un.e Responsable Collecte de Données Digitales H/F au sein de la Fabrique Digitale.",
      "description": "Rattaché.e à Anne, Responsable Customer Experience, vos principales missions seront : l’optimisation de la collecte de données sur le site et les applications Intermarché, en garantissant leur qualité, leur conformité aux réglementations (RGPD, CNIL), et leur exploitation efficace par les équipes Produit, Analytics, Marketing et IT. Quelques exemples : Superviser, paramétrer et optimiser les outils de collecte (GTM, CDP, Adjust, Server-side).Mettre en place le suivi qualité : Dashboards, alertes, audits, diagnostics, recommandations.Garantir la conformité des traceurs et outils via les CMP sur web et app.Travailler avec les équipes Produit, Analytics, CRM, IT, DPO et partenaires pour une collecte responsable, compréhensible et exploitable.Suivre l’évolution des réglementations et des technologies de collecte pour adapter en continu les pratiques et outils. Cette liste est non exhaustive et d'autres missions pourront vous être confiées en fonction des besoins du service et de votre appétence. QualificationsEt si vos compétences venaient nourrir notre mission : Vous avez plus de 3 ans d’expérience en TMS (collecte consentement à des fin marketing/CRM/ Média acquisition et analytics ), en web analytics, data privacy, ou implémentation de tracking digital avec une formation Bac +5 en marketing digital, data, informatique, ou équivalent.Maîtrise de Google Tag Manager (client-side & server-side)Bonne connaissance des solutions analytics (GA4, BigQuery, Looker Studio…)Connaissance des CMP (Didomi) et des tags média (Meta, Google Ads…)Bases solides en HTML, JavaScript, et fonctionnement des navigateursCompréhension approfondie des enjeux RGPD / Data Privacy"
    },
    {
      "title": "Responsable Marketing et Communication (45-75k€)",
      "company": "Mantra Jobs",
      "location": "Nice, Provence-Alpes-Côte d'Azur, France: MissionsDévelopper et exécuter un plan marketing complet pour augmenter le chiffre d’affaires de l’entreprise.Elaborer et mettre en œuvre de la stratégie de brand content et d’inbound marketing pour générer des leads entrants.Création de contenus, incluant articles, présentations, argumentaires, livre blancs, vidéos…Organisation de webinars pour clients et prospectsSuivi du site InternetTravailler avec différentes équipes (conception, contenu, acquisition, produit, vente) pour mettre en œuvre des stratégies marketing et commerciale efficacesAnalyser les données pour découvrir des opportunités de croissance et évaluer l’impact des initiatives.Gérer l’expérience marketing de nos clients et prospects de A à Z (incluant onboarding, events, salons, etc).",
      "description": "Profil RecherchéVous avez minimum 5 ans d’expérience en marketing ou communication, en agence, en PME/startup ou freelanceDe formation supérieure, vous disposez d’une solide expérience réussie sur des fonctions marketing transverses dans un environnement digital/tech/services.Vous cherchez à intégrer une structure sur un marché hyper dynamique et porteur.Vous connaissez les principaux canaux marketing digitauxVous avez une excellente communication orale et écrite.Vous savez jongler entre la stratégie et l’opérationnelVous avez une excellente capacité d’analyse et de synthèse. Description entrepriseMantra Jobs est un Cabinet de Recrutement Spécialisé en Marketing et Communication qui aide à trouver votre CDI de rêve en un temps record. En quelques chiffres :350+ offres de postes ouverte sur toute la FranceTaux d'insertion de 78% à 6 mois51,000€ / An en Moyenne Notre promesse : vous donner les armes et vous positionner sur LA meilleure opportunité de Responsable Marketing dans une PME ou une Startup."
    },
    {
      "title": "Consultant.e SMA & SEA - CDI",
      "company": "KLH",
      "location": "Paris, Île-de-France, France: Descriptif du poste",
      "description": "Actuellement en forte croissance, nous cherchons à renforcer nos équipes ! Nous cherchons un.e consultant.e SMA & SEA avec une prédominance SMA. En partenariat avec notre head of Paid Performance, vous aurez la charge d’un portefeuille clients sur la gestion et la mise en place de campagnes SEA et SMA (Meta, TikTok, LinkedIn, X...). Les missions seront les suivantes :Gestion de clientèle : vous êtes le garant de la bonne relation client et du respect de la qualité. Gestion et organisation de points réguliers avec les clientsGestion de projet : s’assurer du bon déroulement du projet en créant une synergie entre les partenaires de l’agence et les besoins du client. Envoie des dashboards Looker Studio prévus pour le client.Stratégie & Créa : définitions de stratégie SMA et SEA au service d’idées innovantes (stratégie enchères, scripts, flux automatisés, formats creatifs les plus adaptés...) et des principaux piliers : data analyse, automatisation, Audience, Automation, crea / éditorial et structure. Production de créas publicitaires via l'IA.Production : Déploiement de la stratégie SMA et SEA : choix des leviers, ciblage sociaux demo, réalisation de matrices éditoriales, étude de mots clés, création de campagnes / Adset, gestion opérationnelle , mise en place des dernières nouveautés Google Ads et Social Ads, benchmark creatif, création des dashboard, audit de campagnes…Data Analyse / IA: analyse des performances des campagnes SMA / SEA et recommandations pour accélérer la performance. Automation des tâches via des solutions LLM10% de votre temps : missions en dehors de votre scope habituel. Tant que le sujet est en rapport avec l’agence, la seule limite est votre imagination. Vous pourrez notamment participer au développement des outils et R&D SMA. Profil recherché Autodidacte ou diplômé.e : pas de sacralisation du diplôme, nous cherchons des talentsUne expérience de 1 an minimum est requise (chez l’annonceur ou en agence)Une appétence pour le SMA, la creation publicitaire et l’analyse des chiffresDes compétences Analytics seront fortement appréciéesMaîtrise des plateformes SMA / SEA : Meta Ads, X Ads, LinkedIn Ads, TikTok Ads, Google Ads...Un esprit d’entrepreneur(se) et d’initiativeUn esprit d’équipe et une aisance relationnelle"
    },
    {
      "title": "Chef de projet SEO",
      "company": "Groupe Avant-Garde",
      "location": "Greater Paris Metropolitan Region: Le Groupe Avant-Garde",
      "description": "Le Groupe Avant-Garde est un acteur clé dans le Family Office, la gestion de patrimoine et l’immobilier. Les clients de notre maison sont des entreprises de tous secteurs d'activité, des héritiers ou holding familiales, sportifs de haut niveau, créateurs de contenu, etc. Nous intervenons sur des sujets particulièrement transverses (stratégies d’investissement, choix des partenaires, analyses patrimoniales, optimisation fiscale, sélection d’actions, obligations, produits structurés, suivi et contrôle des opérations, etc.). Faire partie de notre maison Le succès à long terme d'une société réside dans les talents humains qui la composent. Pour cette raison, Avant-Garde est en tout temps à l'écoute des candidatures qui lui sont proposées, afin de rencontrer, puis sélectionner les meilleurs éléments de tout horizon. Faire partie de notre maison signifie : Avoir une influence sur les décisions, une capacité à modeler son environnement et être force de propositionPromouvoir la méritocratie et avoir l’opportunité de progresser rapidement en ce sensÊtre chaque jour au sein d’une équipe stimulante et d’une société en forte croissance Notre maison est composée de personnalités passionnées, se différenciant par une forte expertise dans leur domaine de prédilection, réunies autour de deux ambitions : être la référence française de la gestion de fortune en fournissant une qualité de service à la hauteur de la confiance que nous portent nos investisseurs. Ce que nous offrons Équipe jeune et talentueuse sur les sujets SEO / growthGrande liberté dans le déploiement de nouveaux projetsBudget conséquent afin de mener à bien vos missions Votre profil Vous avez une expérience confirmée en gestion de projets SEO (idéalement en agence ou dans un environnement à fort trafic). Vous maîtrisez les outils SEO (Ahrefs, Screaming Frog, etc.) et avez une bonne culture technique. Une bonne plume et une affinité avec la rédaction SEO sont des atouts appréciés. Des compétences dans d'autres domaines growth (emailing, IA, etc.) sont également un atout. Vos missions Élaborer et déployer la stratégie SEO on-site et off-siteRéaliser des audits techniques et sémantiquesIdentifier et piloter les optimisations techniques (crawl, indexation, Core Web Vitals, etc.)Produire des contenus pertinents écritsSuivre les backlinks et mettre en œuvre une stratégie de netlinking efficaceAssurer une veille permanente sur les évolutions des algorithmes et du marché"
    },
    {
      "title": "Marketing Copywriter",
      "company": "Teliosa",
      "location": "France: Chez Teliosa, notre mission est de rendre la thérapie plus accessible.",
      "description": "Pourquoi la thérapie ? 615 millions de personnes souffrent de grave problème de santé mentaleLe covid a empiré les chosesDes personnes en grande souffrance n’arrivent pas à trouver la bonne personne pour les aider. Qu’est-ce qu’ont fait ? On aide les thérapeutes à aider plus de monde En 4 ans, on est passés de 0 à : 2500 thérapeutes accompagnés5 millions € de CA/an (Boostrapped et en étant très profitable)Une équipe de 15 personnes En 2025, on veut :Aider 1000 thérapeutesAtteindre 10 million € de revenu Et au cœur de cette croissance, une chose : nos publicités. On recherche donc un copywriter passionné par la création d’ads. Une personne capable de comprendre les tendances actuelles et créer des ads qui seront vu par des millions de personnes. Tes missions : Rédiger un maximum d'ads performantesUtiliser les outils de spy pour analyser les tendancesIdentifier des concepts gagnantsÉvaluer les résultats des campagnes pour maximiser leur efficacité.Collaborer avec les équipes marketing et créatives. Ton profil : Expérience en copywriting spécialisé en adsOrientation résultats et compétences analytiques.Grande créativité et autonomie.Tu es prêt à bcp travailler et tu ne comptes pas tes heures Ce job n’est pas fait pour toi si : Tu n’es pas rigoureuxTu n’es pas très “tech”Tu recherches seulement une mission sur le court termeTu n’aimes pas travailler en équipeTu n’acceptes pas le feedbackTu ne veux pas t’engager full-time sur le long terme Les trucs cool auxquel tu auras accès : Avoir un rôle essentiel dans une entreprise souhaitant rendre la thérapie plus accessible et changer la vie de milliers de personnesS’entourer d’une équipe bienveillante, fun, dynamique, motivée et déterminéeÊtre libre géographiquement Détails du poste :Nous n’acceptons pas les CDI. Notre équipe est composé d’indépendantCe job est un job à temps plein. Vous n’aurez pas le temps d’avoir d’autres clients.Pour ce poste, la rémunération se situe entre 30 000 € et 70 000 € par an (en fonction de l’expérience)Prise de poste asap ! Déroulement du process du recrutementChez nous, pas de CV ni de lettre de motivation, seules les skills comptent ! Il suffit de remplir ce questionnaire et nous vous recontacterons : https://3pvzkf2zd8p.typeform.com/to/l0YduVsJ"
    },
    {
      "title": "User Acquisition Manager (Appsflyer)",
      "company": "-WorkEthix",
      "location": "European Union: About the Role:We're looking for a results-driven User Acquisition Manager with hands-on experience",
      "description": "🔍 Responsibilities:Develop and execute user acquisition campaigns for mobile apps across paid channels (Meta, Google, TikTok, etc.)Set up, manage, and optimize attribution tracking via AppsFlyerAnalyze marketing performance using mobile attribution and analytics tools to improve ROI and LTVCollaborate with product and design teams to enhance mobile funnel and conversion strategiesOwn reporting dashboards, KPIs, and performance metricsManage app store optimization (ASO) effortsKeep up with trends in mobile marketing, privacy, and ad tech (e.g., SKAN, GAID/IDFA changes) ✅ Requirements:3+ years of experience in mobile marketing or performance marketingProven expertise with AppsFlyer (or similar tools like Adjust, Branch, Kochava)Strong analytical skills and familiarity with tools like Google Analytics, Looker, or TableauExperience with A/B testing and conversion rate optimizationExcellent communication and cross-functional collaboration skillsBonus: Experience with mobile gaming, fintech, or e-commerce apps 💡 What We Offer:Competitive salary and performance-based bonusesAccess to cutting-edge tools and platformsOpportunity to work in a fast-paced, data-driven environmentFlexible working model and supportive team culture"
    },
    {
      "title": "Technical SEO Manager - relocation to Cyprus",
      "company": "Medier Agency",
      "location": "European Union: We are looking for a highly skilled SEO Expert with proven experience",
      "description": "This is an on-site in Limassol. We will be happy to relocate you! Key Responsibilities:Lead SEO strategy and execution for iGaming products across multiple marketsConduct ongoing technical SEO audits, identifying issues and delivering clear, actionable instructions to development teamsManage SEO optimization for JavaScript-based websites, including working with prerender service to ensure proper crawlability and indexationDevelop and oversee site speed optimization initiatives, providing precise recommendations to developersPlan and manage complex site migration projects to protect and enhance search engine visibilityDefine and maintain a long-term SEO roadmap for web products, ensuring sustainable organic growth and visibilityTrack performance, analyze data, and report insights using tools such as Google Analytics, Google Search Console, Ahrefs, SEMrush, and Screaming FrogStay ahead of search engine algorithm changes and emerging AI-driven search and AI agent optimization trendsCollaborate closely with product, content, and developer teams to ensure SEO is embedded into all stages of development Requirements:4+ years SEO experience within the iGaming industry (mandatory)Strong expertise in JavaScript SEO and handling websites that rely on client-side renderingHands-on experience with prerender service and dynamic rendering solutionsProven ability to run ongoing technical audits and translate findings into clear developer instructionsDemonstrated experience improving site performance and speed through structured collaboration with developersTrack record of successfully handling complex website migrations with minimal loss of visibilityStrong knowledge of search engine algorithms, ranking factors, and modern SEO best practicesProven success in optimizing for AI agents and preparing websites for emerging search technologiesiProficiency with SEO tools: Google Analytics, GSC, Ahrefs, SEMrush, Moz, Screaming Frog, etsSolid understanding of HTML, CSS, and CMS platformsExcellent communication skills, with the ability to clearly document SEO requirements and roadmaps for non-SEO stakeholders"
    },
    {
      "title": "Freelance SEO Expert",
      "company": "Twine",
      "location": "European Economic Area: An SEO specialist is required to optimize a new website for a health and wellness provider",
      "description": "DeliverablesConduct keyword research tailored to manual lymphatic drainage services and the Austin, Texas market.Provide SEO guidance during the site’s development to ensure proper on-page and technical setup.Optimize meta tags, headings, alt text, and site architecture for maximum search performance.Implement local SEO strategies to enhance visibility within Austin and surrounding areas.Support setup of Google Analytics, Google Search Console, and other tracking tools.Deliver an SEO roadmap and best practices guide for launch readiness.Provide ongoing SEO support post-launch, including monitoring, reporting, and continuous optimization. RequirementsDemonstrated experience in SEO, particularly for service-based local businesses.Strong understanding of on-page, technical, and off-page SEO strategies.Proven ability to optimize websites during the build phase to avoid post-launch issues.Familiarity with local SEO practices, including Google Business Profile optimization.Proficiency with SEO tools such as SEMrush, Ahrefs, Moz, or Screaming Frog.Experience with WordPress or other CMS platforms is highly desirable.Strong communication skills to provide clear recommendations and updates.Availability to collaborate remotely and provide continued support after site launch. About TwineTwine is a leading freelance marketplace connecting top freelancers, consultants, and contractors with companies needing creative and tech expertise. Trusted by Fortune 500 companies and innovative startups alike, Twine enables companies to scale their teams globally. Our MissionTwine's mission is to empower creators and businesses to thrive in an AI-driven, freelance-first world."
    },
    {
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US",
      "company": "Call For Referral",
      "location": "European Union: Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects"
    },
    {
      "title": "Copywriter Freelance H/F",
      "company": "Mezaelle",
      "location": "France: Depuis 2016, Mezaelle accompagne des milliers de personnes à travers des formations innovantes en développement personnel et spirituel. Grâce à notre communauté engagée et à plus de 25 ans d’expertise, nous aidons nos apprenants à vivre des transformations profondes et durables.",
      "description": "Pour soutenir notre croissance et optimiser nos campagnes marketing, nous recherchons un(e) Copywriter capable de transformer nos contenus en véritables leviers de conversion. Vos missions : En tant que Copywriter chez Mezaelle, vous jouerez un rôle clé dans la création et l’exécution de nos campagnes de communication. Vous rédigerez des campagnes d’e-mails percutantes et orientées conversion, avec un storytelling impactant.Vous élaborerez les textes pour des tunnels de vente complets : landing pages, formulaires, séquences automatiques, pages de vente, bons de commande, etc.Vous participerez à la conception de scripts engageants pour les publicités en ligne.Vous analyserez les performances des campagnes pour ajuster et optimiser les textes.Vous collaborerez avec l’équipe marketing pour concevoir et implémenter des stratégies alignées sur nos objectifs de croissance.Vous saurez respecter et sublimer le ton et le style de marque de Mezaelle, tout en y apportant des optimisations pertinentes. Profil recherché : Compétences :Vous avez 4 à 5 ans d’expérience en copywriting dans un contexte marketing ou de vente.Vous maîtrisez la rédaction orientée conversion, en particulier pour des campagnes emailing et des tunnels de vente.Vous êtes capable d’adapter votre écriture au ton et au style définis par la marque, tout en garantissant une cohérence parfaite dans les contenus.Vous possédez une excellente maîtrise de la langue française, avec un style d’écriture clair, précis et engageant.Une expérience dans le secteur du bien-être, du développement personnel ou de la spiritualité est un plus. Qualités personnelles :Vous faites preuve d’une excellente capacité d’adaptation et savez vous approprier le ton existant avec finesse et aisance.Vous êtes à l’aise avec le travail en équipe et la réception de feedbacks constructifs.Vous avez le sens du détail et faites preuve de rigueur dans la qualité de vos livrables.Vous êtes proactif(ve) et force de proposition pour contribuer à l’amélioration continue des contenus et de la stratégie globale. Pourquoi rejoindre Mezaelle ? Vous bénéficierez d’une grande flexibilité en travaillant à distance avec des horaires flexibles.Vous contribuerez au développement d’une entreprise engagée dans le bien-être et la transformation personnelle.Vous travaillerez avec une équipe dynamique dans un environnement qui valorise l’humain, l’éthique et l’excellence. Modalités du poste : Type de contrat : FreelanceDate de démarrage : Dès que possibleSi vous êtes passionné(e) par le copywriting et prêt(e) à relever ce défi, envoyez-nous votre candidature dès maintenant ! Nous avons hâte de découvrir votre profil !"
    },
    {
      "title": "AI Operations Manager | Full Remote | Compta Tech",
      "company": "Talent-R",
      "location": "France: 📍 Full Remote from France (Office",
      "description": "Dans le cadre de son développement, mon client souhaite renforcer sa stratégie autour de l’intelligence artificielle en créant un rôle clé : AI Operations Manager. Ce poste a pour objectif de donner une véritable structure aux initiatives IA déjà en place et de créer un lien fort entre les enjeux business, les besoins des équipes opérationnelles (Sales, Support, Customer Success…) et les équipes Data & Tech. En résumé, il s’agit d’un rôle transversal, stratégique et opérationnel, permettant de transformer des problématiques métiers en solutions IA concrètes et génératrices de valeur. 🌟Vos principales missionsDéfinir une stratégie IA opérationnelle : cartographier les opportunités, identifier les axes prioritaires et assurer une veille sur les usages innovants de l’IA dans les opérations.Structurer et prioriser les projets : évaluer la valeur business et la faisabilité technique des cas d’usage, construire une roadmap cohérente et en ligne avec les ambitions produit.Piloter la mise en œuvre : rédiger les cadrages, coordonner avec les équipes techniques, s’assurer de la maturité et de la pertinence des projets IA.Porter la vision IA en interne : être ambassadeur(trice) de l’approche IA auprès des différentes équipes, fluidifier la communication entre métiers et tech, et assurer un suivi régulier des avancées auprès du management. 😍 Ce que ce poste vous apporteUn rôle stratégique et central, avec une forte visibilité auprès du top management.L’opportunité de façonner la manière dont l’IA est déployée dans l’ensemble des opérations.Un challenge dans un environnement tech en pleine croissance, où l’innovation est au cœur des décisions.La possibilité de travailler en full remote (en France), ou depuis des bureaux situés au cœur de Paris.Des avantages compétitifs (mutuelle haut de gamme, environnement de travail stimulant). ✅ Profil recherchéExpérience : minimum 5 ans en gestion de projet, conseil en stratégie, opérations ou transformation, idéalement avec un focus Data / IA.Compétences analytiques & stratégiques : capacité à comprendre les enjeux métiers, mesurer leur impact business et les traduire en initiatives IA concrètes.Culture IA : très bonne connaissance des concepts et cas d’usage (ML, GenAI, etc.), sans besoin d’être un profil purement technique.Leadership & communication : excellent relationnel, capacité à embarquer des équipes variées (métier, tech, C-level).Bonus : une expérience dans un environnement SaaS B2B sera fortement appréciée. 💬 Si le poste vous intéresse ou que vous correspondez au profil recherché, postulez à l'offre"
    },
    {
      "title": "CEO Content Creator",
      "company": "Plytix",
      "location": "EMEA: We’re looking for a CEO Content Creator to help supercharge the voice of Plytix’s CEO across digital channels. This role is part researcher, part ghostwriter, and part content strategist. You’ll be working directly with the CEO to turn raw insights, notes, and ideas into polished content for X, Substack, and LinkedIn. From fact-checking trends to shaping narratives to managing the publishing process, you’ll make sure the CEO’s voice is sharp, consistent, and influential.",
      "description": "What is Plytix? Plytix is the world’s leading Product Information Management (PIM) platform for small and medium-sized businesses (SMBs). Plytix PIM helps companies store and organize product information ranging from descriptions and images to prices, and other specifications, in one place. Essentially, it’s a handy tool that makes managing and updating product data a whole lot easier. About our culture We’re not big on corporate jargon, so we’ll keep it real. We’re a diverse team spread across the world, working together to build great software while enjoying the ride. We’ve been recognized as one of the best places to work in Spain by Great Place to Work® - 3 years in a row, but who’s counting ;) Plytix is no typical company, watch this video, and if you like what you see, keep scrolling. What’s the opportunity? This is your chance to work side-by-side with a founder-CEO who’s building thought leadership in ecommerce, SaaS, and AI. You’ll have a front-row seat to the conversations, insights, and predictions shaping the future of these industries—and you’ll be the one turning those into engaging content that reaches thousands of readers and followers globally. From research-driven Substack articles to bite-sized X threads and sharp LinkedIn posts, you’ll help amplify the CEO’s voice and build his reputation as a thought leader. If you’re someone who loves storytelling, thrives on digging into new ideas, and can balance creativity with precision, this role gives you the perfect mix of autonomy, creativity, and impact. What will you be doing? Researching and fact-checking industry trends, news, and insights to support the CEO’s content.Ghostwriting articles, posts, and threads in the CEO’s voice for Substack, LinkedIn, and X.Managing the editorial calendar for the CEO’s content channels.Collaborating with the CEO to brainstorm and refine narratives and storylines.Publishing, monitoring, and iterating content to grow reach and engagement.Ensuring consistency of tone, accuracy of information, and alignment with Plytix’s brand values. After 1 month:You’ll have a strong grasp of the CEO’s tone of voice, favorite topics, and how he likes to communicate. You’ll have already supported in drafting and publishing a few LinkedIn or X posts, and you’ll have a content calendar mapped out. After 3 months:You’ll be confidently ghostwriting and publishing across multiple channels. The CEO’s content will start showing measurable growth in reach and engagement. You’ll be known internally as the right hand for anything related to CEO thought leadership. 6 months in:You’ll have fully taken ownership of the CEO’s content ecosystem. The Substack will be running smoothly with consistent articles, social channels will be growing steadily, and the CEO’s voice will be a recognizable one in SaaS and ecommerce circles. By this point, you won’t just be producing content—you’ll be shaping a thought leadership brand. Who will you be working with? You’ll work directly with the CEO, collaborating closely on ideas and narratives. You’ll also interact with the Marketing team to align messaging and ensure the CEO’s voice complements Plytix’s broader brand strategy. Need to have: 5+ years of experience in content writing, journalism, ghostwriting, or copywriting.Exceptional English writing and editing skills.Ability to adapt tone of voice and write as if you are the CEO.Strong research and fact-checking skills.Experience managing and publishing on platforms like Substack, LinkedIn, and X.A portfolio showing long-form and short-form content across digital platforms. Nice to have Background in B2B SaaS, ecommerce, or retail.Experience working directly with executives or founders on personal branding.Knowledge of SEO and content analytics.A natural curiosity for AI, SaaS, and the future of commerce.A dog 🐶 (dogs are the best). To apply: Easy apply on LinkedIn and send us your video presentation via email to hr@plytix.comVideo presentation: for an explanation of the video requirement see this video 👉🏼 https://youtu.be/XgLelH6eIkc?si=p94LmMtktZOirsuH Why work at Plytix Voted one of the top best workplaces by Great Place to Work®Be a part of a welcoming culture with bright, friendly people from around the worldHave a purpose and plenty of opportunities to grow from day oneWork from home or from our offices in the center of MalagaDon’t work on your birthday—enjoy an extra day of paid time offEnjoy free catered lunches and unlimited ice cream when working from the office in MalagaCompetitive full-time salaryPrivate health insurance covered by PlytixGym discountFactorial Flexible Retribution (Restaurant, Transport & Nursery Vouchers)And more! About our culture PLYTIX is a company committed to diversity and equality. Therefore, all our selection processes guarantee equal opportunities for all candidates regardless of race, color, religion, sex, origin, nationality, age, disability, sexual orientation, and gender identity. All employment decisions are based on business needs, job requirements, merit, and individual qualifications. We are committed to managing your personal information with care and in accordance with our privacy policy. To learn more about how we handle your data, please click HERE."
    },
    {
      "title": "Marketing Manager (Crypto)",
      "company": "Revolut",
      "location": "France: About Revolut",
      "description": "People deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 60+ million customers get more from their money every day. As we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution. About The Role If Revolut is a rocket ship — and we like to think it is — best-in-class creativity is what propels us past the competition in the eyes of our customers. Working with Marketing, Product, Analytics, and just about any other team you can think of, our superstar Marketing Managers lead the development of jaw-dropping content and campaign strategies that demonstrate how beneficial Revolut is to millions of people. We're looking for a #GetItDone creative genius to join the team and take the lead on bringing our #NeverSettle propositions to market as a Marketing Manager for Crypto. You'll have an exciting opportunity to work closely with the local management team as well as the global function lead to drive growth in the market. Up for the challenge? Let‘s get in touch. What You'll Be Doing Identifying customer needs by understanding their behaviour and how our features work globally to create data-driven content to drive conversionDriving independently impactful go-to-market product launches by owning development of audience strategy, messaging, and communication strategiesDeveloping research plans to uncover customer insights, steer and validate product and marketing roadmaps, and stay on top of the competitive landscapeCreating market-leading campaign calendars designed to drive engagement across the entire funnel, from acquisition to retentionOwning tone of voice and style guides, adapting global campaigns aligned to local nuancesRunning experiments to test hypotheses and bring analytical rigour to campaigns for informing the go-to-market strategyDelivering campaigns with a solid bias for growth and business impactScaling creative marketing efforts globally by operationalising resources, such as playbooks for regional marketing teams What You'll Need Fluency in English (native level)5+ years of B2C marketing experience in a fast-paced environment (preferably a hyper-growth global tech company)Interest in the Crypto industryExcellent communication and interpersonal skillsPassion for Revolut’s products and featuresKnowledge of markets and the competitive landscape in the fintech or payments industryExtensive experience developing stories and compelling content to drive conversionExperience setting strategic direction and project managing complex campaigns that require input and execution from cross-functional teamsAn impressive track record of planning and creating editorial and commercial contentThe ability to analyse and distil data into actionable insights and to inform campaign strategy and product developmentTo be a charismatic people-person with the ability to talk to anyone and work in an evolving, growth environment Building a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team. Important notice for candidates: Job scams are on the rise. Please keep these guidelines in mind when applying for any open roles. Only apply through official Revolut channels. We don’t use any third-party services or platforms for our recruitment. Always double-check the emails you receive. Make sure all communications are being done through official Revolut emails, with an @revolut.com domain. We won't ask for payment or personal financial information during the hiring process. If anyone does ask you for this, it’s a scam. Report it immediately. By submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Revolut. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Revolut may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Revolut's <a class=\"postings-link\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\">Candidate Privacy Notice"
    },
    {
      "title": "(FR) LINKEDIN CONSULTANT - BTOB MARKETING DIGITAL",
      "company": "STATION F",
      "location": "Paris, Île-de-France, France: À propos",
      "description": "At Moriah, we help BtoB companies achieve their goals on LinkedIn: enhancing visibility, attracting new clients, recruiting top talent, forging partnerships, and launching new products or new markets. We empower our clients to leverage LinkedIn as a strategic B2B channel for branding, sales, recruitment, or international expansion. With a structured approach and mastery of LinkedIn’s algorithms, Moriah transforms LinkedIn into a powerful growth engine for businesses. Our Expertise Includes Personal Branding: We create and publish engaging LinkedIn content to build a strong professional image.Lead Generation: We launch targeted campaigns on LinkedIn to attract clients or top talent.Performance Ads: We manage highly targeted LinkedIn ads to deliver measurable results. By joining Moriah, you’ll contribute to delivering real, measurable success for our clients. Descriptif du poste En tant que Consultant LinkedIn, vous garantirez la réussite et la satisfaction de nos clients en délivrant des stratégies LinkedIn percutantes, en pilotant les projets et en générant des résultats mesurables. Onboarding Client – Stratégie MarketingOrganiser et animer des ateliers d’onboarding pour comprendre en profondeur les objectifs des clients.Définir des stratégies LinkedIn sur mesure pour le personal branding, la génération de leads et la performance publicitaire. Gestion de Projet Superviser la mise en œuvre des projets clients pendant les phases de setup et de run, incluant : L’élaboration de stratégies de contenu.Le lancement de campagnes outbound.La gestion et l’optimisation des publicités LinkedIn.Garantir la livraison dans les délais de toutes les tâches et maintenir un haut niveau d’exécution. Gestion de CompteÊtre le point de contact principal pour les comptes qui vous sont attribués et entretenir une relation de confiance sur le long terme.Identifier des opportunités de ventes additionnelles ou croisées de nos services.Fournir un reporting mensuel des indicateurs clés de performance (KPI) : croissance de l’audience, taux d’engagement, génération de leads.Analyser les performances des campagnes via des outils d’IA et proposer des axes d’amélioration fondés sur les données pour maximiser le ROI.Adapter les stratégies en continu en fonction des résultats, des retours clients et de l’évolution de leurs objectifs business. Maîtrise des Outils IAExploiter et maîtriser la suite d’outils IA internes développée par Moriah pour le marketing LinkedIn.Remonter des feedbacks à l’équipe produit et contribuer à l’amélioration continue de ces solutions. Profil recherché Nous recherchons une personne smart, entrepreneuriale et astucieuse, passionnée par l’envie de faire une vraie différence.Quelqu’un qui n’a pas peur de challenger le statu quo et d’apporter des idées nouvelles et innovantes à la table.Un esprit proactif, orienté solution, avec un fort sens des responsabilités et de la rigueur dans l’exécution.Une expérience en agence de marketing digital est un véritable atout. Surprise me, make me laugh, and show me how you’re ready to shake things up! Process de recrutement 1st call Interview Business Case Informations complémentaires Type de contrat : CDILieu : Paris Télétravail ponctuel autorisé"
    },
    {
      "title": "Director - User Acquisition",
      "company": "Pocket FM",
      "location": "France: With 100+ bn minutes streamed annually, 120 minutes of daily average listening time, and 6+ billion total audio plays on our platform, Pocket FM is on a mission to build the world’s largest AI-powered audio streaming platform. Rapidly growing",
      "description": "What sets us apart? We’re an AI-first company, leveraging cutting-edge generative AI to transform every part of our ecosystem—from content creation and language localization to marketing, distribution, and monetization. Our in-house AI has already powered 10% of US revenue and is listening through original, AI-generated audio series. We’re also expanding into new storytelling formats like comics and web novels, all built on the foundation of our proprietary AI platforms. You can get more updates, insights and everything behind the scenes at Pocket FM here - https://xtra.pocketfm.com/ What is the role?Goal is to scale and optimise spends across external digital marketing channels:New User AcquisitionReducing existing user churnRe-activation of Lapsed Users You’ll own user acquisition for the region, and build the playbooks that will define how we grow, monetize, and retain users in one of our most complex markets. What needs to be solved?Strategy: Marketing channel strategyEvaluate channel/ campaign performance working with the analytics and business teamsExperiment new channels and new products from existing partnersBabysit and manage the life cycle of UA campaigns from Acquisition to Retention via different channelsManage and drive monthly ad spends, balancing performance with stakeholder expectations. A key part of this is to work closely with studios and business team to align UA strategy with product A/B testing, maintaining a strong creative/playable pipeline and leveraging data analysis to drive continuous growth. Run A/B tests on creatives, campaigns and audiencesBuild direct publisher/ network relationships where helpful and run pilot campaigns to test feasibilityTest, launch and scale digital lead generation through programmatic buying Execution: Marketing operationsCampaign execution. Design, set up, and optimize campaigns to drive high-quality, cost-effective app installs -tracking and improving core KPIs like CPI, ROAS, Retention, and LTVCoordinating with the creative/ production team to launch quirky, audience centric creatives/ promosWorking with the third party agency to get all integrations completed and doing periodic campaign performance reviews. Identify and reduce fraud and misattribution across channelsAgency/ partner management Enablers: Ensure enablement and maintenance of tracking tags across various client apps and websiteReport campaign performance weekly to the business team, forecast monthly response volume and budgets What We’re Looking For7-10 years of experience with strong understanding of consumer funnel, consumer cohorts and targeting; scaling consumer tech or gaming companiesMedia understanding is a primary need. Experience of working with external agencies – Creative Agencies, Media Partners, Research Partners etc We are looking for data driven people who enjoy solving complex problems through analytical excellence and commercial acumen. Deep experience with attribution models, funnel analysis, ROI/LTV frameworksVery strong understanding of digital tools across search. performance, social media, reach platforms and where to use what Ability to judge creative assets both from a brand strategy as well as aesthetic sense Experience of working across the complete marketing mix i.e, new product launches, communication, revenue management, packaging developmentSharp understanding of creative strategy and the ability to scale high-performing assetsAn experiment-first mindset: bias for action, willingness to test, learn, and pivot quicklyHands-on operator - comfortable moving between strategy and execution"
    },
    {
      "title": "Content manager - Freelance",
      "company": "Buzzmates France",
      "location": "France: Buzzmates recherche des créateurs de contenu freelances pour rejoindre sa plateforme de talents.",
      "description": "Vous avez l’œil pour capter l’attention et le talent pour donner vie à une marque à travers des visuels, des vidéos ou des concepts originaux ? Vous savez adapter votre créativité aux codes d’Instagram, TikTok, LinkedIn, Facebook ou X, et produire des contenus capables de générer de l’engagement ? Alors votre profil nous intéresse. Contrairement à un influenceur, vous êtes avant tout un professionnel de la création digitale : vous concevez, produisez et optimisez des contenus pensés pour valoriser une entreprise ou un entrepreneur, et non pour promouvoir votre image personnelle. Le type de missions qui vous sera confié :Réalisation de photos, vidéos, carrousels ou visuels graphiques.Création de concepts éditoriaux ou de campagnes créatives.Rédaction de textes accrocheurs et storytelling adapté aux réseaux.Déclinaison des formats selon les spécificités de chaque plateforme.Optimisation et suivi des performances des contenus. Pourquoi rejoindre Buzzmates ?La majorité des missions se réalisent à distance.Un référencement sélectif vous ouvre la porte à des collaborations sérieuses et rémunératrices.Des budgets allant de 500 € à plus de 5 000 € selon les projets.200 à 300 nouvelles offres exclusives chaque mois, en fonction de votre secteur et des réseaux sur lesquels vous excellez.La possibilité de travailler avec plusieurs clients simultanément.Des mises en relation personnalisées, sans intermédiaire.Un référencement gratuit ou payant, selon vos préférences.Et surtout : aucune commission prélevée sur vos missions. Pour candidater, il vous suffit de vous inscrire via cette annonce et de remplir le formulaire dédié.Nous prendrons le temps d’examiner attentivement chaque candidature"
    }
  ]
}