
{
  "search_info": {
    "keywords": "software engineer",
    "location": "Paris",
    "limit_requested": 3,
    "jobs_found": 3,
    "search_timestamp": "2025-08-28T01:46:37.809209",
    "data_coverage": "Minimal - No duplicate fields",
    "export_version": "minimal_v7.0",
    "search_filters": {
      "experience_levels": {
        "codes": null,
        "description": null
      },
      "job_types": {
        "codes": null,
        "description": null
      },
      "remote_work": {
        "codes": null,
        "description": null
      },
      "time_posted": {
        "seconds": 604800,
        "description": "Last week"
      },
      "distance_miles": null
    }
  },
  "jobs": [
    {
      "id": "4290667033",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4290667033/",
      "title": "Junior Web Developer (Annual Salary: €60k-€120k) - EU",
      "company": "Joinrs",
      "company_url": "https://www.linkedin.com/company/joinrs-international",
      "location": "European Union",
      "description": "Our goal is to help every recent graduate worldwide find a job that aligns with their ambitions: join us to make the aspirations of a community of over 1,500,000 users come true!\nWe are constantly looking for students, recent graduates, and junior professionals (with 0 to 3 years of experience) who aspire to join our team across Europe. Apply for this position, and our HR team will contact you as soon as a relevant role becomes available and your profile matches our requirements.\nFor all Junior positions in the Tech Field, we offer a contract (Annual Salary: €60k-€120k) in the EU Region, you will have the opportunity to grow exponentially thanks to on-the-job training, you will be able to work in one of our offices or fully remote for as long as you want and we will equip you with a latest generation MacBook.\nWe are looking only for Junior profiles, with 0 to 3 years of experience.--\nResponsibilities:Within the team, you may be responsible for one or more of the following tasks:Front-end Development and Maintenance of Websites: Creating and updating the visible and interactive elements of websites using languages such as HTML, CSS, and JavaScript to ensure an optimal user experience.Assistance in Developing and Integrating Interactive and Dynamic Features: Supporting the creation and implementation of advanced features and animations using JavaScript frameworks and libraries like React or Vue.js.Collaboration with the Team to Solve Technical Issues and Implement Improvements: Working closely with other developers and team members to resolve bugs, address technical challenges, and effectively implement new features.Testing and Debugging Code to Ensure Correctness and Compatibility: Verifying and correcting errors in the code through the execution of automated and manual tests to ensure the website functions properly across different platforms and browsers.Participation in Designing and Implementing Intuitive and Responsive User Interfaces: Involvement in designing user interfaces, including element layout, color selection, and navigation management to enhance usability and accessibility.Updating and Optimizing Existing Websites to Improve Performance and User Experience: Reviewing and optimizing existing code, including reducing loading times, resolving compatibility issues, and implementing best practices for web design.\n--\nWhat We Offer:Working in the Joinrs team means being able to choose the best psychophysical conditions for tranquility and productivity. This translates into:Remote working and flexibility. You'll have the opportunity to work remotely full-time, but you can also use one of our offices.Dynamic work environment. Our offices remain open, providing shared workspaces, meeting rooms, break areas, and a bar with fresh fruit and various snacks. You'll also find a foosball table and a gaming station. We aim for an informal work environment that encourages shared moments, always respecting individual activities.Team building & fun. We frequently organize aperitifs, games, and leisure moments, which are integral parts of life at Joinrs, both inside and outside the office.Company welfare. We guarantee you a company welfare package that meets your expectations.Tech pack. You'll use advanced software and modern technologies, and you'll be provided with the latest-generation MacBook.Training. You'll always have a mentor in your Joinrs journey, acting as a reference for both technical and team aspects. We ensure constant professional growth with progressively increasing responsibilities. You can participate in industry events and training courses, along with continuous education on the best e-learning platforms.Social Impact. Your contribution will support thousands of recent graduates in finding the job they aspire to.--\nWho We Are:Our mission is to support every recent graduate and junior professional in achieving their goals, helping them start their careers with optimism and a clear vision for their future.\nWe are a united team that strongly believes in collaboration: together we work, discuss, and achieve results that inspire us to aim for ever more ambitious goals.\nOur community includes over 1,500,000 members across the US, UK, Europe, and Brazil, as well as 300+ companies like PwC, Accenture, Gi Group, Danone, and Siemens. And we’re growing fast—join us!--\nContract & Compensation:For all Junior positions we offer a full remote contract (Annual Salary: €60k-€120k).\nSalary reviews are scheduled every six months, with your compensation increasing rapidly as you gain experience and translate it into a more significant impact.--\nSelection Process:CV Screening: The first step is a curriculum vitae (CV) screening (usually within 20 days of application).Phone Interview: The second step involves a 15-minute phone interview with our HR Manager.Video Interview: The final step is a video interview with both the HR Manager and your future supervisor, lasting at least 45 minutes.--\nWhy Join Our Team?Social Impact: You'll have the opportunity to support our community in realizing their ambitions, as well as your own.Successful Startup: Joinrs was selected among the top 10 startups globally at the Web Summit in Lisbon.Exponential Personal Growth: You'll have the opportunity for exponential growth, both in hard and soft skills, thanks to a training program based on on-the-job training and online support.",
      "listed_at": "2025-08-25 10:13:49",
      "apply_url": "https://www.joinrs.com/job-offers/353935/?utm_source=linkedin&utm_medium=job-offer-ue&utm_campaign=353935-internal",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQFprpI9tmkwfA/company-logo_400_400/company-logo_400_400/0/1696490265118/joinrs_italia_logo?e=1759363200&v=beta&t=4K25txhuo2Ldp3iPMtT8nGxkYqiCOJ3iTU5Luh1RCmc",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    },
    {
      "id": "4130575977",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4130575977/",
      "title": "Candidatures spontanées Kraken Technologies",
      "company": "Kraken",
      "company_url": "https://www.linkedin.com/company/krakentech",
      "location": "Paris, Île-de-France, France",
      "description": "Help us use technology to make a big green dent in the universe!\n\nKraken powers some of the most innovative global developments in energy.\n\nWe’re a technology company focused on creating a smart, sustainable energy system. From optimising renewable generation, creating a more intelligent grid and enabling utilities to provide excellent customer experiences, our operating system for energy is transforming the industry around the world in a way that benefits everyone.\n\nIt’s a really exciting time in energy. Help us make a real impact on shaping a better, more sustainable future.\n\nOur mission is to provide cheaper, greener energy to the French marke t.\n\nWe want to do better for the planet, through real, long-term investment in renewable energy production and a low-CO2 future that's better for our customers' wallets. We want to revolutionize the energy business through our people, our platform and our use of data.\n\nOur focus is on customer satisfaction, and receiving positive reviews is important to us - we have the best score among French energy suppliers on Google Reviews and Trust Pilot.\n\nKraken technologies\n\nKraken Technologies is a company within Octopus Energy Group who are licensing the Kraken platform and operating model to clients across the world. Current clients are both the Octopus Energy retails businesses around the world as well as external clients such as Good Energy, Origin, EDF, E.ON & Queensland Energy - with many more expected to join over the next few years!\n\nOur team\n\nAll technology is written and maintained by a multi-discipline engineering team of around 450 people globally. This includes server-side, client-side and mobile engineers working closely with UX experts, copywriters and designers.\n\nWe follow a Kanban-like approach, using Google docs and Asana to specify and manage work; Github, CircleCI and Terraform Enterprise as part of an immutable-infrastructure, continuous delivery pipeline; and Loggly, Sentry and Cloudwatch to measure performance and monitor production.\n\nSome of our coding conventions are open-source.\n\nOctopus is a great place to learn, work with some talented engineers and level-up your skills.\n\nOur technology\n\nOn the server-side, we mainly use Python. Most of our websites are powered by Django, Django-REST-framework and GraphQL (Graphene).\n\nWe use AWS heavily, employing most of the \"Hashistack\" (eg Packer, Consul, Terraform) as part of a continuous deployment pipeline. See, for example, Django, ELB health checks and continuous delivery.\n\nClient-side, we use React, Redux and SASS; our mobile apps are built using native code or React Native.\n\nWe are always looking for new talents to complete our teams, if you do not find an opportunity that seems to match your profile or your interests, do not hesitate to send us a spontaneous application, it will of course be studied with attention !\n\nIf this sounds like you then we'd love to hear from  you.\n\nAre you ready for a career with us? We want to ensure you have all the tools and environment you need to unleash your potential. Need any specific accommodations? Whether you require specific accommodations or have a unique preference, let us know, and we'll do what we can to customise your interview process for comfort and maximum magic!\n\nStudies have shown that some groups of people, like women, are less likely to apply to a role unless they meet 100% of the job requirements. Whoever you are, if you like one of our jobs, we encourage you to apply as you might just be the candidate we hire. Across Octopus, we're looking for genuinely decent people who are honest and empathetic. Our people are our strongest asset and the unique skills and perspectives people bring to the team are the driving force of our success. As an equal opportunity employer, we do not discriminate on the basis of any protected attribute. Our commitment is to provide equal opportunities, an inclusive work environment, and fairness for everyone.",
      "listed_at": "2025-08-26 12:42:08",
      "apply_url": "https://jobs.lever.co/kraken123/5be6cd8d-ea24-4b27-9d2d-d51f79abb41b/apply?source=LinkedIn",
      "workplace_type": "Hybrid",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQHD0uhLz28lwg/company-logo_400_400/company-logo_400_400/0/1691424308528/krakentech_logo?e=1759363200&v=beta&t=s0xzVyPLHGwoZDwsBiUZTMqkrLkuNmHr6olUCnUgYT0",
      "job_state": "LISTED",
      "work_remote_allowed": false,
      "job_nature": ""
    },
    {
      "id": "4289954873",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289954873/",
      "title": "Acquisition Manager H/F",
      "company": "Condé Nast",
      "company_url": "https://www.linkedin.com/company/conde-nast",
      "location": "Paris, Île-de-France, France",
      "description": "Condé Nast est une société internationale de médias produisant des contenus de haute qualité, avec une empreinte de plus d'un milliard de consommateurs dans 32 marchés, à travers des plateformes imprimées, numériques, vidéo et sociales. Condé Nast abrite certaines des marques les plus emblématiques au monde notamment Vogue, Vanity Fair, Glamour, Self, GQ, The New Yorker, Condé Nast Traveler/Traveller, Allure, AD, Bon Appétit, Wired.\n\nJob Description\n\nAu sein du département Consumer Revenue France, l'Acquisition Manager H/F développera la base clients et les revenus BtoC des marques de Condé Nast France grâce à une stratégie multicanale d’acquisition (online et offline). L’acquisition manager H/F aura en charge l’activité Paid media pour les marques Vogue, Architectural Digest, Vanity Fair et GQ.\n\nPrincipales responsabilités et missions :\n\nDéfinir la stratégie et déployer la roadmap acquisition pour recruter de nouveaux abonnés à nos magazines, nos participants aux événements et nos clients, principalement via les différents canaux online : Paid Media, SEA, e-mailings, display, auto promotion, etc.Générer un trafic qualifié vers nos sites e-commerce.Optimiser la visibilité de nos campagnes.Gérer et répartir le budget global d’acquisition.Optimiser le ROI par canal, effectuer les arbitrages nécessaires.Définir et mettre en place les AB tests pour une recherche permanente d’amélioration de la performance de nos campagnes : wordings / créas / canaux.Briefer les graphistes et/ou prestataires externes.Travailler en collaboration avec les responsables internes business Consumer (abonnements / ventes / e-commerce) ainsi que les agences externes pour affiner la stratégie d’acquisition et améliorer la life time value.Mesurer, analyser et établir les reports de performance des campagnes en utilisant les outils de mesure à disposition.Faire le benchmark des best practices des titres de Condé Nast au niveau international ainsi que de la concurrence au niveau France.Explorer et proposer des nouveaux canaux d’acquisition.Mettre à jour le site e-commerce avec les nouvelles offres.Préparer et piloter les envois d’e-mails de prospection Marketing via notre plateforme Sailthru; suivre tous les KPIs pour optimisation (taux d'ouvertures, Taux de clics, conversions, CPA …)Mener des campagnes de collectes de leads.Veiller à ce que les visuels et messages de campagnes soient en cohérence avec nos lignes éditoriales et les profils de nos lecteurs.Accompagner l’évolution des outils Marketing et analytiques mis à disposition par Condé Nast global.\n\nProfil et qualités requises :\n\nAu moins 3 ans d’expérience en marketing digitalOrganisation, planification et priorisation : être capable de travailler sur plusieurs sujets et activités en simultanéRigueur et forte capacité d'analyse (profil Data driven)Force de proposition, dynamique, curieux, en recherche d’amélioration permanente. Bonne connaissance du Marketing digital, maîtrise des outils d’acquisition digitale et de leur évolution.Français langue maternelle de préférence, et Anglais courantAisance rédactionnelle.Esprit d’équipe (beaucoup d'interactions avec les autres membres de l’équipe Consumer locale, mais aussi Europe et globale).Autonomie.Une connaissance et expérience dans le secteur des médias et de la presse magazine seraient un plus.\n\nLocation:\n\nParis, 75C\n\nJob Type:\n\nRegular\n\nPour nous rejoindre ?\n\nSi vous êtes intéressé(e) par cette opportunité, veuillez postuler ci-dessous. Nous examinerons votre candidature dans les meilleurs délais. Vous pouvez mettre à jour votre CV ou télécharger une lettre de motivation à tout moment en accédant à votre profil de candidat.Condé Nast respecte le principe d'égalité des chances.\n\nLes missions et les responsabilités peuvent être ajustées en fonction des années d'expérience.\n\nLa rémunération est également en fonction de l'expérience.",
      "listed_at": "2025-08-22 21:06:38",
      "apply_url": "https://condenast.wd5.myworkdayjobs.com/CondeCareers/job/91-93-Rue-de-Richelieu-Paris-FR/Acquisition-Manager-H-F_R-21232-2?source=LinkedIn",
      "workplace_type": "",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHeOJLiS3pVGA/company-logo_400_400/company-logo_400_400/0/1630578317477?e=1759363200&v=beta&t=OSArKCtuyFq-vGsitUOeSBj6Zf2V2fsrfirINkliiAE",
      "job_state": "LISTED",
      "work_remote_allowed": false,
      "job_nature": ""
    }
  ]
}