{
  "search_info": {
    "keywords": "designer textile",
    "location": "Paris",
    "limit_requested": 5,
    "jobs_found": 5,
    "search_timestamp": "2025-08-27T17:42:20.076197",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289609104",
      "title": "Executive Content Creator ",
      "company": "Plytix",
      "location": "EMEA",
      "description": "We’re looking for an Executive Content Creator to help supercharge the voice of Plytix’s CEO across digital channels. This role is part researcher, part ghostwriter, and part content strategist. You’ll be working directly with the CEO to turn raw insights, notes, and ideas into polished content for X, Substack, and LinkedIn. From fact-checking trends to shaping narratives to managing the publishing process, you’ll make sure the CEO’s voice is sharp, consistent, and influential.\nWhat is Plytix?\nP...",
      "url": "https://www.linkedin.com/jobs/view/4289609104/",
      "custom_logo_url": ""
    },
    {
      "id": "4284167943",
      "title": "SEO Consultant - [Opening soon]",
      "company": "Botify",
      "location": "Paris, Île-de-France, France",
      "description": "Botify’s leading agentic AI search technology and seasoned experts ensure every brand has the power to be found, both in traditional and AI search. With one powerful platform, brands achieve visibility, relevance, and greater control across Google, Bing, ChatGPT, Perplexity, and more.\n\nBotify’s technology powers agentic workflows, AI-driven recommendations, and automated cross-platform indexation and deployment. Brands maximize visibility wherever consumers, bots, and AI agents search, protectin...",
      "url": "https://www.linkedin.com/jobs/view/4284167943/",
      "custom_logo_url": ""
    },
    {
      "id": "4289824303",
      "title": "Créateur de contenu - Freelance - À distance",
      "company": "Buzzmates France",
      "location": "France",
      "description": "Buzzmates recherche des créateurs de contenu freelances pour rejoindre sa plateforme de talents.Vous avez l’œil pour capter l’attention et le talent pour donner vie à une marque à travers des visuels, des vidéos ou des concepts originaux ? Vous savez adapter votre créativité aux codes d’Instagram, TikTok, LinkedIn, Facebook ou X, et produire des contenus capables de générer de l’engagement ? Alors votre profil nous intéresse.\nContrairement à un influenceur, vous êtes avant tout un professionnel ...",
      "url": "https://www.linkedin.com/jobs/view/4289824303/",
      "custom_logo_url": ""
    },
    {
      "id": "4288886117",
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US ",
      "company": "Call For Referral",
      "location": "European Union",
      "description": "Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects in collaboration with a leading AI lab. The role involves contributing to data campaigns across Creative Writing, Companionship, and Presentation domains. Successful candidates will apply judgment, critical thinking, and domain expertise to evaluate which responses are most effective, natural, and compelling.Ideal ProfilesCreative ...",
      "url": "https://www.linkedin.com/jobs/view/4288886117/",
      "custom_logo_url": ""
    },
    {
      "id": "4256688468",
      "title": "GTM Content Marketing Manager",
      "company": "ZenRows",
      "location": "EMEA",
      "description": "GTM Content Marketing Manager (100% Remote)\nAbout ZenRows: Born in the vibrant heart of the Basque Country in Bilbao, ZenRows is one of Europe's fastest-growing startups. Founded in 2021, we are dedicated to revolutionizing data workflows with our cutting-edge web data extraction platform, used globally across industries like e-commerce, real estate, finance, and AI. Our mission is to empower businesses with seamless, scalable data solutions to drive automation, analytics, and AI-driven insights...",
      "url": "https://www.linkedin.com/jobs/view/4256688468/",
      "custom_logo_url": ""
    }
  ]
}