{
  "search_info": {
    "keywords": "developer",
    "location": "Madrid",
    "limit_requested": 3,
    "jobs_found": 3,
    "search_timestamp": "2025-08-27T15:44:34.110063",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4288886117",
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US ",
      "company": "Call For Referral",
      "location": "European Union",
      "description": "Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects in collaboration with a leading AI lab. The role involves contributing to data campaigns across Creative Writing, Companionship, and Presentation domains. Successful candidates will apply judgment, critical thinking, and domain expertise to evaluate which responses are most effective, natural, and compelling.Ideal ProfilesCreative ...",
      "url": "https://www.linkedin.com/jobs/view/4288886117/",
      "custom_logo_url": ""
    },
    {
      "id": "4288580484",
      "title": "Technical SEO Manager - relocation to Cyprus",
      "company": "Medier Agency",
      "location": "European Union",
      "description": "We are looking for a highly skilled SEO Expert with proven experience in the iGaming industry to join our team. This role requires deep technical expertise, a strong understanding of complex web environments, and a track record of driving measurable organic growth. The ideal candidate will combine hands-on technical SEO knowledge with the ability to create clear implementation roadmaps for development teams.\nThis is an on-site in Limassol. We will be happy to relocate you!\nKey Responsibilities:L...",
      "url": "https://www.linkedin.com/jobs/view/4288580484/",
      "custom_logo_url": ""
    },
    {
      "id": "4289816396",
      "title": "Search Engine Optimization Team Lead",
      "company": "Six Values",
      "location": "EMEA",
      "description": "At Six Values, we are more than just a B2B betting and gaming technology company — we are creators of experiences that change people’s moods for the better.We work with a range of global client brands - are we are in “scale up” mode, hiring the best and most highly motivated, fast working, bureaucracy hating, “I want to win but I’m not afraid to fail…”, team players. We provide B2B support services to multiple technology and gaming partners, we believe in the free market, and want to hear from t...",
      "url": "https://www.linkedin.com/jobs/view/4289816396/",
      "custom_logo_url": ""
    }
  ]
}