{
  "search_info": {
    "keywords": "Marketing",
    "location": "Amsterdam",
    "limit_requested": 3,
    "jobs_found": 3,
    "search_timestamp": "2025-08-27T17:23:33.843143",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289282589",
      "title": "B2B Marketing Strategist ",
      "company": "Ask Phill",
      "location": "Amsterdam, North Holland, Netherlands",
      "description": "We're looking for a B2B Marketing Strategist, with minimum 3 years of experience, to join our growing creative team in Amsterdam.\nAs B2B Marketing Strategist, you will own and execute our inbound marketing engine, driving high-quality lead generation for Ask Phill. This is a strategic yet hands-on role where you'll mix campaign planning with practical execution, working closely with our in-house specialists and external partners to drive high-quality leads for our Shopify agency.\nOur Marketing &...",
      "url": "https://www.linkedin.com/jobs/view/4289282589/",
      "custom_logo_url": ""
    },
    {
      "id": "4288543270",
      "title": "(T) SEO Analyst",
      "company": "Foot Locker",
      "location": "Utrecht, Utrecht, Netherlands",
      "description": "Overview\n\nOur global house-of-brands inspires and empowers youth culture. Relentlessly committed to fuel a shared passion for self-expression, we create unrivalled experiences at the heart of the sport and sneaker communities through the power of our people. If you want to be a part of something bigger than you can imagine, you’ve come to the right place.\n\nThis is a 7-month, temporary contract starting in November 2025.\n\nAs An SEO Analyst You Will\n\nWork to advance the SEO performance on all EMEA...",
      "url": "https://www.linkedin.com/jobs/view/4288543270/",
      "custom_logo_url": ""
    },
    {
      "id": "4265168883",
      "title": "Vulploegmedewerker",
      "company": "Action",
      "location": "Heerhugowaard, North Holland, Netherlands",
      "description": "Een leuke bijbaan dicht bij huis met een flexibel rooster. Hoe moeilijk kan het zijn? Bij Action houden we het graag simpel, ook als het om jouw baan gaat. Als vulploegmedewerker bij Action werk je in een leuk team en plannen we in overleg met jou je werkuren in. Vergeet vakkenvullen in de supermarkt; bij Action heb je pas echt een superbijbaan!\n\nWork where the Action is!\n\nSamen met je collega’s zorg jij ervoor dat onze klanten snel hun producten vinden en nooit misgrijpen. Je vult de schappen a...",
      "url": "https://www.linkedin.com/jobs/view/4265168883/",
      "custom_logo_url": ""
    }
  ]
}