{
  "search_info": {
    "keywords": "product owner",
    "location": "Vilnius",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T22:24:16.644022",
    "data_coverage": "Streamlined - Direct access fields",
    "export_version": "streamlined_v6.0",
    "search_filters": {
      "experience_levels": {
        "codes": null,
        "description": null
      },
      "job_types": {
        "codes": [
          "C"
        ],
        "description": [
          "Contract"
        ]
      },
      "remote_work": {
        "codes": null,
        "description": null
      },
      "time_posted": {
        "seconds": 604800,
        "description": "Last week"
      },
      "distance_miles": null
    }
  },
  "jobs": [
    {
      "id": "4289631371",
      "job_posting_id": 4289631371,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289631371/",
      "title": "Content Designer",
      "company": "Cavendish Professionals",
      "company_name": "Cavendish Professionals",
      "company_url": "https://www.linkedin.com/company/cavendish-professionals",
      "location": "Vilniaus, Lithuania",
      "description": "Responsibilities:\nAs a Content Designer, you will play a pivotal role in shaping product strategy and crafting content that delivers relevant information and an exceptional user experience. You will use audience research and data insights to inform content creation, placement, and optimization. Acting as both a subject matter expert and team collaborator, you will guide and support colleagues to ensure effective performance and decision-making.\nKey responsibilities include:Developing innovative content strategies that resonate with diverse audiences.Conducting in-depth audience research to inform content design and placement.Collaborating with cross-functional teams to deliver consistent messaging and branding.Leveraging analytics to evaluate content performance and drive improvements.Leading team discussions, contributing to decisions across multiple teams, and providing effective solutions to complex challenges.Fostering an inclusive, creative environment that empowers all team members to contribute.\nRequired Expertise:Advanced proficiency in content creation, with strong capability in product development, digital content solutions, content planning/distribution, and content assessment.Demonstrated experience in content design and/or copywriting.Familiarity with eCommerce-level CMS platforms (preferably headless CMS).Proficiency with Adobe Creative Cloud and Sketch.Solid knowledge of SEO best practices.Experience producing a wide range of campaign assets for social media and programmatic channels (e.g., images, GIFs, videos).Strong focus on delivering reusable digital assets adaptable across multiple campaigns.\nFurther Information:Duration: Long term contract (B2B)Workload: Remote",
      "listed_at": "2025-08-26 17:20:51",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFXGyrrWdPM8g/company-logo_400_400/company-logo_400_400/0/1630613078749/cavendish_professionals_logo?e=1759363200&v=beta&t=-5My_ok82ociRKhwjOPo1Psoc2znF7kwWstnOQ3jT8A",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4289831556",
      "job_posting_id": 4289831556,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289831556/",
      "title": "Head of Marketing",
      "company": "Daily Spoon®",
      "company_name": "Daily Spoon®",
      "company_url": "https://www.linkedin.com/company/daily-spoon",
      "location": "Lithuania",
      "description": "Head of Marketing (e-commerce)\n📍 Vilnius, Lithuania (Hybrid) | Full-time / Open to hands-on fractional position \nDaily Spoon is one of the fastest-growing wellness brands in the Baltics, with a strong community of women who trust us with their health and daily rituals.\nWe’re looking for a hands-on Head of Marketing with a strong e-commerce background to join our small but ambitious team. This is a key role where you’ll own marketing end-to-end: from creative campaigns and email funnels to market expansion and data-driven growth strategies.\n💌What you’ll doCoordinate email marketing: campaign calendar, automations, and performance optimization.Drive website conversion & CRO: initiate banners, upsells, landing pages, UX improvements.Grow our subscription model: refine offer positioning, retention, and strategy.Manage and analyze paid ads: proof creatives, monitor performance, generate new test ideas.Lead campaigns & launches: new products, seasonal pushes (e.g., Black Friday, Christmas), photoshoots, creative execution, influencer marketing strategy support.Develop and execute market expansion strategies: oversee localization and scaling to new markets.Lead our small but talented marketing team and external partners.\n💌What we’re looking for4–6 years of hands-on e-commerce marketing experience (DTC preferred).Proven track record in email, ads and campaign execution.Strong mix of analytical + creative skills. We grew because of our creativity, not big campaign budgets, be ready for that. Understands what small team in growing company is about — ready to be both strategist and doer.Bonus: experience in expanding to new markets and handling localization challenges.Fluency in Lithuanian, based in Vilnius.\n💌Why join Daily SpoonBe part of a one of the most loved wellness brands in the region.Real ownership: your ideas and execution will directly shape our growth and you will get instant encouragement from extremely supportive community. Opportunity to lead major campaigns, product launches, and market expansions.Competitive salary (€45–55k annually gross) and bonus opportunities as the company grows.Hybrid work setup with flexibility (office in Vilnius).\n📩 We will be looking forward to hearing from you radvile@dailyspoon.lt ",
      "listed_at": "2025-08-27 10:45:21",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQG_vsdBJRdYcg/company-logo_400_400/company-logo_400_400/0/1729959340107/daily_spoon_logo?e=1759363200&v=beta&t=VhK5mqp24hhauT5yL9clDCSiOR1zoWAjCFZSNX8h4fs",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4291845623",
      "job_posting_id": 4291845623,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4291845623/",
      "title": "Interim Head of Marketing",
      "company": "TestGorilla",
      "company_name": "TestGorilla",
      "company_url": "https://www.linkedin.com/company/testgorilla",
      "location": "EMEA",
      "description": "Hi there, I’m Wouter, CEO at TestGorilla. We’re excited to share more about this interim Head of Marketing role and our team.\nAbout TestGorillaImagine a world where everyone lands their dream job. TestGorilla is revolutionizing the hiring process through skills-based hiring, empowering one billion people to do just that. Our platform provides scientifically validated tests, enabling companies to hire faster and without bias, based on true skills and potential. We also empower candidates to showcase their abilities and find ideal roles.At TestGorilla, we stand for diversity, act with integrity, and put talent first. We celebrate individuality and creativity and believe in a workplace where you can make a big impact. Our team works in a flexible, autonomous environment with a focus on well-being and results.Join us in creating a future where skills matter most, and everyone has the chance to land their dream job.\nAbout the roleThis is a 6 months interim leadership role, with possibility for an extension, to accelerate our next phase of growth while providing hands‑on management within the marketing team. You’ll build a sales‑led growth (SLG) motion on top of our product‑led growth (PLG), unlock new marketing channels (email, events, sponsorships, partnerships), and partner deeply with Sales and the broader GTM org to create qualified pipeline and revenue. You’ll also help us win in the Sourcing market—making the “Sourcing + Evaluate” story unmistakable—and support healthy two‑sided marketplace dynamics across employer and job‑seeker experiences.\nWant to see what it's like to join the leadership team and make an impact as an Interim Head of Marketing? Get an inside look in this quick video by Wouter\nResponsibilitiesIn this role, your responsibilities will include but not limited to:Build SLG on top of PLG:Shape a sales-led growth motion that complements PLG and fuels stronger results together with Sales and GTM.Unlock new marketing channels: Develop new channels, such as email, events, sponsorships, and partnership that fuel sales-led growth.Sourcing market growth: Craft the narrative and campaigns that showcase access to 2m+ skills‑tested job seekers and the advantage of combining Sourcing + Evaluate in one platform; orchestrate employer‑side demand while partnering internally on job‑seeker engagement so the marketplace flywheel turns.Leadership and management: Direct management of 3 x marketing leads, and leadership of the wider marketing teamInterim content channel support: Provide interim consultancy for maternity cover for content lead. Give advice to the content team on strategy, content decisions and organic pipeline growth.Outcome‑oriented execution: Guide the team to focus on what matters most, marketing that creates sales opportunities and drives new product-led ARR.AI adoption: Encourage and model significant AI in marketing research, development and innovation.Uphold our behaviors: Model our company behaviors—think big, deliver user value fast, own outcomes, raise the bar, dive deep, learn and grow, and support each other.\nWhat you’ll bringWe're looking for someone who:Has senior B2B SaaS experience layering SLG onto PLG.Has opened and scaled new channels (email, events, sponsorships, partnerships) and proven their business impact.Deep understanding of organic content channel execution and strategy (PR, content, social, SEO), and capable of providing support during maternity leaveIs a collaborative partner to Sales; comfortable committing to shared SQO and pipeline targets.Strong empathetic leadership skills that keeps priorities focusedUnderstands or has led marketing for a marketplace or two‑sided product (bonus in HR tech/talent).Moves easily from strategy to hands‑on execution. Comfortable reviewing a forecast in the morning and helping craft a nurture sequence in the afternoon.Communicates with clarity and empathy; builds trust quickly with cross‑functional leaders and the team.Believes in skills-based hiring.Based in an EMEA country that we hire from and is available from as early as October, 2025. The role is expected to require the equivalent of a full-time engagement - minimum four days per week.We actively seek diversity and encourage applications from everyone. If you're interested in this role but your experience doesn't perfectly match the description, please still apply. Studies show that women and underrepresented groups can be hesitant to apply unless they meet every requirement. If this role excites you and you're confident you can do the job, we encourage you to apply!\nWhat’s in it for you?This is a time-bound, high-impact leadership role where you’ll shape TestGorilla’s next stage of growth:Make your mark quickly: Build and launch new marketing motions that have direct impact on pipeline, revenue, and category leadership in a matter of months.Steer a talented team: Provide steady leadership during a maternity leave, keeping priorities sharp and helping the team tie their work to business outcomes.Drive category creation: Play a pivotal role in helping us win in the Sourcing market, shaping how employers discover and hire from our pool of 2m+ skills-tested candidates.Operate at the intersection of PLG and SLG: Few companies are at this exact inflection point—you’ll design and implement the sales-led growth engine on top of a thriving PLG base.Global, remote collaboration: Work fully remote with mission-driven colleagues across 50+ countries, in a culture that values flexibility and async collaboration.Interim scope with lasting impact: While this is a 6 months engagement, the systems, channels, and plays you establish will continue to drive impact long after.\nInterested?We believe in using our own product to ensure fair and objective hiring. If this role aligns with your skills and aspirations, we invite you to complete one of our very own assessments. This will give you a first-hand experience of our platform and help us get to know you better. We look forward to hearing from you!TestGorilla is committed to building a diverse and inclusive workplace. We believe that diverse teams are stronger teams, and we encourage applications from people of all backgrounds. We understand that some candidates may experience test anxiety, and we want to assure you that accommodations are available and can be requested prior to sitting our assessments. Your request will not negatively impact your application, as we do not factor this into our review process.",
      "listed_at": "2025-08-27 13:06:12",
      "apply_url": "https://testgorilla-1680540968.teamtailor.com/jobs/6351383-interim-head-of-marketing?promotion=1603134-trackable-share-link-linkedin",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQGj-BZy_e3XFA/company-logo_400_400/company-logo_400_400/0/1711438710982/testgorilla_logo?e=1759363200&v=beta&t=HFxxpsHpyUu-CBgewsem8je6-gQcbKMH_9idna1z6fI",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4289873072",
      "job_posting_id": 4289873072,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289873072/",
      "title": "GoogleAds & Paid Social Manager / Growth Performance Marketing Manager",
      "company": "AirAdvisor",
      "company_name": "AirAdvisor",
      "company_url": "https://www.linkedin.com/company/airadvisor",
      "location": "European Economic Area",
      "description": "✈️ Join AirAdvisor – Innovate, Lead, and Make an Impact, and work remotely from anywhere in the world✈️\n\n*In your CV, please focus on results that you have achieved thanks to campaigns managed by you, ideally in absolute numbers or percentages (revenue increase, no. of new customers, decreased CPA/CAC, ROAS, etc.). This is a role in which performance matters; if you do not report on your achievements, how will we know that you are good at what you are doing?\nAbout Us✈️At AirAdvisor, we are dedicated to ensuring air travelers receive the compensation they are entitled to for flight disruptions. Whether it’s a delay, cancellation, missed connection, or an airline-related issue like overbooking. In June 2025, we launched a new service for baggage claims for lost and destroyed luggage. We are present in the EU, UK, and other international markets, focusing on protecting air passenger rights globally. We have successfully processed over 480,000 claims for clients from 221 countries, learning a 4.7-star rating from 23,000+ reviews. Currently operating in 21 languages (with 9 more forthcoming this year), AirAdvisor is an ambitious and fast-growing startup with a clear vision for international expansion, and we plan to reach 1 million claims by the end of 2026. ✈️\nWe are seeking a highly skilled and data-driven GoogleAds and Social Media Manager to lead our digital marketing efforts. The primary focus will be on managing and optimizing Google Ads, Bing Ads, and Social Media Ads.. The ideal candidate will have a proven track record in driving customer acquisition, retention, and revenue growth through performance marketing strategies.\nWhat You Bring:Strong experience in performance marketing, growth roles, or digital consumer brands, ideally both in-house and agency experience. Expertise in GoogleAds, Bing Ads, and Social Media Ads.Strong knowledge of website analytics tools (e.g., Google Analytics, WebTrends)Experience in A/B testing, multivariate experiments, and campaign optimizationProven ability to manage paid acquisition campaigns and budgetsData-driven mindset with a focus on growth, ROAS, ROI, and optimisation towards CPA targets.Strong understanding of competitor analysis, localization, and content development best practicesExperience in EU, UK, US, and or Canadian markets is a must-have condition.Ability to not only design performance marketing solutions but also execute them successfullyAbility to transform complex ideas into a clear and compelling narrativeStrategic thinker with logical and data-driven approaches to work and businessLegalTech, TravelTech, and Travel Arrangements industries experience is a strong advantage\nWhat You Will Do:Develop and execute performance marketing strategies to drive customer acquisition, retention, and revenue growth for multiple accounts/marketsManage and optimize Google Ads, Bing Ads, and paid social media campaigns (Facebook, Instagram, LinkedIn, TikTok)Oversee display, programmatic advertising, and retargeting strategiesOptimize email marketing and retargeting campaigns to enhance customer journeysConduct customer segmentation, competitor analysis, and localization for targeted campaignsTrack and analyze campaign performance using tools like Google AnalyticsUse data insights to optimize campaigns, reallocate budgets, and refine creativesConduct A/B and multivariate testing to improve ad performance and conversion ratesCollaborate with creative and cross-functional teams to develop high-performing campaignsEvaluate and implement marketing tools and automation for efficiency and scalabilityStay updated on industry trends and experiment with new channels and tacticsPresent performance reports to leadership, highlighting wins and opportunitiesDirectly cooperate with the CEO\nWho you are as a person:Self-aware, honest, and able to take responsibility for mistakes while driving continuous improvement.Result-oriented, with a proven ability to deliver fast and make a significant impact on product growth.A results-driven approach, demonstrating initiative and the ability to manage multiple projects simultaneously.Exceptional problem-solving skills and creative thinking abilities.Independence: Ability to act as a universal player, capable of working independently without constant supervision.Speed: Result-oriented, with a focus on delivering fast and making an immediate impact.Devotion: Eager to make a significant impact on the product, with a willingness to go above and beyond to achieve his goals.Excellent communication skills, with the ability to articulate complex ideas clearly and concisely.\nWhy You’ll Love Working With Us:We are a remote-first culture with flexible start and end times. Your working hours will be easily registered in our time-tracking application, so you will have the flexibility to adjust your working day according to your needs and capacities.You can work from anywhere in the world.Paid Vacation & Public Holidays, because work-life balance matters.Annual pay review and performance-based bonuses.Professional Growth Opportunities: work on a global expansion and new market entry.Dynamic work and a chance to learn how to utilize your skills in an absolutely new way.Supportive Team Culture: Work with smart, passionate, and friendly colleagues who value collaboration.International Team - our colleagues are located in 12 countries around the globe.\nJob Type: Indefinite-term Freelancing Contract / Service Agreement or B2B Contract\nIf you're ready to take on a high-impact role in a fast-growing company, apply now, and let's fight for airline passenger rights globally!\nOur Recruitment Process:Call for Action: Please make sure that your CV includes clear, measurable, and top-level results/achievements. This is a role in which performance matters; if you do not report on your achievements, how will we know that you are good at what you are doing?Application screening: If your profile, experience, and past achievements match our business needs, our Talent Acquisition Manager will invite you to the HR interview.HR interview: Before meeting with our Recruitment Manager, please conduct research on our company and the industry we operate in, and be prepared to discuss your current achievements. If you wish, you can send us your portfolio or presentation on your market research and/or achievements in advance of the interview so that we can better prepare for the conversation.Interview with the CEO: Our CEO will discuss your functional experience, achievements, and technical skills in more detail. Please prepare for the interview; it will not be just a meet-and-greet experience.Reference check: Before we invite you to join our company, we will conduct a reference check with two of your previous managers and one of your senior colleagues with whom you have worked closely on your most important projects.\n✈️ Join us and bring LegalTech & TravelTech innovation to the next level!✈️\nIf you would like to be the first to know about our new job openings, company business updates, new services, and rankings related to the airports, airlines, and aviation industry, please follow our LinkedIn company page and social media profiles.",
      "listed_at": "2025-08-27 15:35:57",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFKJeGBEG9OcA/company-logo_400_400/B56ZZexrHIHsAY-/0/1745346802508/airadvisor_logo?e=1759363200&v=beta&t=QPr9x340ULGKRb883IjtROMl0ozWO4aa728bhnGoJYY",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4289825766",
      "job_posting_id": 4289825766,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289825766/",
      "title": "Freelance Linguistic Editor",
      "company": "DeepL",
      "company_name": "DeepL",
      "company_url": "https://www.linkedin.com/company/deepl",
      "location": "EMEA",
      "description": "About DeepLDeepL, Europe’s leading AI company since 2017, is dedicated to breaking down language barriers and bringing cultures closer together. Our expertise in AI and neural networks has enabled us to create cutting-edge communication technologies, including the acclaimed DeepL Translator, which offers 30+ languages, and DeepL Write, our AI writing companion. Our core offering includes a suite of products and tools made for individuals and businesses around the globe to communicate more effectively.Our goal is to build products that help drive better communication, enable deeper connections, and make real-life impact. To do that, we need talented people, such as yourself, who want to be a part of this exciting journey.\nWhat will you be doing for DeepL?Our freelance projects give you the opportunity to work on a wide array of linguistic tasks ranging from quality evaluations to categorizing, labelling, transcreation, translating, and much more. We offer truly unique bilingual and monolingual projects that will bring a change of pace and allow you to explore your working language(s) in completely new ways. Are you a freelance linguist, writer, journalist, or someone who has experience working on other types of language-centric tasks? Would you like to contribute your expertise to an exciting variety of projects at DeepL? If so, please register using the Apply button.",
      "listed_at": "2025-08-27 09:53:13",
      "apply_url": "https://adminling.deepl.com/apply?ref=linkedin",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQG6lwR49RGjUw/company-logo_400_400/company-logo_400_400/0/1688462927952?e=1759363200&v=beta&t=I8TrrQBUnOjWXfHmsdJtFTSJuLY6ULIrhdrnBdjVXzE",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4286326662",
      "job_posting_id": 4286326662,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4286326662/",
      "title": "Editor - Retainer",
      "company": "UNOPS",
      "company_name": "UNOPS",
      "company_url": "https://www.linkedin.com/company/unops",
      "location": "EMEA",
      "description": "Application period 20-Aug-2025 to 03-Sep-2025\n\nFunctional Responsibilities:\n\nThe Editor will report to the Intergovernmental Affairs Specialist. The scope of work includes but is not limited to the following:\n\nEdit official documents pertaining to UNOPS; edit the decisions during the three yearly sessions of the Executive Board (requires physical presence); serve as rapporteur of the session for the UNOPS segment of the Executive Board, keeping record of the Board’s meeting discussions on UNOPS, provide editing support on an ad-hoc basis in relation to UNOPS official documentation for submission to the Board.\n\n The editor will be asked to perform the following tasks:\n\n Edit UNOPS official documents within stipulated deadlines, according to United Nations editorial standards, for submission to the Executive Board, working with author departments to ensure that policies and messages are conveyed accurately.Edit Board’s decisions pertaining to UNOPS during the Board’s sessions, following the established practice and rules.  Serve as rapporteur of the two regular and the annual sessions of the Executive Board, as required (requires physical presence).  Work closely with the Intergovernmental Affairs Specialist and the Senior Analyst who will support communication with the author departments.  Prepare and deliver two copies of the documentation (one with tracked changes and a clean copy) to the author departments and to the NYBER team.  Ensure that the text is grammatically correct, logically structured and appropriate in language, style and format for the intended audience.  Ensure accurate, consistent use of terminology and spelling in line with UN standards and in keeping with the UNOPS house style.  Liaise with colleagues from various offices and units across the organization – including corporate units based at UNOPS headquarters – to discuss feedback on submitted work.  Implement changes based on feedback provided by UNOPS teams.  Ensure timely delivery of writing/editing/proofreading assignments in accordance with agreed specifications and timelines. \n\n\nEducation/Experience/Language requirements:\n\nEducation\n\nAdvanced university (Master’s) degree, preferably in journalism, communications, social sciences, or other relevant areas of expertise. University Degree (Bachelor’s degree / first level) with two additional years of relevant professional experience may be accepted in lieu of the advanced university degree. \n\n\nExperience\n\nMinimum of five years relevant experience in writing, editing or similar communications-focused role Experience writing, proofreading and copy editing parliamentary documentation for the United Nations. \n\n\nLanguage\n\nFluency in English is required, with excellent English writing and copy editing skills Knowledge of French or Spanish would be an asset \n\nThink big. Meet challenges head-on. Help people build better lives.\n UNOPS embraces diversity and is committed to equal employment opportunities. Our workforce is made up of people from varied nationalities, cultures and races. They speak a range of languages and have different gender identities, sexual orientations, and abilities.\n We encourage women and candidates from underrepresented groups in UNOPS to apply. These include candidates from racialized and/or indigenous groups, members of minority gender identities and sexual orientations, and people with disabilities. Click apply and join us!\n\nRemarks: Please note that only shortlisted candidates will be contacted and advance to the next stage of the selection process.\n",
      "listed_at": "2025-08-26 13:07:06",
      "apply_url": "https://jobs.unops.org/pages/viewvacancy/VADetails.aspx?id=30621",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHgjhhTfxYTLg/company-logo_400_400/company-logo_400_400/0/1631300671981?e=1759363200&v=beta&t=FT9n53T5fyE3Zd1OIECYDHYzQwLL19cd96ksHFjyjD0",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4288891066",
      "job_posting_id": 4288891066,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288891066/",
      "title": "Project Manager",
      "company": "Robson Bale",
      "company_name": "Robson Bale",
      "company_url": "https://www.linkedin.com/company/robsonbale",
      "location": "European Union",
      "description": "Project Manager - Part Time (4 hours per day or 2.5 days per week) - LMS - Fully Remote from the EU\nCandidates MUST be based in the EU for this role\nFamiliarity with LMS platforms (eg, CSOD, Percipio) and SSO setup processes.Understanding of GDPR and data governance requirements in learning record migration.Ability to coordinate adoption campaigns and training webinars, leveraging vendor offerings.Proven ability to lead strategic initiatives with a clear focus on business outcomes.Comfortable navigating complex global landscapes and aligning project goals with organizational priorities.Experience in managing vendor relationships and service package negotiations (eg, Minimum, Basic, Standard offerings from LinkedIn Learning).English proficiencyEngage in collaboration with Group colleagues as well as global stakeholders (including HR) with strong professionalismSkilled in cross-cultural communication and virtual collaboration toolsDemonstrates curiosity and initiative in uncovering unknowns, such as:Whether and how LinkedIn Learning should connect with employees' private LiL accounts.Clarifying GDPR-related constraintsComfortable working with ambiguity and driving clarity through structured exploration.",
      "listed_at": "2025-08-26 11:43:28",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQG147u0-BjlXg/company-logo_400_400/company-logo_400_400/0/1630555140289?e=1759363200&v=beta&t=N_P5C4UXgo3FPKZukjQx0dHbhE2H3AEwhtBYvu-W7Q0",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4288887224",
      "job_posting_id": 4288887224,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288887224/",
      "title": "Product Manager AI/ML",
      "company": "RED Global",
      "company_name": "RED Global",
      "company_url": "https://www.linkedin.com/company/red-commerce",
      "location": "European Union",
      "description": "🚀 We’re hiring: Product Manager – AI/ML - Fully Remote - Long Term Project - Leading Organisation\nAre you passionate about shaping the future of AI-driven products? We’re looking for a Product Manager – AI/ML to lead the full lifecycle of innovative machine learning solutions — from vision and strategy to hands-on execution. In this role, you’ll bridge business goals with cutting-edge technology, working closely with data science, engineering, and design teams to deliver products that truly make an impact.\nWhat you’ll doDefine and own the roadmap for AI/ML products aligned with business needs and market opportunities.Partner with cross-functional teams to design, test, and launch AI-powered solutions.Drive Agile development cycles, ensuring timely, high-quality delivery.Establish frameworks and best practices for managing AI/ML product lifecycles.Translate complex AI concepts into clear, actionable strategies for stakeholders.\nWhat we’re looking for7+ years in product management, with 3+ years focused on AI/ML or data-driven products.Strong technical understanding of ML technologies, cloud platforms, and data science workflows.Experience leading cross-functional teams and managing complex product lifecycles.Strategic thinker with hands-on problem-solving skills and an Agile mindset.Bonus: Experience in regulated industries (pharma, healthcare) and familiarity with compliance standards.\nIf you’re excited about creating AI/ML products that push boundaries and deliver real value, we’d love to connect. Apply now and help us shape the future of intelligent solutions.",
      "listed_at": "2025-08-26 11:24:12",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQE7P3LHOyuchw/company-logo_400_400/company-logo_400_400/0/1718893560114/red_commerce_logo?e=1759363200&v=beta&t=RxqVZHBJRecZB6YDoYzJ7WSuHpzUCvHK47PSvpnaE6Q",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4288723911",
      "job_posting_id": 4288723911,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288723911/",
      "title": "Social Media Manager",
      "company": "The TalentHQ",
      "company_name": "The TalentHQ",
      "company_url": "https://www.linkedin.com/company/the-talenthq",
      "location": "EMEA",
      "description": "Are you a growth-driven social media rockstar?You'll work with two amazing podcasts: Leveling Up and Marketing School.You'll craft killer YouTube titles and thumbnails.The kind that stops scrollers in their tracks.You'll manage content calendars across five major platforms.If that sounds like you, read on.\nRole DetailsHere's what you'll do:Content Management: Manage content scheduling, post 5x per day across longform, podcasts, and shortform content.Quality Assurance: Review editor videos for quality assurance, ensuring all content meets high-quality standards before publication. Push for revisions as necessary to maintain top-notch content.Proactive Communication: Actively communicate with editors and designers to ensure all content will meet deadlines.Performance Monitoring and Optimization: Track social media performance metrics, analyze engagement, reach, and traffic, and use insights to continuously optimize content.Trendspotting & Innovation: Stay ahead of platform updates, trends, and best practices, proposing and implementing new strategies for enhanced brand presence.\nYou'll fit right in if you…Improvement Obsessed: You're always finding better ways to do thingsExecution Machine: You hit deadlines religiously and keep teams on trackVolume Handler: You're used to managing 20+ pieces of content weeklyTeam Organizer: You've managed editors, designers, and creative workflowsData-Driven Executor: You track metrics daily and adjust strategy based on results\nSkills & Experience\nMust-Haves:5+ years of experience managing social media platforms for brands or agencies.Strong proficiency in tools like Asana, Metricool, Meta Business Suite, and content management systems.Exceptional attention to detail, able to spot errors and request revisions for high-quality content.Organized individual able to post 5 daily content pieces (longform, podcasts, shortform) with timely descriptions, thumbnails, and revisions.Comfortable with providing feedback and following up with editors on deadlines.Proactively communicates potential slowdowns.Experience tracking performance data and suggesting areas of improvement.A self-starter who is open to trying new tools and sharing insights with minimal guidance.\nNice-to-Haves:Expertise in content creation and community management across Instagram, LinkedIn, Twitter, TikTok, and Facebook.Background in analytics and using insights to inform content strategy and improve performance.Strong understanding of paid social campaigns and their integration with organic content strategies.Passion for staying updated on social media trends, platform changes, and best practices.Experience with building communities and fostering brand loyalty.\nWhat We OfferUSD $2,300 - $2,700 (based on experience)100% remote, with overlap on EST business hours (9 AM - 5 PM)Remote-first culture with flexible scheduleLearning budget for new AI tools and platforms\nAbout UsWe're Single Grain.We’re a digital marketing agency that’s been helping companies like Amazon, Uber, and Salesforce grow since 2009.And we practice what we preach:Our blog brings in over 200,000 monthly visitors, our podcast has 100+ million downloads, and 140,000+ marketers subscribe to our YouTube channel.We’re building a lean, elite team focused on doing smart, impactful work without bloated process or hierarchy.If you're self-directed, collaborative, and relentless about accuracy and excited about AI, you’ll fit right in.\nReady to Apply?Submit your application below.\nNote: Only resumes in English will be taken into consideration.In the form, please respond \"orchestrator\" to the \"Why should we consider YOU for this position?\" question",
      "listed_at": "2025-08-21 05:44:06",
      "apply_url": "https://www.careers-page.com/talenthq/job/L7RR969X",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHEfIdoJWd0MA/company-logo_400_400/company-logo_400_400/0/1718748039680/the_talenthq_logo?e=1759363200&v=beta&t=bSTWaXkYoegdFK5t6pV-xp-WR1Y15UAhfgppjJuHw2c",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    },
    {
      "id": "4288767136",
      "job_posting_id": 4288767136,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288767136/",
      "title": "Freelance Marketing",
      "company": "Twine",
      "company_name": "Twine",
      "company_url": "https://www.linkedin.com/company/twine.is",
      "location": "European Economic Area",
      "description": "A UK-based digital marketing agency is seeking a full-time Digital Marketing Support professional to assist with day-to-day client communications, website updates, and ad account management. The role involves maintaining WordPress and Elementor-based websites, implementing small updates, troubleshooting minor issues, and ensuring all client requests are handled efficiently and professionally via email, phone, and chat. You will also support the management of Google Ads accounts by adjusting budgets, optimizing campaigns, and reporting on key performance metrics. Additional responsibilities include maintaining task and project tracking through Google Sheets. This is a remote position requiring availability during UK business hours and close collaboration with the internal team.\nRequirementsStrong communication skills in written and spoken EnglishExperience with WordPress and Elementor for basic updates and editsWorking knowledge of Google Ads, including campaign management and reportingAbility to manage and update spreadsheets in Google SheetsHigh attention to detail and strong organizational skillsReliable and friendly with a client-focused mindsetAvailability during standard UK business hoursExperience in SEO, social media, or digital marketing tools is a plusRemote, full-time contract position with collaborative team interaction\nAbout TwineTwine is a leading marketplace connecting top freelancers, consultants, and contractors with companies needing creative and tech expertise.\nOur MissionTwine's mission is to empower creators and businesses to thrive in an AI-driven, freelance-first world.",
      "listed_at": "2025-08-21 09:24:20",
      "apply_url": "https://www.twine.net/projects/b8x390-fulltime-digital-marketing-support-client-communication-elementor-google-ads-support-digital-marketer-remote-job",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQGajpzch4nieg/company-logo_400_400/B4DZjSTz3wGgAg-/0/1755875065952/twineis_logo?e=1759363200&v=beta&t=1erS3YsG6f-3iJ3c2puIwbWprjzSspsrFZ5cXRXACnU",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Contract"
    }
  ]
}