{
  "search_info": {
    "keywords": "product manager",
    "location": "Paris",
    "limit_requested": 2,
    "jobs_found": 2,
    "search_timestamp": "2025-08-27T22:01:22.354146",
    "data_coverage": "Clean structure - Human readable fields",
    "export_version": "clean_v5.0",
    "search_filters": {
      "experience_levels": {
        "codes": null,
        "description": null
      },
      "job_types": {
        "codes": [
          "F"
        ],
        "description": [
          "Full-time"
        ]
      },
      "remote_work": {
        "codes": null,
        "description": null
      },
      "time_posted": {
        "seconds": 604800,
        "description": "Last week"
      },
      "distance_miles": null
    }
  },
  "jobs": [
    {
      "id": "4284167943",
      "job_posting_id": 4284167943,
      "title": "SEO Consultant - [Opening soon]",
      "company": "Botify",
      "company_name": "Botify",
      "company_url": "https://www.linkedin.com/company/botify",
      "location": "Paris, Île-de-France, France",
      "description": "Botify’s leading agentic AI search technology and seasoned experts ensure every brand has the power to be found, both in traditional and AI search. With one powerful platform, brands achieve visibility, relevance, and greater control across Google, Bing, ChatGPT, Perplexity, and more.\n\nBotify’s technology powers agentic workflows, AI-driven recommendations, and automated cross-platform indexation and deployment. Brands maximize visibility wherever consumers, bots, and AI agents search, protecting and capturing revenue across all search platforms.\n\nTrusted by 500+ leading brands including Macy’s, Levi’s, Farfetch, the New York Times, and Marks & Spencer, Botify drives digital discovery, sustained profitability, productivity, and brand authority in an AI-first world.\n\nIndustry research shows that women and those in traditionally underrepresented groups generally don't apply to jobs unless they check all the boxes for the role. If you feel strongly that you have what it takes for this role but don't check 100% of the boxes - that's okay - we encourage you to apply anyway and highlight what you can bring to the table!\n\nRole Overview\n\nAt Botify, we’re redefining SEO consulting by combining cutting-edge technology, a culture of innovation, and the brightest minds in the industry. As an SEO Consultant, you will play a pivotal role in solving our customers’ most complex SEO challenges while delivering measurable business outcomes. You’ll work hand-in-hand with industry-leading brands and collaborate with a world-class consulting team that’s passionate about pushing boundaries.\n\nYou Are...\n\nWe’re Looking For Someone Whose Passion For SEO Runs Deep. You Thrive In Complexity And Love Breaking Down Challenges Into Actionable Solutions. Specifically, You Are\n\nA Technical Problem Solver: You get excited about diagnosing crawl issues, debugging JavaScript SEO problems, or creating innovative solutions to complex site architectures.Proactive: You take initiative to find answers—you're always a step ahead, researching, analyzing, and proposing solutions.Collaborative: You know how to bring people together, from developers to marketing teams, to get things done and drive results.Customer-Obsessed: You genuinely care about your clients' success and go above and beyond to make them win.Curious and Geeky: You get excited about the latest SEO trends, emerging technologies, and industry innovations.\n\nWe Are...\n\nWe are growing our consulting team of SEO leaders that work with some of the world’s largest and most influential brands to solve their most challenging SEO problems.\n\nHands-On Problem Solvers: We work directly with customers, applying our unique technology and expertise to deliver solutions tailored to their needs.Innovators: We embrace challenges, love to experiment, and define new standards in SEO consulting.A Team of Experts: Our team includes some of the brightest minds in SEO, and we thrive on collaboration and knowledge-sharing.At the Cutting Edge: Botify technology leads the industry in harnessing AI and automation to drive SEO performance, and we are at the forefront of innovation in this space.\n\nYour Responsibilities\n\nAs an SEO Consultant at Botify, you’ll manage a portfolio of long-term client engagements and occasional project-based consulting engagements. You will:\n\nBuild and maintain strong client relationships, serving as the primary point of contact.Lead ongoing meetings with clients to review progress, troubleshoot challenges, and present strategic recommendations.Develop and execute SEO roadmaps that align with client goals and ensure consistent progress.Conduct in-depth technical SEO audits, identifying issues and proposing solutions to improve site performance.Write and manage SEO tickets for client teams, ensuring clear and actionable implementation steps.Manage SEO aspects of complex site migrations communicating with various stakeholders including teams within the customers’ organization, agencies, e-commerce vendors, and other specialist third parties.Support customers in interpreting data and deriving insights; guide them on the design of custom reporting solutions to be developed in collaboration with the Professional Services team.Assist clients with technical implementations, providing QA and guidance on staging environments to ensure accuracy.Leverage Botify’s PageWorkers product to craft and implement optimizations directly on client sites.Drive engagements forward by proactively identifying opportunities and spearheading initiatives to solve clients' most pressing SEO problems.\n\nYour Qualifications\n\nTo succeed in this role, you should have:\n\n7+ years of professional SEO experience, including a focus on technical SEO.3+ years of client-facing experience, managing long-term engagements and working with cross-functional teams.Proven ability to conduct technical SEO audits and deliver actionable strategies.Experience QAing SEO implementations in staging environments and live sites.Expertise in designing and implementing technical SEO solutions, including site migrations, site architecture, and structured data.Hands-on experience optimizing content within CMS platforms or guiding teams to do so.Familiarity with leveraging AI platforms to streamline workflows and improve efficiency.Exceptional communication skills, with the ability to distill complex technical concepts into simple, actionable recommendations for both technical and non-technical audiences.A team-oriented mindset and a passion for solving the biggest challenges in SEO.\n\nWhy Botify?\n\nWhen you join Botify, you’re joining the brightest SEOs in the business, working with some of the biggest companies in the world to solve the most challenging problems in the industry.\n\nOur Technology: One-of-a-kind, AI-driven, and continually innovating to lead the SEO industry.Our Culture: Collaborative, supportive, and dynamic, with a focus on continuous learning and growth.Our Impact: We don’t just optimize for rankings; we create measurable business outcomes that transform the way companies approach SEO.\n\nIf you’re ready to redefine what’s possible in SEO and thrive in a team of experts who love what they do, we’d love to hear from you.\n\nHiring Process\n\n30 minutes with the Talent Acquisition team45 minutes with our Head of Consulting Services45 minutes with a member of our Consulting Services team1-hour presentation with the SVP of Global Services and the Consulting Services team\n\nWhat We Offer\n\nTo keep our employees happy and motivated, we are always assessing the benefits/perks we offer to ensure we are competitive. Here are some we’d like to highlight:\n\nLocation: brand new offices in the center of Paris (12 rue d’Amsterdam, straight out of Gare Saint-Lazare)Hybrid remote policyAttractive Remuneration Package with BSPCE (for Permanent full-time role - CDI)Fun office culture & regular outings such as Team Off-Sites, Annual Kick-Off, Quaterly Team Lunch, Thirsty Thursdays etc. Lunch vouchers, 50% of transportation reimbursement, fitness classes, generous CSE advantages etc. Compelling growth perspectives \n\nStart date: as soon as possible\n\nIn addition to the skills and experience we are looking for, our ideal candidate would embody our core values:\n\nEmpower Customers. Unleash Potential.\n\nLearn Fast. Progress Faster.\n\nGo the Extra Mile. It’s Never Crowded.\n\nWork Hard. Stay Humble.\n\nBe Bold. Be You.\n\nBotify is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nWe're eager to add talent to our growing team, across departments and around the globe. Scout our open roles for your next opportunity.",
      "listed_at": "2025-08-27 09:47:40",
      "apply_method": {
        "com.linkedin.voyager.jobs.OffsiteApply": {
          "applyStartersPreferenceVoid": false,
          "companyApplyUrl": "https://jobs.botify.com/jobs/194465-seo-consultant-opening-soon?utm_source=LinkedIn",
          "inPageOffsiteApply": false
        }
      },
      "workplace_types_resolution_results": {
        "urn:li:fs_workplaceType:3": {
          "localizedName": "Hybrid",
          "$recipeType": "com.linkedin.voyager.deco.jobs.shared.WebJobDetailsWorkplaceType"
        }
      },
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEdgcgb0JGpyg/company-logo_400_400/company-logo_400_400/0/1708444052195/botify_logo?e=1759363200&v=beta&t=Asl997hzpSX3wOAVvWvGhG7luAZ6Sdj9UnL4DYTJ5oI",
      "job_state": "LISTED",
      "work_remote_allowed": false
    },
    {
      "id": "4232925240",
      "job_posting_id": 4232925240,
      "title": "Head of Gaming - Blitz",
      "company": "Voodoo",
      "company_name": "Voodoo",
      "company_url": "https://www.linkedin.com/company/voodoo.io",
      "location": "Paris, Île-de-France, France",
      "description": "About Voodoo\n\nFounded in 2013, Voodoo is a tech company that creates mobile games and apps with a mission to entertain the world. Gathering 800 employees, 7 billion downloads, and over 200 million active users, Voodoo is the #3 mobile publisher worldwide in terms of downloads after Google and Meta. Our portfolio includes chart-topping games like Mob Control and Block Jam, alongside popular apps such as BeReal and Wizz.\n\nTeam\n\nBlitz is a gaming platform launched in 2021, allowing players to compete in mobile games for real cash prizes (head-up, tournaments, leagues, etc.). It is leveraging a unique game portfolio as well as exclusive games crafted for Blitz to engage users in a fun and rewarding way.\n\nWe are looking for a talented Head of Gaming, deeply passionate about gameplay, level design, perfect visual pixel execution and top-notch look and feel, who will play a key role in the development of Blitz, our real-money gaming platform.\n\nRole\n\nDefine a clear and cohesive gaming roadmapDeconstruct and analyze mobile games mechanics, understand what makes a game a success in Real Money GamingPitch and implement big features and new games with the teamWork with the team on designing and balancing our games and mapsAlways back up your ideas with available data points and/or user feedbacksBe responsible for excellence in execution and look & feelWork on a portfolio of over 20 different gameplaysManage a team of 7 (Game Artist, Game Designer, Game developers)\n\nProfile\n\n6+ years of experience as Game Designer / Level Designer in casual mobile gamesExperience in team managementGood sense of gameplay experience, and special attention to detailsDeep collaboration mindset, including excellent interpersonal skills, and a positive mindset towards receiving, acting on, and giving feedbackAccountability, independence, and responsibility when given ownership over your workCommunication skills in English, both written and verbal\n\nNice To Have\n\nExperience in designing and balancing puzzle, match3, merge gamesProficiency in Unity a huge plusFamiliarity with Figma or similar visual collaboration software\n\nBenefits\n\nCompetitive salary upon experienceSwile Lunch voucherGymlib (100% borne by Voodoo)Premium healthcare coverage SideCare, for your family 100% borne by VoodooWellness activities in our Paris officeRemote days on Fridays",
      "listed_at": "2025-08-24 12:28:03",
      "apply_method": {
        "com.linkedin.voyager.jobs.OffsiteApply": {
          "applyStartersPreferenceVoid": false,
          "companyApplyUrl": "https://jobs.ashbyhq.com/voodoo/6c6790ca-a938-434d-a758-231303713006/application?utm_source=LinkedInAutomatedJobPosted",
          "inPageOffsiteApply": false
        }
      },
      "workplace_types_resolution_results": {
        "urn:li:fs_workplaceType:2": {
          "localizedName": "Remote",
          "$recipeType": "com.linkedin.voyager.deco.jobs.shared.WebJobDetailsWorkplaceType"
        }
      },
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFoMhQ5tM4TLA/company-logo_400_400/company-logo_400_400/0/1693903701647/voodooio_logo?e=1759363200&v=beta&t=liobSfvB_S1AByoOArKRrx9LTcVB1kxcw3lI2LRAN-0",
      "job_state": "LISTED",
      "work_remote_allowed": true
    }
  ]
}