{
  "search_info": {
    "keywords": "SEA project manager",
    "location": "Marseille",
    "limit_requested": 5,
    "jobs_found": 5,
    "search_timestamp": "2025-08-27T22:29:32.384496",
    "data_coverage": "Minimal - No duplicate fields",
    "export_version": "minimal_v7.0",
    "search_filters": {
      "experience_levels": {
        "codes": null,
        "description": null
      },
      "job_types": {
        "codes": null,
        "description": null
      },
      "remote_work": {
        "codes": null,
        "description": null
      },
      "time_posted": {
        "seconds": 604800,
        "description": "Last week"
      },
      "distance_miles": null
    }
  },
  "jobs": [
    {
      "id": "4289799297",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289799297/",
      "title": "Growth Marketer",
      "company": "TaskHuman",
      "company_url": "https://www.linkedin.com/company/taskhuman",
      "location": "EMEA",
      "description": "The Company\nTaskHuman is organizing the world’s human expertise, making coaching in 1000+ skills instantly accessible to you in a multitude of forms. Whether you connect live with a specialist on a 1:1 video call, message directly in-app, join a group session, or learn via coach-generated content, our value of human connection is the foundation of every interaction at TaskHuman.\nThe Opportunity\nWe’re looking for a hands-on, technically fluent Growth Marketer to drive rapid experimentation and growth loop execution to scale our acquisition and engagement programs. You will be instrumental in executing our growth strategy launching high-impact growth initiatives with speed and autonomy.This is a role for someone who loves to ship, test, and refine. In our B2B2C environment, your user activation and engagement work directly drives client success, making every conversion and retention win doubly important.\nResponsibilities:\nDesign, implement, and optimize lifecycle-based growth programs across user onboarding, activation, re-engagement, and retention.Launch and scale growth loops and automated campaigns, using event-based triggers and conditional logic.Own the execution and iteration of experiment-driven campaigns, partnering with Product, Analytics and Data Science to rapidly test hypotheses and analyze funnel performance.Partner closely with BI/Analytics team to define success metrics, interpret campaign performance data, and translate insights into actionable optimizations for future campaigns.Operate and manage the marketing tech stack including Iterable, to support fast, self-serve execution across journeys and nudges.Collaborate with engineering and data teams to integrate rich custom event payloads into user workflows, enabling highly personalized, metadata-driven messaging experiences.Maintain execution velocity by owning backlog delivery of growth marketing experiments, ensuring rapid test cycles and continuous campaign optimization.Partner with internal teams including Product, Design, Customer Success, and Coaching Experiences to ensure aligned messaging, go-to-market enablement, and thematic consistency across touchpoints.Guide the structure and QA of AI-generated content for use in dynamic emails and in-product experiences.\nRequirements:\n3-6+ years experience in growth marketing, lifecycle marketing, or CRM/automation roles, preferably in a startup or fast-paced growth environment.Strong technical fluency with tools and systems like Iterable (or Braze), and event-driven trigger frameworks.Deep experience executing event-based lifecycle automations using custom user properties, branching logic, and dynamic content blocks.Familiarity with working inside JSON-based data structures for dynamic & personalized messaging.Track record of executing growth experiments and interpreting performance through funnel, cohort, and lifecycle metrics.Highly autonomous and self-directed, able to move quickly and make tradeoffs in ambiguous or fast-changing environments.Strong communicator and collaborator across technical and non-technical teams.Experience and appetite for working in a fast-paced technology and innovation environment are highly preferred.Genuine interest in the mission of TaskHuman and being a part of something bigger than any one person or business group.Experience operating in a B2C, B2B2C, or marketplace product environment\nTaskHuman provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n",
      "listed_at": "2025-08-22 14:46:05",
      "apply_url": "https://job-boards.greenhouse.io/taskhumancorporate/jobs/4600552005",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQECcW3LiUdUdg/company-logo_400_400/company-logo_400_400/0/1634144680939/taskhuman_logo?e=1759363200&v=beta&t=_LoDTplQlyW6kt5KDbiimfLnp7mvWiob3F3EoSheEBc",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    },
    {
      "id": "4280098582",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4280098582/",
      "title": "Sr. Product Marketing Manager, Earn",
      "company": "Kraken",
      "company_url": "https://www.linkedin.com/company/krakenfx",
      "location": "European Union",
      "description": "Building the Future of Crypto \n\nOur Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology.\n\nWhat makes us different?\n\nKraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that everyone can achieve financial freedom and inclusion. For over a decade, Kraken’s focus on our mission and crypto ethos has attracted many of the most talented crypto experts in the world.\n\nBefore you apply, please read the Kraken Culture page to learn more about our internal culture, values, and mission. We also expect candidates to familiarize themselves with the Kraken app. Learn how to create a Kraken account here.\n\nAs a fully remote company, we have Krakenites in 70+ countries who speak over 50 languages. Krakenites are industry pioneers who develop premium crypto products for experienced traders, institutions, and newcomers to the space. Kraken is committed to industry-leading security, crypto education, and world-class client support through our products like Kraken Pro, Desktop, Wallet, and Kraken Futures.\n\nBecome a Krakenite and build the future of crypto!\n\nProof of work\n\nThe team\n\nThis is a senior-level position helping to lead and execute the product marketing strategy for Kraken’s Earn offerings. This is inclusive of driving and executing high-impact campaigns and strategies that drive overall growth: top-of-funnel awareness, adoption, and retention. As a key member of the Consumer Product Marketing team, you will also influence product development by leveraging customer insights, market data, and competitive analysis to shape Kraken’s consumer marketing strategies.\n\nThe opportunity\n\nGTM Strategy & Execution: Develop and lead Kraken’s Earn growth marketing strategy, driving awareness, acquisition, and retention for core trading products.Campaign Leadership: Own the full end-to-end campaign management process, from strategic planning to execution, across various channels (email, social, influencer, display, ATL).Consumer Lifecycle Marketing: Understand and optimize the customer journey, deploying engagement strategies that maximize LTV and retention.Product Positioning & Messaging: Translate complex financial products into compelling, easy-to-understand value propositions that resonate with diverse audiences.Cross-Functional Collaboration: Work closely with product managers, growth teams, design, analytics, and executive leadership to align marketing efforts with business objectives.Performance Measurement: Define, track, and report on key product KPIs, including awareness, feature adoption (nMTU), and retention/LTV improvements.Thought Leadership: Serve as the voice of the customer, championing insights to inform product roadmaps and marketing initiatives.\n\nSkills You Should HODL\n\n6+ years of experience in Product Marketing Management (PMM), preferably in fintech, trading (crypto, equities, commodities, FX) or high-growth B2C tech.Strong crypto expertise and passion, with a deep understanding of Earn market trends, onchain protocols, user behavior, and the evolving regulatory landscape.Proven ability to drive growth strategies from end-to-end, for multi-matrixed products across different phases of the product lifecycle.A data-driven marketer, leveraging insights to optimize campaigns and improve performance.Creative storyteller, able to craft compelling narratives that differentiate Kraken in a competitive market.Experience leading cross-functional teams and working within complex, fast-paced environments.Strong communication and stakeholder management skills, with the ability to secure buy-in at all levels.Entrepreneurial mindset, comfortable operating in a high-growth, dynamic setting.\n\nThis job is accepting ongoing applications and there is no application deadline.\n\nPlease note, applicants are permitted to redact or remove information on their resume that identifies age, date of birth, or dates of attendance at or graduation from an educational institution.\n\nWe consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nKraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don't fully meet the listed requirements, especially if you're passionate or knowledgable about crypto!\n\nAs an equal opportunity employer, we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws.\n\nStay in the know\n\nFollow us on Twitter\n\nLearn on the Kraken Blog\n\nConnect on LinkedIn\n\nCandidate Privacy Notice\n\nCompensation Range: $110K - $176K\n\n",
      "listed_at": "2025-08-27 12:59:05",
      "apply_url": "https://jobs.ashbyhq.com/kraken.com/c83db420-19c8-4004-a3a2-53cae116538b/application?utm_source=LinkedIn",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFm8yg0gGJN1A/company-logo_400_400/company-logo_400_400/0/1697458897774/krakenfx_logo?e=1759363200&v=beta&t=3lrxfze7GR_P0r_n2ko0GXlakM7AL6L53kDjIXxIDKw",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    },
    {
      "id": "4288869023",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288869023/",
      "title": "Marketing Director",
      "company": "GraphAware",
      "company_url": "https://www.linkedin.com/company/graphaware",
      "location": "European Union",
      "description": "Job Location: Open to candidates from anywhere in the EU or the UKFlexibility: Option to work remotely\nWhy apply?Marketing at GraphAware is about more than promoting an innovative software product. It is an opportunity to help reshape how intelligence analysts accomplish their mission in an increasingly connected world. Our goal is to lead a shift in thinking across the intelligence community towards graph-centric analysis as a foundation for better decisions.\nAs Marketing Director, you will play a central role in advancing this vision. You will lead global marketing with a primary focus on \"Five Eyes\", EU, and NATO countries. Your work will help government agencies understand the value of our technology, as well as the importance of adopting a new approach to analysis based on relationships, context, and connected data.\nYou’ll be joining a focused, driven team where ideas move quickly and impact is visible. There’s real room to shape the work, take ownership, and grow in a way that’s meaningful to you.\nYour MissionAs Marketing Director, you will shape the core marketing strategy of GraphAware and GraphAware Hume, our connected data analytics platform.\nKey ResponsibilitiesMarketing strategy: Understand the company’s strategy. Design the marketing strategy and plan. Execute it effectively, and translate it into clear team focus and priorities.Brand building and awareness: Build a brand that aligns with our long-term goals through strong strategy, planning, and execution. Act as a guardian of consistent messaging and representation of who we are across all channels. Maintain a strong public profile that reassures the market we are the right partner.Content and thought leadership: Develop clear, high-quality content that speaks directly to our audience and reflects a deep understanding of their challenges. Position the company as a credible voice in our field - insightful, practical, and worth listening to.Lead Generation: Set up the funnel and the overall measurement and evaluation system, including key metrics. Drive inbound lead generation by creating and promoting high-quality content. Assess the role outbound should play in our go-to-market approach.Sales support and partner management: Support the sales team by developing high-quality assets that communicate our value and align with our branding. Define and implement a practical approach to equip partners with the right messaging, tools, and materials to help them sell effectively.Events and webinars: Own and maintain a strong, up-to-date events and webinars calendar that supports our goals. Ensure every event is well-organized, high-quality, and delivers clear value to our audience.Team leadership: Provide clear focus and priorities for the team, grow its capabilities, and establish marketing as a strong, strategic function within the company.\nProfile We Have in MindYou combine strong communication, structured thinking and a hands-on mindset, with the ability to align strategic vision and day-to-day execution.10–15 years of marketing experience, with at least 5–8 years leading full marketing efforts in a B2B software or SaaS companyA stable track record, including at least one or two roles held for 4+ yearsExperience in fast-growing software businesses with international reachExperience with complex, high-value solutions sold to enterprise or public sector clientsSkilled at building and leading a small marketing team with global focusProven brand builder with strong content strategy and thought leadership focus, including developing strategic, high-quality assets to support sales and partner teamsStrong grasp of lead generation, marketing funnels and performance metricsFluent English, spoken and written, at a near-native levelBonus: experience in intelligence technology or public sector software and long sales cycles\nWhat We OfferUnique opportunity: Join us on our journey to fundamentally change the way intelligence analysis is conducted and to empower democratic government agenciesDriven and motivating environment: Striving for excellence is who we are but we’ve always got each other’s back. Work in an environment that motivates and supports youSelf-realisation and autonomy: Thrive in an environment where autonomy is balanced with accountability. If something isn’t working, we take actionCompetitive compensation: Enjoy a competitive compensation package with a variable component and regular reviewsEquity participation: Share in the company's success through our share scheme program\nGraphAware’s core valuesSense of OwnershipStrive for ExcellenceDriven by Customer SuccessBelief in the Value of GraphsI Got Your Back!\nReady to make an impact? Join GraphAware and be part of something truly transformative. Apply now and help shape the future of graph analytics!",
      "listed_at": "2025-08-26 09:31:13",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGVzqtGVuCg6A/company-logo_400_400/company-logo_400_400/0/1727784290395/graphaware_logo?e=1759363200&v=beta&t=EW643YeU_1AAVzOz3waT-3urdny9IzLRdTZoLpkrjOQ",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    },
    {
      "id": "4289731259",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4289731259/",
      "title": "Chinese Content Manager",
      "company": "Dida",
      "company_url": "https://www.linkedin.com/company/didatravel",
      "location": "European Union",
      "description": "As the Content Manager, you will be responsible for creating, adapting, and localizing high-quality written content in Simplified Chinese as well as English, supporting both internal and external communications across various channels. You will play a key role in making sure our English and Chinese language content is clear, professional, aligned with our brand voice, and resonates with a B2B travel audience. This is a hands-on role for a detail-oriented, bilingual communicator who is passionate about content, translation, and the travel industry.\nKey ResponsibilitiesContent Creation & Editing:Write original, English and Chinese-language content for a range of formats including:Email notificationsNewslettersPress releasesNews articlesInternal communicationsWeb copy, sales collateral, and moreTailor messaging for different audiences within the travel trade sector.\nTranslation & Localization:Translate English-language content into Simplified Chinese (and vice versa) with high accuracy and sensitivity to B2B travel terminology.Ensure consistency of tone, style, and messaging across all communications.\nContent Management:Collaborate with cross-functional teams (Marketing, Sales, Product, Customer Success) to gather insights and develop impactful content.Maintain a localized content calendar aligned with Dida’s global marketing plans.\nQuality Control:Proofread and edit content to ensure linguistic, grammatical, and cultural accuracy.Provide guidance across the business regarding English and Chinese content.\nRequirementsNative or near-native fluency in Simplified Chinese and English, both written and spoken.3+ years of experience in content writing, translation, or content marketing—ideally within the B2B travel trade or travel technology sector.Excellent writing and editing skills with a sharp eye for detail.Proven ability to understand and convey complex travel industry terminology and concepts.Strong project management skills; able to manage multiple deadlines and priorities.Proficiency with content management systems (e.g., WordPress), email platforms (e.g., Mailchimp, HubSpot), and productivity tools (e.g., Google Workspace, Microsoft Office).Experience collaborating with international teams and adapting global content for local audiences.",
      "listed_at": "2025-08-22 06:23:01",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQFYWsHr9RH8IQ/company-logo_400_400/B4DZVcP.sVG8AY-/0/1741009448608/didatravel_logo?e=1759363200&v=beta&t=N9x02tkziGWvBI_AXXcSWr3XaOkple-KCCUy8q3JwGs",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    },
    {
      "id": "4256688468",
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4256688468/",
      "title": "GTM Content Marketing Manager",
      "company": "ZenRows",
      "company_url": "https://www.linkedin.com/company/zenrows",
      "location": "EMEA",
      "description": "GTM Content Marketing Manager (100% Remote)\nAbout ZenRows: Born in the vibrant heart of the Basque Country in Bilbao, ZenRows is one of Europe's fastest-growing startups. Founded in 2021, we are dedicated to revolutionizing data workflows with our cutting-edge web data extraction platform, used globally across industries like e-commerce, real estate, finance, and AI. Our mission is to empower businesses with seamless, scalable data solutions to drive automation, analytics, and AI-driven insights. ZenRows champions a fully remote work environment, committed to attracting top-tier talent regardless of location.\nThe Role: We are seeking a dynamic GTM Content Marketing Manager to develop and implement innovative strategies that will significantly increase users, enhance prospect engagement, and drive rapid business growth. This role is pivotal in discovering new channels, running experiments, and driving revenue through data-driven innovation and cross-functional collaboration.\nKey Responsibilities:Experimentation and Optimization: Lead rapid testing cycles to determine the most effective growth tactics, focusing on increasing TOFU conversion and converting visitors to paid customers.User Acquisition and Retention: Develop and execute comprehensive strategies to dramatically grow and retain users by leveraging a mix of emerging marketing methods, scaled digital marketing techniques, integrations, partnerships, and network effects.Market Research and Consumer Insights: Understanding market trends, customer needs, and competitor strategies. Leverage surveys, user interviews, and competitive analysis to inform campaign and growth strategies.Cross-functional Collaboration: Collaborate with marketing, product, and sales teams to align and execute growth initiatives that enhance the PLG customer journey.Analytics and Data: Utilize analytics tools to monitor, analyze, and leverage data to quickly make informed decisions that propel user and revenue growth.\nWhat You’ll Bring:Proven Track Record of Scalable Growth Achievements: A portfolio of successful growth initiatives that have impacted user acquisition, retention, and revenue.Deep Understanding of PLG Metrics and Analytics: Expertise in analyzing key PLG metrics using tools like Amplitude and Google Analytics.Experience with Growth Tools and Technologies: Proficient in utilizing a blend of traditional marketing automation platforms such as HubSpot, alongside innovative tools like Clay for automating workflows and n8n for creating custom automation workflows across various apps.Technical Proficiency: Ability to work closely with engineering teams, understanding APIs, basic coding, and managing data queries and automation tools.Creative Problem Solving and Experimentation: Demonstrated creativity in developing new strategies for growth and comfort with rapid experimentation cycles.Strong Communication and Collaboration Skills: Excellent ability to communicate ideas and collaborate effectively across all organizational levels.Adaptability and Resilience: Capability to handle rapid changes in a startup environment with a proactive and positive approach.Leadership and Ownership: Ready to take charge of growth projects from start to finish, inspiring teams and driving initiatives without direct authority.\nWhy You’ll Love Working Here:Remote Flexibility: Work from anywhere, focusing solely on impactful outcomes.Dynamic Growth Opportunities: Rapid career progression in a thriving startup environment.Impactful Work: Make a significant impact on our company’s growth and user experience.Supportive Environment: Join a team that values innovation, personal growth, and collaborative success.\nApply Now: Are you ready to drive growth and make a measurable impact at one of Europe’s most innovative startups? Visit our careers page to apply or learn more about this exciting opportunity.",
      "listed_at": "2025-08-25 09:04:03",
      "apply_url": "https://www.zenrows.com/careers/job?gh_jid=4598505101",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGUYJUCOXc5Yg/company-logo_400_400/company-logo_400_400/0/1719256057038/zenrows_logo?e=1759363200&v=beta&t=FpYhDLKM7QqxoWPzriL8tAjWHB9-7zm15bTF1gN0M40",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": ""
    }
  ]
}