{
  "search_info": {
    "keywords": "SEO",
    "location": "Los Angeles",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T16:32:38.492301",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289742438",
      "title": "SEO Director",
      "company": "Rocket Clicks",
      "location": "United States",
      "description": "About Rocket Clicks\n\nMission\n\nWe accelerate growth for innovative businesses through revenue-first marketing strategies.\n\nAccelerate Growth = pushing businesses, individuals, and entrepreneurs that want to grow faster\n\nInnovative Businesses = businesses, individuals, and entrepreneurs that want to lead in their industry\n\nRevenue-First Marketing Strategies = we measure success based on our ability to drive revenue and increase profitability\n\nVision\n\nLegacy & Impact\n\n1,000 Revenue Barriers Surpass...",
      "url": "https://www.linkedin.com/jobs/view/4289742438/",
      "custom_logo_url": ""
    },
    {
      "id": "4289855551",
      "title": "SEO Associate (Remote - US)",
      "company": "Jobgether",
      "location": "United States",
      "description": "This position is posted by Jobgether on behalf of Seer Interactive. We are currently looking for an SEO Associate in United States.\n\nAs an SEO Associate, you will play a key role in driving online visibility, increasing traffic, and enhancing ROI for client campaigns. You will combine creative thinking with data-driven analysis to uncover insights, optimize strategies, and implement SEO best practices across diverse client projects. Working closely with account teams, you will monitor performanc...",
      "url": "https://www.linkedin.com/jobs/view/4289855551/",
      "custom_logo_url": ""
    },
    {
      "id": "4290572974",
      "title": "Search Engine Optimization Manager",
      "company": "Intrepid Digital",
      "location": "United States",
      "description": "Why IntrepidWe’re a remote-first team trusted by category leaders like AWS, ClassPass, PitchBook, and Skyscanner. At Intrepid, you’ll do the best work of your career with people who care about craft, impact, and each other.\nWhat we offerFully remote work from anywhere with flexible hoursGenerous holiday allowanceAbove-market compensationIncredible clients and complex, meaningful problemsA high-caliber team that shares knowledge, ships, and wins together\nIn return, we look for people who go the e...",
      "url": "https://www.linkedin.com/jobs/view/4290572974/",
      "custom_logo_url": ""
    },
    {
      "id": "4290657012",
      "title": "Head of SEO & AI Search",
      "company": "Writesonic",
      "location": "United States",
      "description": "About WritesonicAI search is transforming how 1.5 Billion people discover products weekly. If ChatGPT doesn't recommend you—or worse, recommends your competitor—you're invisible to these high-intent buyers.Writesonic is the only platform that shows you exactly how your brand performs in AI search results. Then take precise actions to boost visibility—create new content, refresh existing pages, or reach out to sites that mention competitors but not you.\nThe RoleWe're hiring a Head of SEO & AI Sea...",
      "url": "https://www.linkedin.com/jobs/view/4290657012/",
      "custom_logo_url": ""
    },
    {
      "id": "4280499055",
      "title": "Content Lead - SEO",
      "company": "Gametime",
      "location": "United States",
      "description": "About Us\n\nLive experiences help people cross today’s digital divide and focus on what truly connects us – the here, the now, this once-in-a-lifetime moment that’s bringing us together. To fulfill Gametime’s mission of uniting the world through shared experiences, we make it easy for people to discover and access the live experiences that matter most.\n\nWith platforms on iOS, Android, mobile web and desktop supporting more than 60,000 events across the US and Canada, we are reimagining the event t...",
      "url": "https://www.linkedin.com/jobs/view/4280499055/",
      "custom_logo_url": ""
    },
    {
      "id": "4288586986",
      "title": "SEO Analyst",
      "company": "RevenueWell",
      "location": "United States",
      "description": "Founded in 2010, we started RevenueWell because we saw a way to use the latest marketing automation technology to help dentists build better, more connected relationships with their patients and communities. We think it’s a problem worth solving, and thousands of dental practices across the country seem to agree. The company has grown very quickly over the last few years, and we’re now a team of about 200 diverse people that are committed to our mission, super-focused on our product, and fanatic...",
      "url": "https://www.linkedin.com/jobs/view/4288586986/",
      "custom_logo_url": ""
    },
    {
      "id": "4286323460",
      "title": "SEO & AI Search Specialist, APAC",
      "company": "Keeper Security, Inc.",
      "location": "United States",
      "description": "Keeper is hiring a talented SEO & AI Search Specialist to join the Keeper Marketing team. This is a 100% remote position from select locations with an opportunity to work a hybrid schedule for candidates based in the Chicago, IL metro area.\n\nKeeper's cybersecurity software is trusted by millions of people and thousands of organizations globally. Keeper is published in 21 languages and is sold in over 120 countries. Join one of the fastest-growing cybersecurity companies and play an integral role...",
      "url": "https://www.linkedin.com/jobs/view/4286323460/",
      "custom_logo_url": ""
    },
    {
      "id": "4289516157",
      "title": "B2B SEO Consultant",
      "company": "Crawford Group",
      "location": "United States",
      "description": "Crawford Group (www.crawfordgroup.com) is seeking a B2B SEO consultant for a high profile media company. In the role, one will be trusted to work with B2B SaaS websites to deliver strategic, technical, and content-driven improvements that drive qualified traffic, improve search visibility, and ultimately support lead generation and conversions.\nAbout Crawford Group.We are revolutionizing how marketing gets done! Crawford Group provides expert marketing, digital, creative, events, and communicati...",
      "url": "https://www.linkedin.com/jobs/view/4289516157/",
      "custom_logo_url": ""
    },
    {
      "id": "4289142364",
      "title": "SEO Strategist",
      "company": "Madden Media",
      "location": "United States",
      "description": "About Us\n\nAt Madden, we're not your typical marketing agency. We're a full-service destination marketing agency that blends tech-savvy know-how with creative flair to help destinations shine. Innovation? Check. Data-driven strategies? Double check. A passion for storytelling that brings destinations to life? Oh yeah, we've got that too.\n\nWe're constantly evolving to meet the needs of our tourism partners, driven by performance and aligned with their goals. With Madden's Agile approach, we flex a...",
      "url": "https://www.linkedin.com/jobs/view/4289142364/",
      "custom_logo_url": ""
    },
    {
      "id": "4290515390",
      "title": "SEO Manager",
      "company": "TieTalent",
      "location": "United States",
      "description": "About Us Outliant is a fully remote, US-based digital product development and startup consulting company,\n\nproudly acquired by Ignite Visibility\n\nWe specialize in bringing visionary ideas to life through intuitive, high-performing digital products. Our globally diverse team is made up of passionate creators, designers, and engineers who thrive on collaboration, innovation, and pushing boundaries. We believe in the power of blending work and play to foster personal growth, bold thinking, and crea...",
      "url": "https://www.linkedin.com/jobs/view/4290515390/",
      "custom_logo_url": ""
    }
  ]
}