{
  "search_info": {
    "keywords": "SEO",
    "location": "Amsterdam",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T16:34:41.408574",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289877307",
      "title": "100% Remote - Digital Marketing Specialist",
      "company": "Launching Point",
      "location": "European Union",
      "description": "We are seeking a Digital Marketing Specialist who can also support web-based projects to help expand our reach and patient engagement through effective digital strategies.\nThis is a 100% remote opportunity but seeking someone in the European area.\nThe Digital Marketing Specialist will plan, execute, and optimize digital marketing initiatives while supporting web-based projects to improve user experience and lead generation for our healthcare services. You will collaborate with internal teams to ...",
      "url": "https://www.linkedin.com/jobs/view/4289877307/",
      "custom_logo_url": ""
    },
    {
      "id": "4277925805",
      "title": "SEO MANAGER (US / DE MARKETS) (M/F/D)",
      "company": "Canyon Bicycles GmbH",
      "location": "Amsterdam, North Holland, Netherlands",
      "description": "We are a community open to everyone. One global team where everyone counts.\n\nJoin the Canyon team and work at the cutting edge of the bike industry, with a job as versatile and exciting as the bikes we develop. All in an open, international atmosphere where teamwork, collaboration, true innovation, and a dynamic workplace are all part of our everyday. Ready to ride with us?\n\nTHE ROLE\n\nAt Canyon Bicycles, we are driven by our passion for delivering world-class bikes directly to riders. To acceler...",
      "url": "https://www.linkedin.com/jobs/view/4277925805/",
      "custom_logo_url": ""
    },
    {
      "id": "4285889773",
      "title": "SEO Content Manager (iGaming)",
      "company": "Medier Agency",
      "location": "European Union",
      "description": "We are looking for an experienced SEO Content Manager to join our Marketing Team. The ideal candidate will have a strong background in the iGaming industry. This role involves managing the work with freelancers — ordering SEO content and proofreading it\nWhat You'll Do:Accept and process content orders, and distribute tasks to freelance writersTracking multiple deadlines and ensuring that all content is out on timeEnsure the final result meets the original Content brief requirements and delivers ...",
      "url": "https://www.linkedin.com/jobs/view/4285889773/",
      "custom_logo_url": ""
    },
    {
      "id": "4291074898",
      "title": "Freelance SEO Expert",
      "company": "Twine",
      "location": "European Economic Area",
      "description": "An SEO specialist is required to optimize a new website for a health and wellness provider in Austin, Texas. The website, currently in development and set to launch within the next month, needs to be search-engine ready from the outset. The focus will be on building a strong SEO foundation during the development phase, followed by ongoing optimization and strategy to grow online visibility and attract new clients. This is a remote position suited for a professional who can deliver both technical...",
      "url": "https://www.linkedin.com/jobs/view/4291074898/",
      "custom_logo_url": ""
    },
    {
      "id": "4288886117",
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US ",
      "company": "Call For Referral",
      "location": "European Union",
      "description": "Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects in collaboration with a leading AI lab. The role involves contributing to data campaigns across Creative Writing, Companionship, and Presentation domains. Successful candidates will apply judgment, critical thinking, and domain expertise to evaluate which responses are most effective, natural, and compelling.Ideal ProfilesCreative ...",
      "url": "https://www.linkedin.com/jobs/view/4288886117/",
      "custom_logo_url": ""
    },
    {
      "id": "4256688468",
      "title": "GTM Content Marketing Manager",
      "company": "ZenRows",
      "location": "EMEA",
      "description": "GTM Content Marketing Manager (100% Remote)\nAbout ZenRows: Born in the vibrant heart of the Basque Country in Bilbao, ZenRows is one of Europe's fastest-growing startups. Founded in 2021, we are dedicated to revolutionizing data workflows with our cutting-edge web data extraction platform, used globally across industries like e-commerce, real estate, finance, and AI. Our mission is to empower businesses with seamless, scalable data solutions to drive automation, analytics, and AI-driven insights...",
      "url": "https://www.linkedin.com/jobs/view/4256688468/",
      "custom_logo_url": ""
    },
    {
      "id": "4283448381",
      "title": "Marketing Director",
      "company": "Digital Silk - Growing Brands Online",
      "location": "Netherlands",
      "description": "We are first and foremost a great team full of ambitious and proactive individuals whose goal is to become the best professionals they can be and make Digital Silk a globally renowned digital agency. Our quest for excellence has resulted in our company’s growth and continuous need for outstanding team members.\nWe are seeking a hands-on Marketing Director to boost Digital Silk’s Brand Awareness & Lead Generation.\nWe are seeking a true Marketing Expert with proven hands-on expertise in:\nAnalyticsA...",
      "url": "https://www.linkedin.com/jobs/view/4283448381/",
      "custom_logo_url": ""
    },
    {
      "id": "4264131065",
      "title": "Head of SEO",
      "company": "DEPT®",
      "location": "Amsterdam, North Holland, Netherlands",
      "description": "This role is part of our Creative & Media team based in Rotterdam and Amsterdam. Our team is a vibrant mix of talents, ranging from Creatives, Influencer Marketers, Brand & Content Strategists to Account Managers, Programmatic and Marketing Automation Consultants. Together, we blend imaginative storytelling and performance-driven strategies with cutting-edge technology to create engaging digital experiences that build lasting relationships with our clients like Netflix, Canva, Foot Locker, Phili...",
      "url": "https://www.linkedin.com/jobs/view/4264131065/",
      "custom_logo_url": ""
    },
    {
      "id": "4288543270",
      "title": "(T) SEO Analyst",
      "company": "Foot Locker",
      "location": "Utrecht, Utrecht, Netherlands",
      "description": "Overview\n\nOur global house-of-brands inspires and empowers youth culture. Relentlessly committed to fuel a shared passion for self-expression, we create unrivalled experiences at the heart of the sport and sneaker communities through the power of our people. If you want to be a part of something bigger than you can imagine, you’ve come to the right place.\n\nAs An SEO Analyst You Will\n\nWork to advance the SEO performance on all EMEA Foot Locker Inc domains. Partner with the Media & Lifecycle team,...",
      "url": "https://www.linkedin.com/jobs/view/4288543270/",
      "custom_logo_url": ""
    },
    {
      "id": "4291074150",
      "title": "Content Writer – French Speaking (Remote) | iGaming Experience Required",
      "company": "Accelerate Finance & Legal Recruitment",
      "location": "EMEA",
      "description": "Content Writer – French Speaking (Fully Remote)\nExcellent Remuneration Package International Environment Career Growth and Development\nA fast-growing iGaming startup is looking for a talented French-speaking Content Writer to join its expanding team remotely. As a young and ambitious company, we offer a hands-on, collaborative environment where your ideas are heard, your creativity is valued, and your growth is a shared priority—no matter where you are based.\nThe ideal candidate is passionate ab...",
      "url": "https://www.linkedin.com/jobs/view/4291074150/",
      "custom_logo_url": ""
    }
  ]
}