{
  "search_info": {
    "keywords": "SEO",
    "location": "Los Angeles",
    "limit_requested": 3,
    "jobs_found": 3,
    "search_timestamp": "2025-08-27T22:18:08.750003",
    "data_coverage": "Streamlined - Direct access fields",
    "export_version": "streamlined_v6.0",
    "search_filters": {
      "experience_levels": {
        "codes": null,
        "description": null
      },
      "job_types": {
        "codes": [
          "F",
          "C"
        ],
        "description": [
          "Full-time",
          "Contract"
        ]
      },
      "remote_work": {
        "codes": null,
        "description": null
      },
      "time_posted": {
        "seconds": 604800,
        "description": "Last week"
      },
      "distance_miles": null
    }
  },
  "jobs": [
    {
      "id": "4280499055",
      "job_posting_id": 4280499055,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4280499055/",
      "title": "Content Lead - SEO",
      "company": "Gametime",
      "company_name": "Gametime",
      "company_url": "https://www.linkedin.com/company/gametime-united",
      "location": "United States",
      "description": "About Us\n\nLive experiences help people cross today’s digital divide and focus on what truly connects us – the here, the now, this once-in-a-lifetime moment that’s bringing us together. To fulfill Gametime’s mission of uniting the world through shared experiences, we make it easy for people to discover and access the live experiences that matter most.\n\nWith platforms on iOS, Android, mobile web and desktop supporting more than 60,000 events across the US and Canada, we are reimagining the event ticket industry in order to move at the speed of life.\n\nThe Role\n\nGametime is seeking a creative, data-driven Content Marketing Lead to drive meaningful audience engagement and business growth through strategic content development. This role sits at the intersection of marketing, product, and brand, ensuring content is not only insightful and compelling but also supports core company goals. From PR earned media mentions to SEO traffic to product feature adoption.\n\nThe ideal candidate blends editorial instinct with performance marketing know-how, capable of scaling evergreen content across channels and surfacing the right stories at the right moment in the user journey.\n\nKey Responsibilities\n\n50%: Content Development & Production\n\nDrive incremental SEO traffic and revenue by crafting evergreen, insightful content to live in Gametime’s PR and social, website and CRM channels.Monitor organic traffic performance and recommend insight-driven stories.Maintain a content calendar and communications between internal & external partners.\n\n30%: Guide Scalable Omni-channel Content Briefs\n\nDevelop content pieces aimed at driving product feature adoptionExpand engaging SEO content strategies (e.g., Fun things to do in Dallas) into social & CRM campaigns via omni-channel briefs\n\n20%: Support development of new web + app content marketing features\n\nGuide content module development with SEO and Product Management leadsIdentify new storytelling mediums across web/app and marketing channels\n\nKey Competencies\n\nTechnical Skills:\n\nContent Development: Strong writing and editorial skillset, adept at crafting content narratives that drive consumer engagement and conversion.Content Analysis & Insights: Ability to monitor and interpret organic traffic data, assess campaign engagement rates, and use insights to recommend content topics.\n\nSEO Tools: Experience utilizing SEO and LLM search tools like SEMrush, Profound, Google Trends, Google Ads Keyword Planner, and GA4 to develop and monitor content strategies is a plus.\n\nInterpersonal Skills\n\nEditorial Collaboration: Track record of success in developing multi-media content collaboratively with writers, designers, external agencies, and freelance contributors.Stakeholder Management: Keeping internal and external partners aligned through clear status updates, briefs, and performance insights.\n\nProblem-Solving And Decision-Making\n\nInsight-Driven Ideation: Using performance data to brainstorm new topics and formats that will resonate with audiences and hit KPIs.Experimentation & Iteration: Testing headlines, formats, and mediums (on and off site) to optimize performance and learn fast.\n\nMinimum Qualifications\n\nExperience: 3-5 years of Content or Web Marketing experienceCertifications: None requiredOther Requirements: n/a\n\nPreferred Qualifications\n\nEducation: Bachelors Degree in Marketing, Business, Visual Arts, English/Writing or similar field. Experience: Content marketing experience in consumer facing DTC businessesCertifications: Google Analytics 4, AI tooling and SEO-related certifications are a plus.\n\nPerformance Metrics\n\nIncrease SEO new user traffic +20% by developing new content programs that increase traffic & mentions from search and LLM engines, digital publishers and social media.Increase website engagement rates and frequency +15% by developing content modules that serve fan needs throughout the live event ticket journey.\n\nWhat We Can Offer\n\nFlexible PTOCompetitive salary & equity packageMonthly Gametime credits for any event ($1,200/yr)Medical, dental, & vision insuranceLife insurance and disability benefitsDiverse Family-forming benefits through Carrot Fertility401k, HSA, pre-tax savings programsCompany offsites and meet-upsWellness programsTenure recognition\n\nAt Gametime pay ranges are subject to change and assigned to a job based on specific market median of similar jobs according to 3rd party salary benchmark surveys. Individual pay within that range can vary for several reasons including skills/capabilities, experience, and available budget.\n\nUnited States - Pay Range\n\n$124,483 - $146,450 USD\n\nGametime is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, veteran status, sex, parental status, gender identity or expression, transgender status, sexual orientation, national origin, age, disability or genetic information. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our company.",
      "listed_at": "2025-08-27 13:50:43",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHjBfo4eupCvQ/company-logo_400_400/company-logo_400_400/0/1630595607268/gametime_united_logo?e=1759363200&v=beta&t=C3AN9f0-wir76pAPfzGzlnK-Po87bAN8EBSkjfPQfVs",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Full-time, Contract"
    },
    {
      "id": "4288586986",
      "job_posting_id": 4288586986,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4288586986/",
      "title": "SEO Analyst",
      "company": "RevenueWell",
      "company_name": "RevenueWell",
      "company_url": "https://www.linkedin.com/company/revenuewell",
      "location": "United States",
      "description": "Founded in 2010, we started RevenueWell because we saw a way to use the latest marketing automation technology to help dentists build better, more connected relationships with their patients and communities. We think it’s a problem worth solving, and thousands of dental practices across the country seem to agree. The company has grown very quickly over the last few years, and we’re now a team of about 200 diverse people that are committed to our mission, super-focused on our product, and fanatical about helping our customers succeed.\nIn December 2019, we partnered with Marlin Equity Partners to help us aggressively expand our vision in healthcare. Since then, we have more than doubled our footprint (through strong organic growth and acquisition of PBHS) to over 12,000 customers, and we are just getting started! If you are excited about healthcare, working with talented people, aren’t afraid to roll up your sleeves, and want to help build a healthcare technology company that makes a real difference for providers and patients – this opportunity might just be for you.\nWHY WE’RE LOOKING:We are looking to add an SEO Analyst to our Digital Marketing Team. The SEO Analyst is responsible for optimizing the online presence and visibility of our SaaS company through strategic search engine optimization techniques. This role involves working closely with the marketing team to develop and execute SEO strategies, conduct keyword research, and analyze website performance data. The SEO Analyst will also be involved in content optimization, link building, and staying up to date with industry trends and best practices.\nIn this role, you will spend your day-to-day completing work orders to drive up traffic and improve rankings. You are technically curious, easily grasp marketing and technical concepts, and are highly interested in the SEO landscape. You’re obsessed with providing excellent customer service; have a knack for process and are pragmatic in the way you approach your work; have strong technical aptitude; and you’re a proactive communicator.\nWHAT YOU’LL DO:Updating client websites with new content or simple changes and optimizing the site.Utilizing Screaming Frog to find and fix broken links.Performing site speed checks.Performing site visibility check (including mobile visibility).Submitting sitemaps.Performing website audits.Assist with monthly reporting.Implement meta data best practices.Assist in driving organic traffic to client’s site and increasing new patient acquisition.Utilize Google Analytics.Communicate with the clients over the phone or via email.Develop and implement effective SEO strategies.Conduct keyword research to identify relevant search terms and phrases.Optimize website content, including meta tags, headings, and URLs, to improve organic search rankings.Collaborate with the marketing team to define target audience and develop SEO strategies aligned with business objectives.Analyze website performance and recommend improvements.Monitor and analyze website traffic, rankings, and user engagement using tools such as Google Analytics and SEO software.Identify areas for improvement and provide recommendations to enhance website performance and visibility.Stay up to date with SEO trends, algorithm updates, and industry best practices.Optimize website content, blog articles, and landing pages for SEO.Conduct competitive analysis to identify link building opportunities.Develop and execute link building strategies to improve website authority and search rankings.Collaborate with content creators to ensure SEO best practices are followed.Work closely with the marketing team to align SEO efforts with overall marketing strategies.Collaborate with web developers to implement on-page SEO recommendations.Coordinate with content creators to ensure SEO optimization in new content creation.Collaborate with the social media team to promote content and engage with online communities.Keep up to date with SEO industry trends, algorithm updates, and best practices.Conduct research on competitors' SEO strategies and identify opportunities for improvement.Share insights and recommendations with the team to enhance overall SEO performance.\nWHAT WE’RE LOOKING FOR:Associate’s or Bachelor’s degree in Marketing, Business, or another related field is highly preferred but not required.1-4+ years of experience in digital marketing and SEO.Familiarity with SEO concepts, content strategy, website design U/I, and Google Analytics.Google Analytics and AdWords Certification is a plus.Excellent communicator (verbally and in writing) and have interpersonal skills that foster trust with co-workers and clients.Have the interest in and ability to learn Google Analytics and how to measure the effectiveness of strategy (rankings, traffic, conversions) and make decisions based on data.Are Committed to learning and understanding SEO trends and best practices.Have a strong commitment to honesty/ethics, punctuality, attendance, client success, innovation, teamwork, and professionalism.Have solid conflict resolution skills with the ability to diffuse high intensity situations while remaining calm, professional, and respectful.Are extremely organized and consistently able to meet deadlines.Have working knowledge of content management systems (CMS) and HTML, CSS and WordPress.Are savvy with Microsoft Office.\nWHAT’S IN IT FOR YOU:Competitive Compensation: This position offers a base salary and bonus. Employees who demonstrate successful goal attainment and commitment will have the opportunity for career growth and advancement in the organization.Entrepreneurial Culture: You manage your business. We strongly encourage our Employees to leverage their skill sets and creativity to provide the best service and solutions to our current clients.Work/Life Balance: A super laid-back environment where hustle goes a long way and work is enjoyable. A true Work Hard Play Hard mentality. We believe in working hard, for our clients every day while ensuring satisfaction in your role and ample time to enjoy activities outside of work. Along with having remote flexibility.YOU Make the Difference: You’ll spend your days building and maintaining relationships with new and existing customers. You will be consulting with health professionals to help them be more profitable, to be more present for their patients, and to make office life easier!Great Benefits: Several comprehensive benefit offerings to choose from and a no-wait 401k plan with company match.\nRevenueWell is an Equal Opportunity Employer of minorities, females, protected veterans, and individuals with disabilities. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.\nNo search firm solicitations, please.",
      "listed_at": "2025-08-25 18:57:57",
      "apply_url": "",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFZNaT2uzsAmw/company-logo_400_400/company-logo_400_400/0/1681840663929/revenuewell_logo?e=1759363200&v=beta&t=952yZUpePu1ongHjEbgQB1nBjY-e7rxnGOYhdDuheGc",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Full-time, Contract"
    },
    {
      "id": "4290657012",
      "job_posting_id": 4290657012,
      "linkedin_postJob_url": "https://www.linkedin.com/jobs/view/4290657012/",
      "title": "Head of SEO & AI Search",
      "company": "Writesonic",
      "company_name": "Writesonic",
      "company_url": "https://www.linkedin.com/company/writesonic",
      "location": "United States",
      "description": "About WritesonicAI search is transforming how 1.5 Billion people discover products weekly. If ChatGPT doesn't recommend you—or worse, recommends your competitor—you're invisible to these high-intent buyers.Writesonic is the only platform that shows you exactly how your brand performs in AI search results. Then take precise actions to boost visibility—create new content, refresh existing pages, or reach out to sites that mention competitors but not you.\nThe RoleWe're hiring a Head of SEO & AI Search who codes their own scripts in the morning and leads strategy meetings in the afternoon. This is 70% hands-on execution, 30% team building. You'll personally run experiments while building a team of A-players who share your obsession with driving demos, not just traffic.You understand that 10,000 visitors mean nothing if they don't convert. You've been optimizing for buyer intent since before \"zero-click search\" was a thing. You know which keywords book demos and which just burn server costs. And now you're applying that same rigor to AI search optimization.This isn't a \"follow the playbook\" role. You'll own our entire search strategy across traditional and AI platforms, run experiments nobody's tried yet, and share what works with our customers.\nYour Week:Conceptualize data studies and work with our devs to analyze millions of AI responsesDefine specs for SEO tools (AI visibility checker, ROI calculators) that devs will buildWrite and publish research reports based on our proprietary dataOptimize high-intent pages that turn searches into demo bookingsTest radical GEO experiments (and document what breaks)Ship whitepapers that position us as the AI search authorityBuild comparison pages that rank #1 and drive pipelineTrack demo attribution from both Google and AI channels\nWhat You'll OwnDrive 50% growth in demo bookings from organic channels (not just traffic)Lead our content strategy for original research and industry reports (with dev support for data analysis)Define requirements for free tools that capture high-intent trafficPioneer GEO strategies that become industry best practicesShip 2-3 major research pieces monthly using our data team's analysisOptimize our conversion path from SERP to demoBuild our presence across Reddit, LinkedIn, and platforms AI trustsLead a team that thinks in data, not just keywords\nYou're Perfect If YouMust Haves:4-8 years crushing SEO for B2B SaaS (preferably US market)Proven track record of driving SQLs and demos, not just trafficExperience directing data studies and research content (even if others did the analysis)Published original research or worked with teams to create data-driven contentAlready running GEO experiments on your own sites or clientsCan show actual revenue impact from SEO (MQLs, demos, pipeline)Comfortable with technical SEO and basic scriptingDeep understanding of search intent and buyer journey mapping\nWhat We OfferFreedom: Own the strategy, run wild with experimentsResources: Dev team to build your tool ideas, data team for analysisPlatform: Your findings become features used by thousands of marketersRecognition: Become the go-to voice in GEORemote: Work from anywhere, async-first cultureGrowth: Direct impact on a product defining a new category",
      "listed_at": "2025-08-25 08:28:55",
      "apply_url": "https://recruitcrm.io/apply/17556724870280060526UjV",
      "workplace_type": "Remote",
      "custom_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGhlUgn8QU4Hg/company-logo_400_400/company-logo_400_400/0/1650618028463/writesonic_logo?e=1759363200&v=beta&t=0mCvDcl18ph_9yCTOXr6jU0wmokKkLqALBim6dtjG6g",
      "job_state": "LISTED",
      "work_remote_allowed": true,
      "job_nature": "Full-time, Contract"
    }
  ]
}