{
  "search_info": {
    "keywords": "SEO",
    "location": "Lisbon",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T16:36:38.847080",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289873156",
      "title": "Search Engine Optimization (SEO) Specialist",
      "company": "Air Apps",
      "location": "Lisboa, Lisbon, Portugal",
      "description": "About Air Apps\n\nAt Air Apps, we believe in thinking bigger—and moving faster. We’re a family-founded company on a mission to create the world’s first AI-powered Personal & Entrepreneurial Resource Planner (PRP), and we need your passion and ambition to help us change how people plan, work, and live. Born in Lisbon, Portugal in 2018—and now with offices in both Lisbon and San Francisco—we’ve remained self-funded while reaching over 100 million downloads worldwide.\n\nOur long-term focus drives us t...",
      "url": "https://www.linkedin.com/jobs/view/4289873156/",
      "custom_logo_url": ""
    },
    {
      "id": "4252375651",
      "title": "SEO Content Editor",
      "company": "ClickOut Media",
      "location": "Lisbon, Lisbon, Portugal",
      "description": "RemotePermanent or Full-time ContractorCompetitive package\n\nAbout Us\n\nClickOut Media is not just a company - it's a thriving ecosystem of diverse talent from around the globe. As a proudly remote-first organisation, we've cultivated an environment where creativity flourishes, collaboration is core, and innovation knows no bounds. With over +850 team members and more than 200 assets, our startup culture fuels our growth, making us a leading force in multi-channel marketing. We specialise in deliv...",
      "url": "https://www.linkedin.com/jobs/view/4252375651/",
      "custom_logo_url": ""
    },
    {
      "id": "4288392113",
      "title": "Senior SEO Manager",
      "company": "DesignRush",
      "location": "Portugal",
      "description": "DesignRush.com is a leading B2B marketplace connecting businesses with agencies. We are seeking an experienced SEO Manager with strong leadership skills and in-depth knowledge of search engine optimization. The ideal candidate will have over 5 years of proven experience in SEO.\nOur platform offers four key values to users:\nAgency Rankings: Brands can view qualified agencies based on their expertise, location, clients, and various other factors.Awards: Agencies and brands can enter their finest w...",
      "url": "https://www.linkedin.com/jobs/view/4288392113/",
      "custom_logo_url": ""
    },
    {
      "id": "4291843819",
      "title": "SEO Writer",
      "company": "Global Citizen Solutions",
      "location": "Portugal",
      "description": "ABOUT US We are an international boutique migration consultancy firm focused on mobility investment solutions and relocation options in several countries from Europe to North America. Our multidisciplinary company is focused on personalized comprehensive services to our clients partnering with key players that might complement our offering in the same high-quality standards that we have as cornerstone of our DNA. \nTHE ROLE We are seeking a skilled copywriter with a strong SEO focus to join our d...",
      "url": "https://www.linkedin.com/jobs/view/4291843819/",
      "custom_logo_url": ""
    },
    {
      "id": "4289940242",
      "title": "SEO Outreach Specialist (m/d/f)",
      "company": "SIXT",
      "location": "Lisbon Metropolitan Area",
      "description": "Are you ready to expand SIXT’s digital presence through strategic partnerships? We are looking for an SEO Outreach Specialist (m/d/f) to identify, build, and manage relationships with relevant websites and stakeholders. In this role, you will have the opportunity to negotiate valuable partnerships, track outreach success, and enhance our online presence. If you have a passion for outreach, a keen eye for detail, and are skilled at cultivating strong relationships, Apply now!\n\n\n\nYOUR ROLE AT SIXT...",
      "url": "https://www.linkedin.com/jobs/view/4289940242/",
      "custom_logo_url": ""
    },
    {
      "id": "4283450181",
      "title": "Marketing Director",
      "company": "Digital Silk - Growing Brands Online",
      "location": "Portugal",
      "description": "We are first and foremost a great team full of ambitious and proactive individuals whose goal is to become the best professionals they can be and make Digital Silk a globally renowned digital agency. Our quest for excellence has resulted in our company’s growth and continuous need for outstanding team members.\nWe are seeking a hands-on Marketing Director to boost Digital Silk’s Brand Awareness & Lead Generation.\nWe are seeking a true Marketing Expert with proven hands-on expertise in:\nAnalyticsA...",
      "url": "https://www.linkedin.com/jobs/view/4283450181/",
      "custom_logo_url": ""
    },
    {
      "id": "4289844088",
      "title": "SEO Copywriting Specialist",
      "company": "Visuable",
      "location": "Portugal",
      "description": "Company: VisuableWebsite: www.visuable.coRemote (Europe) | Full-time\nApplications for this role are open until midnight on Sunday, 31st August 2025. After the deadline, we will begin the selection process.\nAt Visuable, we help entrepreneurs grow their businesses with stunning branding, powerful websites, and smart digital strategies—and we’re currently looking for a friendly, curious, and results-driven SEO Copywriting Specialist to join our team!\nIf you love talking to clients about their SEO g...",
      "url": "https://www.linkedin.com/jobs/view/4289844088/",
      "custom_logo_url": ""
    },
    {
      "id": "4279637743",
      "title": "Senior SEO Manager - Growth & Strategy",
      "company": "Mobilexpense",
      "location": "Lisbon, Portugal",
      "description": "Location: Hybrid – LisbonStart Date: ASAPReporting To: Head of MarketingSalary: Competitive + benefits\nWhy This Role, and Why Now?Mobilexpense is a fast-scaling B2B SaaS company transforming expense management across Europe. We’re on a mission to grow our organic presence into a dominant, revenue-driving channel and we’re looking for a Senior SEO Manager with scale-up experience in the tech B2B SaaS world to lead the charge.If you’ve grown organic revenue from thousands to millions in ARR not in...",
      "url": "https://www.linkedin.com/jobs/view/4279637743/",
      "custom_logo_url": ""
    },
    {
      "id": "4289555447",
      "title": "Search Operations Quality Assurance - French Speaking",
      "company": "TikTok",
      "location": "Lisbon, Lisbon, Portugal",
      "description": "Responsibilities\nOur Search Operations team supports our efforts to address objectionable or disturbing content which could include images of violence, animal cruelty, hate speech, violent extremism, or content that exploits or endangers children. The team plays a vital role in analyzing user searches and search strategy optimization to ensure a positive and safe user experience for our community. \n\nContent that the position interacts with includes images, video, and text related to every-day li...",
      "url": "https://www.linkedin.com/jobs/view/4289555447/",
      "custom_logo_url": ""
    },
    {
      "id": "4289870614",
      "title": "Search Engine Optimization Specialist",
      "company": "Harland & Poston Group",
      "location": "Lisbon Metropolitan Area",
      "description": "Harland & Poston Group – parent company of Investment Visa, Portugal Homes, and HP Invest – is seeking an Experienced SEO Specialist to lead our organic growth strategy across three international brands.\nThe Role:As SEO Specialist, you will take ownership of our organic performance and drive measurable results in lead generation and brand visibility. You’ll work closely with content, development, and paid media teams to ensure SEO is at the core of our digital strategy.\nKey Responsibilities:Deve...",
      "url": "https://www.linkedin.com/jobs/view/4289870614/",
      "custom_logo_url": ""
    }
  ]
}