{
  "search_info": {
    "keywords": "SEO",
    "location": "Tokyo",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T16:33:41.412827",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4289835823",
      "title": "Freelance Link Builder",
      "company": "GMI Cloud",
      "location": "APJ",
      "description": "Job Title: Freelance Link Builder (Remote · APJ)\nJob Nature:Position: Freelance Link BuilderWork Mode: 100% RemoteReports to: SEO Manager\nKey Responsibilities:Develop and execute link-building strategies to enhance the Domain Authority of www.gmicloud.ai.Identify and negotiate high-quality backlink opportunities from websites relevant to the cloud computing industry (including guest posts, resource pages, partnership links, etc.).Oversee the publishing process: including writing/reviewing submis...",
      "url": "https://www.linkedin.com/jobs/view/4289835823/",
      "custom_logo_url": ""
    },
    {
      "id": "4277384418",
      "title": "Digital Content Author",
      "company": "OLIVER Agency",
      "location": "Tokyo, Japan",
      "description": "Established in 2004, OLIVER is the world’s first and only specialist in designing, building, and running bespoke in-house agencies and marketing ecosystems for brands. We partner with over 300 clients in 40+ countries and counting. Our unique model drives creativity and efficiency, allowing us to deliver tailored solutions that resonate deeply with audiences.\n\nAs a part of The Brandtech Group, we're at the forefront of leveraging cutting-edge AI technology to revolutionise how we create and deli...",
      "url": "https://www.linkedin.com/jobs/view/4277384418/",
      "custom_logo_url": ""
    },
    {
      "id": "4287143940",
      "title": "Prompt Evaluator",
      "company": "Innodata Inc.",
      "location": "Japan",
      "description": "Job Description:We are seeking highly analytical and detail-oriented professionals with hands-on experience in Red Teaming, Prompt Evaluation, and AI/LLM Quality Assurance. The ideal candidate will help us rigorously test and evaluate AI-generated content to identify vulnerabilities, assess risks, and ensure compliance with safety, ethical, and quality standards.\n Key Responsibilities:Conduct Red Teaming exercises to identify adversarial, harmful, or unsafe outputs from large language models (LL...",
      "url": "https://www.linkedin.com/jobs/view/4287143940/",
      "custom_logo_url": ""
    },
    {
      "id": "4289689745",
      "title": "Content Marketing Manager - Global Tech Giant - Up to 12M",
      "company": "Michael Page",
      "location": "Japan",
      "description": "Working at a leading tech giant in e-commerce.Opportunity to collaborate with international team.\n\n\nAbout Our Client\n\nThe company is a large organization known for its innovative approach and leadership in the retail industry. With a focus on delivering impactful marketing solutions, the company provides a collaborative environment that encourages professional growth and excellence.\n\nJob Description\n\nDevelop and execute partner marketing strategies to support business objectives in the retail in...",
      "url": "https://www.linkedin.com/jobs/view/4289689745/",
      "custom_logo_url": ""
    },
    {
      "id": "4288545311",
      "title": "Content Manager",
      "company": "Talo",
      "location": "APAC",
      "description": "\nJob Title: Internal Content ManagerFull-time | RemoteReports to: FounderWe’re a fast-growing creative agency making advertising content for DTC brands.After establishing ourselves over the last few years working with some of the biggest brands and athletes in the world, we’re now building the content force behind our own brand.You’ll be the operator driving all our internal content across social platforms, shaping our voice, and building a content machine that grows our agency and founder brand...",
      "url": "https://www.linkedin.com/jobs/view/4288545311/",
      "custom_logo_url": ""
    },
    {
      "id": "4290682436",
      "title": "SEO Content Manager",
      "company": "travSIM",
      "location": "Tokyo, Japan",
      "description": "📍 Location: Greater Tokyo Area, Japan (Hybrid)💼 Employment Type: Full-time💰 Salary: Competitive, based on experience🗓️ Start Date: ASAP🛒 Department: Marketing / Content & SEO\nLead Our Global SEO Content StrategytravSIM is an international provider of eSIM and SIM card solutions for travellers and businesses worldwide. We are expanding in Japan and seeking an experienced SEO Content Manager to plan, create, and optimise high-quality digital content that drives organic traffic, improves search ran...",
      "url": "https://www.linkedin.com/jobs/view/4290682436/",
      "custom_logo_url": ""
    },
    {
      "id": "4290476459",
      "title": "E-Commerce Manager",
      "company": "Specialized Group",
      "location": "Tokyo, Japan",
      "description": "E-Commerce Manager\n\nWe are seeking an E-Commerce Manager for a top client in the luxury fashion sector. This role involves overseeing the e-commerce operations for a well-known brand. If you are passionate about luxury fashion and have significant e-commerce experience, this role might be for you. You will be responsible for shaping the company's online presence and will work with leading professionals in a dynamic environment.\n\n\n主要な責任:\nEコマースプラットフォームの全体管理を行い、スムーズなオンラインショッピング体験を提供します。オンライン販売拡大とブラ...",
      "url": "https://www.linkedin.com/jobs/view/4290476459/",
      "custom_logo_url": ""
    },
    {
      "id": "4288799497",
      "title": "Digital Marketing Data Analyst",
      "company": "TransPerfect",
      "location": "Japan",
      "description": "Do you live and breathe data? Are you passionate about using analytics to drive smarter marketing decisions? Join our freelance team as a Digital Marketing Data Analyst and play a pivotal role in shaping the performance visibility, tracking accuracy, and reporting quality across all our digital channels — from Paid Media to SEO and Social Media.\nAbout the roleThis role is responsible for implementing robust analytics frameworks, setting up and maintaining conversion tracking, and developing dash...",
      "url": "https://www.linkedin.com/jobs/view/4288799497/",
      "custom_logo_url": ""
    },
    {
      "id": "4283083571",
      "title": "Content Specialist",
      "company": "Confidential",
      "location": "APAC",
      "description": "Job Title: AI Data Contributor (Remote - Contract)Location: RemoteJob Type: ContractIndustry: Information Technology & ServicesFunction: Data Analysis / Content Moderation / LinguisticsExplore Flexible Remote Work Opportunities in AI Data ProjectsAre you looking for a flexible remote role where you can contribute to innovative AI projects? We’re seeking detail-oriented individuals to join a pool of contributors working on cutting-edge digital initiatives. This contract-based opportunity allows y...",
      "url": "https://www.linkedin.com/jobs/view/4283083571/",
      "custom_logo_url": ""
    },
    {
      "id": "4288882806",
      "title": "Marketing Manager - Web3",
      "company": "Unicast.ai",
      "location": "APAC",
      "description": "About us:Unicast.ai is a next-generation career hub for the Web3 industry: The platform integrates a job board with a mini-app, and smart bots into the heart of the Web3 community on Telegram. Transforming how talent & freelancers connect with Web3 projects with an AI-powered platform, community-driven approach that rewards engagement.\nAbout the Company:Our partner is a cutting-edge blockchain platform specializing in decentralized finance (DeFi) solutions. They've gained recognition for their i...",
      "url": "https://www.linkedin.com/jobs/view/4288882806/",
      "custom_logo_url": ""
    }
  ]
}