{
  "search_info": {
    "keywords": "SEO",
    "location": "Berlin",
    "limit_requested": 10,
    "jobs_found": 10,
    "search_timestamp": "2025-08-27T16:35:41.931277",
    "data_coverage": "100% - All available fields extracted",
    "export_version": "ultra_complete_v1.0"
  },
  "jobs": [
    {
      "id": "4288580484",
      "title": "Technical SEO Manager - relocation to Cyprus",
      "company": "Medier Agency",
      "location": "European Union",
      "description": "We are looking for a highly skilled SEO Expert with proven experience in the iGaming industry to join our team. This role requires deep technical expertise, a strong understanding of complex web environments, and a track record of driving measurable organic growth. The ideal candidate will combine hands-on technical SEO knowledge with the ability to create clear implementation roadmaps for development teams.\nThis is an on-site in Limassol. We will be happy to relocate you!\nKey Responsibilities:L...",
      "url": "https://www.linkedin.com/jobs/view/4288580484/",
      "custom_logo_url": ""
    },
    {
      "id": "4290677065",
      "title": "[GLOBAL/INT] [MARKETING] SEO Manager",
      "company": "HelloFresh",
      "location": "Berlin, Berlin, Germany",
      "description": "The role\n\nWe are looking for a highly skilled and experienced SEO Manager to join our dynamic SEO team. As a part of the team, you will have a direct impact on our success by developing and executing effective SEO strategies to expand our reach, so that many more people around the world can enjoy HelloFresh meals.\n\nApart from a deep understanding of the best practices, data analysis, and content strategy, the ideal candidate will have the technical skills to design and implement programmatic SEO...",
      "url": "https://www.linkedin.com/jobs/view/4290677065/",
      "custom_logo_url": ""
    },
    {
      "id": "4291074898",
      "title": "Freelance SEO Expert",
      "company": "Twine",
      "location": "European Economic Area",
      "description": "An SEO specialist is required to optimize a new website for a health and wellness provider in Austin, Texas. The website, currently in development and set to launch within the next month, needs to be search-engine ready from the outset. The focus will be on building a strong SEO foundation during the development phase, followed by ongoing optimization and strategy to grow online visibility and attract new clients. This is a remote position suited for a professional who can deliver both technical...",
      "url": "https://www.linkedin.com/jobs/view/4291074898/",
      "custom_logo_url": ""
    },
    {
      "id": "4288886117",
      "title": "Content Writers / Generalists ( Part-Time ) $45 – $50/hr Remote US ",
      "company": "Call For Referral",
      "location": "European Union",
      "description": "Creative Writers and GeneralistsRemote | Hourly Contract | $45–$50 per hourRole OverviewCreative Writers and Evaluation Tutors are needed to support research projects in collaboration with a leading AI lab. The role involves contributing to data campaigns across Creative Writing, Companionship, and Presentation domains. Successful candidates will apply judgment, critical thinking, and domain expertise to evaluate which responses are most effective, natural, and compelling.Ideal ProfilesCreative ...",
      "url": "https://www.linkedin.com/jobs/view/4288886117/",
      "custom_logo_url": ""
    },
    {
      "id": "4288985908",
      "title": "Experienced Link Builder",
      "company": "White Light Digital Marketing",
      "location": "Germany",
      "description": "WLDM is hiring an SEO Link Builder who can deliver high-authority links in the casino space. We work exclusively with top-tier clients, including private equity-backed ecom brands, and we’re looking for execution-first operators who know how to build results—not just relationships.\n\nThe Role\n\nWhat You’ll Own\n\nLink Delivery – Build and land white-hat links on high-quality domains that boost rankings and traffic.Outreach Ops – Run scalable outreach campaigns that earn real placements—not spammy su...",
      "url": "https://www.linkedin.com/jobs/view/4288985908/",
      "custom_logo_url": ""
    },
    {
      "id": "4256688468",
      "title": "GTM Content Marketing Manager",
      "company": "ZenRows",
      "location": "EMEA",
      "description": "GTM Content Marketing Manager (100% Remote)\nAbout ZenRows: Born in the vibrant heart of the Basque Country in Bilbao, ZenRows is one of Europe's fastest-growing startups. Founded in 2021, we are dedicated to revolutionizing data workflows with our cutting-edge web data extraction platform, used globally across industries like e-commerce, real estate, finance, and AI. Our mission is to empower businesses with seamless, scalable data solutions to drive automation, analytics, and AI-driven insights...",
      "url": "https://www.linkedin.com/jobs/view/4256688468/",
      "custom_logo_url": ""
    },
    {
      "id": "4277733115",
      "title": "Senior SEO Manager (f/m/d)",
      "company": "Spread Group",
      "location": "Berlin, Berlin, Germany",
      "description": "Who We Are\n\nSpread Group is a renowned global provider of customized apparel and lifestyle products, distinguished by our commitment to made-to-order technology. Our core business model revolves around producing precisely what our customers desire, precisely when they desire it. As pioneers in this space, we combine sustainability with on-demand personalization, enabling individuals and businesses to express their unique identities through bespoke creations. Join us to be part of a global leader...",
      "url": "https://www.linkedin.com/jobs/view/4277733115/",
      "custom_logo_url": ""
    },
    {
      "id": "4255705589",
      "title": "Market Manager(Hotel)",
      "company": "Dida",
      "location": "Berlin, Germany",
      "description": "Market Manager \nDescription:Build and progressively expand a portfolio of local hotel partners and assigned regional chains / international chains by negotiating and securing win-win distribution partnerships, facilitating the hotel onboarding, and owning DidaTravel’s day to day relationship with your portfolio of hotels;Execute effectively based on KPI metrics (targets, goals and/or strategic objectives) set by the company;Engage with both individual hotels and hotel groups in your market in or...",
      "url": "https://www.linkedin.com/jobs/view/4255705589/",
      "custom_logo_url": ""
    },
    {
      "id": "4289302378",
      "title": "Head of SEO",
      "company": "DesignRush",
      "location": "Germany",
      "description": "DesignRush.com is a leading B2B marketplace connecting businesses with agencies. We are seeking an experienced Head of SEO with strong leadership skills and in-depth knowledge of search engine optimization. The ideal candidate will have over 5 years of proven experience in SEO.\nOur platform offers four key values to users:\nAgency Rankings: Brands can view qualified agencies based on their expertise, location, clients, and various other factors.Awards: Agencies and brands can enter their finest w...",
      "url": "https://www.linkedin.com/jobs/view/4289302378/",
      "custom_logo_url": ""
    },
    {
      "id": "4290672341",
      "title": "Senior SEA Manager (f/m/x)",
      "company": "AUTO1 Group",
      "location": "Berlin, Berlin, Germany",
      "description": "Company Description\n\nAutohero is Europe’s largest independent used car dealer, revolutionizing the way customers find and buy cars. As part of the Auto1 Group, we are disrupting one of the largest industries still dominated by traditional players. With our unique online and offline presence, we offer customers a seamless, transparent, and hassle-free car-buying experience.\n\nOur pioneering team of marketing experts uses data-driven insights to run efficient performance marketing campaigns and imp...",
      "url": "https://www.linkedin.com/jobs/view/4290672341/",
      "custom_logo_url": ""
    }
  ]
}